{
  "name": "Captain America",
  "role": "Vanguard",
  "stats": {
    "health": 600,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#FCA5A5",
    "color_theme_secondary": "#60A5FA"
  },
  "abilities": [
    {
      "name": "SENTINEL STRIKE",
      "keybind": "LMB",
      "type": null,
      "description": "Get up close to strike enemies. Landing the second hit enables a shield throw that can ricochet four times.",
      "casting": "Change Form",
      "damage": "40 (Melee) - 45 (Flying Shield)",
      "damage_falloff": null,
      "fire_rate_interval": "Melee 1st Hit: 0.4s, Melee 2nd Hit: 0.5s\nFlying Shield 1st Hit: 0.5s, Flying Shield 2nd Hit: 0.57s",
      "ammo": 4,
      "critical_hit": null,
      "cooldown": null,
      "range": "4m (Melee) - 25m (Flying Shield)",
      "projectile_speed": "60m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Automatically target enemies near the crosshair"
    },
    {
      "name": "LEADING DASH",
      "keybind": "SHIFT",
      "type": null,
      "description": "Boost speed and enable Fearless Leap to leap into the air.",
      "casting": "Channeled",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "33.40%",
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "VIBRANIUM ENERGY SAW",
      "keybind": "E",
      "type": null,
      "description": "Hurl the energy-charged shield to strike enemies in a path.",
      "casting": "Single-cast projectile that can ricochet",
      "damage": "Start at 70, with a 20% reduction for each ricochet",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": "25m",
      "projectile_speed": "80m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "ricochet_speed": "150m/s"
      }
    },
    {
      "name": "LIBERTY RUSH",
      "keybind": "F",
      "type": null,
      "description": "Raise the shield and charge forward.",
      "casting": "Single-cast forward dash",
      "damage": "30",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "10s",
      "range": "12m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "SUPER-SOLDIER SLAM",
      "keybind": null,
      "type": null,
      "description": "Slam down from the sky onto the targeted area, Launching Up enemies.",
      "casting": "Targeted",
      "damage": "30",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "12s",
      "range": "20m (horizontal)",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "LIVING LEGEND",
      "keybind": null,
      "type": null,
      "description": "Raise the shield to deflect incoming projectiles, sending them ricocheting in random directions.",
      "casting": "Channeled",
      "damage": null,
      "damage_falloff": "50%",
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "1s - 5s (if destroyed)",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "MAXIMUM SHIELD VALUE": 350,
        "RECOVERY SHIELD VALUE": "50/s",
        "DELAYED RECOVERY AFTER RELEASE": "2s"
      }
    }
  ],
  "ultimate": {
    "name": "FREEDOM CHARGE",
    "keybind": "Q",
    "type": null,
    "description": "Shield held high, carve a path forward, granting both himself and allies along the path continuous Bonus Health and Movement Boosts. Using Living Legend or Leading Dash while this ability is active can Launch Up enemies.",
    "casting": "Activation",
    "damage": null,
    "range": "A spherical spell field with a 4m radius enveloping the caster, and a spell area with a width of 4m along the path",
    "effect": null,
    "duration": "10s (spell field) - 5s (spell area)",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": "Grant a 30% Movement Boost to both yourself and your allies",
    "bonus_health_details": "Cast to gain 150 Bonus Health and grant allies 100 Bonus Health. Every second afterward, gain 100 Bonus Health and grant allies 60 Bonus Health",
    "energy_cost": 2800,
    "details": null
  },
  "passives": [
    {
      "name": "CAPTAIN'S SPIRIT",
      "keybind": null,
      "type": "PASSIVE",
      "description": "Inspired by Captain America's resolve, Winter Soldier can leap to the aid of a designated ally, slamming the ground with his mechanical arm to deal damage to nearby foes. Additionally, Captain America and Winter Soldier can interact with each other once both parties confirm. The duo collides and unleashes a shockwave that deals damage and inflicts slow on enemies",
      "cooldown": null,
      "damage": null,
      "range": null,
      "trigger_condition": null,
      "effect_boost": null,
      "speed_details": null,
      "details": "TEAM-UP BONUS - +100 Max Health and 5% Damage Boost"
    }
  ],
  "teamups": [
    {
      "name": "Stars Aligned",
      "details": "Key Clash: C<br/>Clash Damage: 80<br/>Clash Damage Range: 10m spherical range<br/>Prompt Range Clash: Up to 30m<br/>Special Effect: A Slow effect is applied to enemies hit with Clash damage",
      "teamup_bonus": "+100 Max Health and 5% Damage Boost"
    }
  ],
  "gameplay": {
    "strategy_overview": "To be added",
    "weaknesses": [
      "Living Legend has a 1 second cooldown after the player pulls the shield down, which can interrupt the flow of his combat a bit.",
      "Struggles to block large barrages of ranged damage due to the smaller size of his shield compared to the likes of Doctor Strange's Shield of the Seraphim and Magneto's Metallic Curtain.",
      "His shield cannot block splash damage, such as Iron Man's Repulsor Blast and Jeff the Land Shark's Aqua Burst. He can, however, deflect those moves if they're aimed directly at him.",
      "The player has no control of where deflected projectiles will ricochet to."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Like Old Times",
        "description": "As Captain America, partner with Winter Soldier to land 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Justice for All!",
        "description": "As Captain America, land 3 KOs with a single use of Freedom Charge.",
        "points": 10
      }
    ],
    "official_description": "Captain America is a Vanguard hero in Marvel Rivals, and is the 25th hero introduced to the game's roster. He has team-up abilities that work in conjunction with Winter Soldier."
  },
  "lore_details": {
    "ingame_bio_quote": "\"Freedom's an idea that will never die.\"",
    "ingame_bio_text": "Enhanced by the Super-Soldier Serum, Steven Rogers uses his Vibranium shield and extensive combat training to confront any threat to justice. When Captain America rallies his troops, a wave of courage sweeps across the battlefield!",
    "ingame_story_intro": "\"I fight for more than a flag, I fight for an idea. One bigger than all of us.\"\nIn hopes of serving his country during World War II, young Steve Rogers volunteered for an experiment that enhanced his strength, speed, and agility, making him America's first super soldier. As Captain America, he proudly fought enemy forces until he became frozen in ice and lost to the ages.'\nDiscovered and unthawed in the 2080s, Captain America began battling the threats of tomorrow — including Doom 2099 — until he was displaced into the present by the Timestream Entanglement. Now, he fights alongside the Avengers to prevent the desperate future in which he awoke.",
    "hero_stories": [
      {
        "title": "Battlefield Surgery",
        "content": "Steve Rogers was a man out of time. A man out of space. And, perhaps for the first time ever, a man out of his depth.\nWhat he had experienced over these last few weeks had made the epic adventures he'd lived through during World War II seem normal and mundane. Steve stood on a balcony, gazing out over the spaceport of the futuristic city in front of him, wondering why the universe had chosen to bring him back here and now after so many years away. He didn't know the answer yet, but he knew deep down there had to be a reason. There always was.\n\"A penny for your thoughts, old man?\" a voice said, approaching from behind. Steve turned to see Clint Barton, the archer known as Hawkeye, joining him.\nSteve gazed past Clint and caught a glimpse of his old partner, James \"Bucky\" Barnes, lying deathly still inside of a high-tech medical scanner as scientists and physicians tended to his wounds. It was clear that Bucky was no longer the plucky teen sidekick who had never strayed from Captain America's side during the war. He had grown into his own man... but far more than that. He was now a skilled assassin with a cybernetic arm and a tortured past, developments Steve had missed while he was frozen inside a chunk of ice for the last century or so. During that time, Bucky had become the Winter Soldier, and Steve wasn't sure just how much of the boy he once knew still remained. Especially after what Hydra had just done to him...\n\"Just thinking about how much has changed,\" Steve replied.\n\"I hear ya,\" Clint agreed. \"Speaking of which... When are you finally gonna tell me why you brought us to this crazy interstellar version of Wakanda? Or, you know, how you're still alive? Because, as far as I can remember, Captain America fell in the line of duty...\"\n\"Now's as good a time as any, I suppose,\" Steve said, realizing that this was the first real downtime he'd had since he'd brought Clint and Bucky into his strange new world. Steve took a deep breath before he began to tell his tale.\nHe started by regaling Clint with the story of his final mission during the war, when the plane he was on crashed into the Arctic Ocean. As the plane filled with water, he could feel his muscles freezing, his heartbeat slowing, his vision blurring to white. And then... nothing... for what seemed like an eternity. He didn't know if he was alive or dead until he found himself trapped inside of a glass tube, freshly thawed out of a chunk of ice by a beautiful redhead with the slightest hint of a Russian accent.\n\"Natasha?!\" Clint exclaimed.\nSteve could tell by his new friend's reaction that he had history with this mystery woman. He wanted to ask Clint who she was, how he knew her, why she would have rescued him, and where she could be found now. But those questions would have to wait until after his story was done.\nSteve continued, telling how he and Natasha had escaped from the Alchemax lab together, only to be caught in a massive explosion before they could reach safety. Steve protected Natasha from the detonation, but quickly realized that his continued presence would only put a target on her head. So he decided to disappear.\nWith the help of a tough-as-nails Resistance soldier named Logan, Steve found his way to the embassy of a nation whose king he had befriended during the war.  If anyone could provide him a safe haven until he got his bearings, he imagined it would be the isolationist African nation of Wakanda. But when Steve and Logan arrived at the Wakandan Embassy, it looked as though it had been abandoned for years. All that remained were the silent statues of former Black Panthers guarding their nation's proud legacy.\nExamining the statue of Bashenga - the first Black Panther - Steve took note of the inscription on its base: Since the birth of this nation, our people have reached for the stars. At last, we have found them.\nSteve didn't know what that meant, but he would find out when Logan activated the high-tech Kimoyo bead given to them by their Resistance allies. A strange portal opened up next to the sculpture of Bashenga, and Steve stepped through. In the blink of an eye, he arrived on the other side of the universe, finding himself in a city so advanced that it seemed like something straight from one of those science-fiction serials the boys at Camp Lehigh loved to watch on their nights off. This was the Intergalactic Empire of Wakanda. And its monarch was waiting for him.\nKing T'Challa and his sister Shuri welcomed Steve with open arms, offering him a safe place to stay and full access to their technology. T'Challa shared stories that his father had passed down to him about his trusted ally in star-spangled armor. Shuri even crafted a new shield forged from Vibranium alloy, just like the one Steve had carried during the war. With a few perks of course.\nAs Steve searched for more answers about this new world - a world where it was no longer 1945, but instead, the year 2099 - what he found was more unsettling than he had originally realized. The future he had awoken in was just one of many - an endless collection of possible timelines that were currently in the process of collapsing on each other due to a phenomenon known as the Timestream Entanglement.\nT'Challa and Shuri had already reached out to scientists and heroes from other realities in hopes of finding a way to repair the timelines, but the process was beginning to lead to conflicts between groups with disparate goals and methods. T'Challa knew that the time would eventually come where the heroes would have to confront not only the darkness that loomed on the horizon, but perhaps each other as well. And so he asked Steve a favor: To gather the very best soldiers from across time and space and bring them into their fold. When Steve agreed, there was no doubt whose name would be first on his list.\n\"And I'm flattered, Cap,\" Clint said with his trademark smirk. \"Really.\"\n\"It was Bucky I was after,\" Steve admitted, missing Clint's sarcasm, \"but I'm not complaining that you happened to come along for the ride. He says you're one of the good ones.\"\nTruthfully, Clint couldn't even dream of being insulted that he wasn't Cap's first pick. After all, this clearly wasn't the same version of Steve Rogers that he'd served alongside on the Avengers for so many years. That Steve had died trying to save the world. The Steve in front of him now didn't even know that Hawkeye existed until a few days ago, when he jumped through time and space to save Clint and Bucky from certain death in the depths of a crumbling Hydra base before bringing them back to this bizarre future.\n\"You know who else is one of the good ones?\" Hawkeye asked, growing a bit weary of the history lesson. \"Nat, If she's still around in this weird world of yours, we probably ought to track her down. I'm sure Bucky would tell you the same if he wasn't currently out cold...\"\nAs if on cue, Steve and Clint heard a commotion behind them. They turned to see Bucky, who was now standing next to the mad-station that he'd been lying in moments earlier. Wakandan doctors scurried about, not sure how their patient could possibly be on his feet in his condition.\n\"Steve...\" Bucky said, straining to form words as he leaned against the scanner to steady himself. Something was wrong.\n\"What is it, partner?\" Steve asked with concern. Even though this wasn't technically the Bucky he had known his whole life, Steve could still see as clear as day that his friend was struggling.\n\"Not feeling so good...\" Bucky said. \"It's like... someone is whispering in my brain...\"\n\"Oh, no.\" Clint said. \"Some sort of Hydra conditioning?\"\n\"No... Not Hydra...\" Bucky responded, every word dripping with pain. \"It's something older... Darker...\"\nSteve and Clint glanced over at a nearby statue of Bast, the panther goddess worshipped by the Wakandan people, and realized that its eyes had begun to radiate a deep red.\n\"That can't be good,\" Clint mused.\n\"Not at all,\" Steve agreed.\nAs Bucky writhed in pain, his eyes began to glow the same red as the statue's. A cluster of organic tentacles started to rapidly grow from the place where his brand new cybernetic arm met his shoulder. They intertwined with the technology of his artificial limb, seeming to integrate into it as they transformed the arm into something new entirely. Bucky let out a scream as the snake-like limbs extended from the end of the arm and flailed about wildly, striking towards Steve and Clint.\n\"I thought I cut those things off!\" Clint yelled as he dodged out of the way.\n\"It didn't take,\" Steve said, blocking the whipping appendages with his shield to prevent them from striking a Wakandan scientist. \"Innocents are in danger here. Let's take this battle somewhere more open.\"\nWithout another word, Steve and Clint both ran at full speed toward the edge of the balcony and leapt down several floors to the spaceport below. Landing safely, they looked up and saw the Winter Soldier was in hot pursuit, just as they had hoped.\n\"We need to get to the palace and alert T'Challa and Shuri,\" Steve said. \"Clint, think you can pilot a Wakandan starship?\"\n\"I can pilot anything,\" Clint said with a wide grin. He ran over to one of the Wakandan crafts and leapt into the cockpit with the grace and skill of a circus acrobat. With the flick of a few switches, the ship began to rise into the air. But before it could depart toward the Wakandan palace, it was ensnared by the tentacles extending from Bucky's arm.\nClint hit the thrusters, but the tentacles held the ship in midair. Bucky didn't even budge, somehow drawing an intense amount of superhuman strength from the dark force possessing him.\nSuddenly, Captain America's shield ricocheted through the spaceport, gaining momentum with each bounce before finally slicing the tentacles in twain and forcing Bucky to release his grip on the ship. As Clint jetted off toward safer skied, Steve heroically leapt up and caught his shield in midair.\n\"Snap out of it, Bucky,\" Steve said as he landed back on the ground, shield at the ready.\n\"No,\" Bucky replied. As he instinctively retracted the wounded tentacles back into his body, they once again seemed to merge with the technology of his cybernetic arm.\nKnowing that there was no other option, Steve raced toward Bucky, ready to face the unexpected threat head on. Bucky matched Steve's sprint and rushed at his former partner, leaping into the air and raising his bionic fist, ready to strike. Steve hoisted his shield, blocking the blow. The impact of Vibranium sent a shockwave through the spaceport that shattered every window in a 100 meter radius.\nThe clash that followed felt longer than World War II, at least to Steve. The two soldiers knew each other so well that neither could get a hit in that wasn't instantly blocked and countered. Despite their effort, they were getting nowhere. And while Steve Rogers knew he could do this all day, he wasn't sure how much longer Bucky could survive the dark forced that had taken control of him.\n\"Looks like you could use the cavalry, Cap,\" Clint yelled out as he landed his spacecraft on the nearby launch pad. As he exited the cockpit, Steve realized that his new friend hadn't come alone. With him was Princess Shuri, one of Wakanda's most brilliant scientists and the designer of Bucky's new cybernetic arm.\n\"I have good news and bad, Captain,\" Shuri said, extending her arm to reveal her bracelet made of high-tech Kimoyo beads. As she touched one of the beads, a hologram of Bucky's arm appeared in the air. \"The cybernetic limb I created for your friend is made from a number of bleeding-edge materials, including Vibranium, nanotech, and Unstable Molecules.\"\n\"Is that the good news of the bad?\" Steve asked, unfamiliar with anything other than Vibranium.\n\"It is both,\" Shuri responded. \"These technologies are all extremely adaptable, which may be the reason the limb has so easily accepted the unexpected additions to your friend's physiology.\"\n\"That all sounds like bad news to me,\" Steve said.\n\"Ah, but those technologies also have a memory,\" Shuri continued. \"They work in unison to sync to the host's unique internal energy signature. When that energy becomes corrupted, the limb can be used to recalibrate the internal systems of the person wearing it.\"\n\"in other words, we can restore Bucky to factory settings,\" Clint added.\n\"How do we do that?\" asked Steve.\n\"The procedure requires a manual reset,\" Shuri responded. \"However, the likelihood that Bucky will allow you to get close enough to perform one seems slim.\"\n\"I don't need to get close,\" Clint said. \"Just keep him busy, Cap, and I'll show you why you made me an Avenger.\"\nSteve called out to Bucky, getting his partner's full attention. This time, instead of engaging his opponent directly, Steve kept his distance, dodging and weaving along the edge of the spaceport. Bucky frantically lashed out at him, narrowly missing with every strike.\nMeanwhile, Shuri attached a Kimoyo bead to the head of one of Hawkeye's arrows. The bead, programmed with a kill code that would initiate a forced reboot of the arm's operating systems, would have to hit a one millimeter target located on the back of Bucky's shoulder. Clint would only have one shot. Luckily, that's all he ever needed.\nClint nocked his arrow and watched carefully as Bucky swung at Steve, over and over. He waited patiently until his target was in the perfect position. Then he released the arrow, letting it soar toward Bucky's shoulder - a perfect hit!\nThe cybernetic arm instantly shut down and the tentacles, which had been flailing madly, dropped limp to Bucky's side. Bucky staggered for a moment and then fell to his knees. Steve and Clint both raced to their friend's side.\n\"Sorry... about that...\" Bucky said, regaining his composure. \"don't know... what came over me...\"\n\"Neither do I,\" Shuri said, joining the trio of heroes, \"but I think it would be worth running some tests. I already have some ideas as to how we can get your newfound talents under control and repurpose the strange energy flowing through you...\"\n\"Great...\" Bucky said. \"More experiments...\"\n\"Don't worry, partner,\" Steve said, leading Bucky toward the spacecraft so that he could be transported back to Shuri's lab. \"Whatever this is, you're not going through it alone. Not ever again.\"\n\"I'm glad to have you back, Steve,\" Bucky said, offering a faint smile as his strength started to return.\nSteve proudly looked at his new allies, the brave soldiers he had gathered. Even after the chaos that had just occured, there still wasn't anyone else he's rather have by his side to face the unexpected challenges ahead.\n\"I'm glad to be back,\" Steve Rogers said. And for the first time since he had awoken in this strange new world, he truly meant it.",
        "status": null
      },
      {
        "title": "The Free Sentinel",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      },
      {
        "title": "Ready For War",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Captain America was released as the 25th character to be introduced to Marvel Rivals as a Vanguard hero.",
          "Added 3 new costumes: Captain A.I.M.erica, Captain Gladiator, and Galactic Talon (Limited-time store release: 2024/12/06 - 2024/12/27)",
          "Added the Justice For All! achievement.",
          "Added to the Voltaic Union Team-Up Ability with Thor and Storm."
        ]
      },
      {
        "date_version": "24/12/10: Version 20241210",
        "changes": [
          "In certain extreme situations, Captain America's Ultimate wouldn't end as intended. This issue has been resolved."
        ]
      },
      {
        "date_version": "25/01/10: Version 20250110 / Season 1: Eternal Night Falls Launch",
        "changes": [
          "Reduce the delay time for shield restoration after releasing Living Legend from 3s to 2s.",
          "Reduce Liberty Rush cooldown from 12s to 10s.",
          "Increase base health from 650 to 675.",
          "Reduce the energy cost for releasing Freedom Charge from 3400 to 3100.",
          "Reduce the additional health provided per second to self after releasing Freedom Charge from 110 to 100."
        ]
      },
      {
        "date_version": "25/02/07: Version 20250207",
        "changes": [
          "Added 1 new costume: Avengers: Infinity War."
        ]
      },
      {
        "date_version": "25/02/20",
        "changes": [
          "Corrected an issue where during Captain America's ultimate, he couldn't be stunned by Spider-Man's ultimate."
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "He will be able to shield himself with Living Legend mid-leap.",
          "Increase Vibranium Energy Saw's projectile speed from 60m/s to 80m/s, with ricochets ramping up from 100m/s to a supercharged 150m/s.",
          "Reduce the energy cost of Freedom Charge from 3100 to 2800.",
          "Enhance Captain America's combat experience by separating Sentinel Strike from melee attacks.",
          "Captain America will be able to use melee attacks while his shield is thrown or during the Team-Up Ability Charged Aegis state to activate the first two hits of Sentinel Strike. Additionally, while airborne, using melee attacks will no longer trigger the Super-Soldier Slam ability."
        ]
      },
      {
        "date_version": "25/04/08",
        "changes": [
          "Resolved an issue where Captain America couldn't ricochet enemy projectiles while moving backward. Now, the Sentinel of Liberty can send those pesky projectiles flying no matter which way he is moving!"
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Reduce base health from 675 to 650.",
          "Reduce the shield value of Living Legend from 400 to 350.",
          "Added to the Stars Aligned Team-Up Ability with Winter Soldier, but removed from the Voltaic Union Team-Up Ability with Thor and Storm.",
          "Added 1 new costume: Star Spangled Style."
        ]
      },
      {
        "date_version": "25/04/30: Version 20250430",
        "changes": [
          "Reduce base health from 650 to 600."
        ]
      }
    ],
    "official_quote": "\"I fight for more than a flag, I fight for an idea. One bigger than all of us.\"",
    "official_description": "Captain America is a Vanguard hero in Marvel Rivals, and is the 25th hero introduced to the game's roster. He has team-up abilities that work in conjunction with Winter Soldier."
  },
  "background": {
    "real_name": "Steven Grant \"Steve\" Rogers",
    "aliases": [
      "Cap",
      "The First Avenger",
      "The Man Out of Time"
    ],
    "birthplace": "Manhattan, New York",
    "birthdate": "1910s-1920s",
    "gender": "Male",
    "eye_color": "Blue",
    "hair_color": "Blond",
    "relatives": [
      "Joseph Rogers (father; deceased)",
      "Sarah Rogers (Mother; deceased)",
      "Ian Rogers (adopted son)"
    ],
    "affiliation": [
      "Avengers"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Enhanced physical strength, agility, stamina, and endurance via the Super Soldier Serum",
      "Skilled hand-to-hand combatant",
      "Indestructible, magnetic Vibranium shield"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Captain+America%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "52.49%",
    "wr_change": "+1.62%",
    "pick_rate": "13.40%",
    "pr_change": "+3.97%",
    "ban_rate": "2.93%",
    "matches": "199,605"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}