{
  "name": "Doctor Strange",
  "role": "Vanguard",
  "stats": {
    "health": 600,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#A855F7",
    "color_theme_secondary": "#FACC15"
  },
  "abilities": [
    {
      "name": "DAGGERS OF DENAK",
      "keybind": "LMB",
      "type": null,
      "description": "Cast Daggers of Denak forward.",
      "casting": "Five-round delayed hit projectiles",
      "damage": 16,
      "damage_falloff": "Falloff begins at 10m, decreasing to 62.5% at 20m",
      "fire_rate_interval": "0.03-second interval between every two rounds",
      "ammo": 8,
      "critical_hit": false,
      "cooldown": null,
      "range": null,
      "projectile_speed": "60m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "An advanced technique to frame-cancel the endlag is to weave the primary fire with his melee attack. This is especially useful during close combat skirmishes to increase Doctor Strange's burst damage significantly. This weaving technique also allows Doctor Strange to gather more Dark Magic stacks faster.  Each hit generates 3.5 Dark Magic."
    },
    {
      "name": "SHIELD OF THE SERAPHIM",
      "keybind": "RMB",
      "type": null,
      "description": "Create a protective barrier against damage.",
      "casting": "Channeled",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "3s (if destroyed)",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "recovery_shield_value": "70/s"
      }
    },
    {
      "name": "CLOAK OF LEVITATION",
      "keybind": "SHIFT",
      "type": null,
      "description": "Ascend and then enter a brief state of sustained flight",
      "casting": "Instant Cast",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "6s",
      "movement_boost": "8m",
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "MAELSTROM OF MADNESS",
      "keybind": "E",
      "type": null,
      "description": "Release Dark Magic to deal damage to nearby enemies.",
      "casting": "Single-cast spell field that surrounds the caster",
      "damage": "Each point of Dark Magic deals 1.2 damage.",
      "damage_falloff": "5 - 8 meters (70%)",
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": "8m spherical radius",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "This ability interacts directly with his passive, Price of Magic. Each time Doctor Strange deals damage with his primary fire or melee attack, he gains stacks of Dark Magic, up to 100. If he reaches the maximum amount of Dark Magic and does not release it after 3 seconds, he is afflicted by the Anti-Heal curse, which makes him unable to be healed for a few seconds. The stacks of Dark Magic that Doctor Strange possesses visually appear as a glowing purple symbol on his cape that becomes more pronounced as more stacks are accumulated. Dark Magic decays after a few seconds if the player doesn't deal damage. Decay is stopped immediately if further damage is done (excluding decay from max percentage.) Doctor Strange gains 3.5 Dark Magic if he hits enemies with Daggers of Denak, and 10 Dark Magic with his melee attack. The player can release the Dark Magic by using Maelstrom of Madness, which deals more damage the more Dark Magic he currently has (1.2 damage per stack)."
    },
    {
      "name": "PENTAGRAM OF FARALLAH",
      "keybind": "F",
      "type": null,
      "description": "Open portals between two locations, enabling all units to travel through them.",
      "casting": "Multi-segment release",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "180s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "20s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Allows Doctor Strange to open two portals, one from his current location and another to anywhere on the map. Alternatively, the first portal's position can be repositioned as well, allowing both portals to be placed wherever. Both allies and enemies can use the portals, which last for 20 seconds. All projectiles will travel through the portal, including Ultimates. If Doctor Strange channels the portal spell while in mid-air, he will remain floating indefinitely until he places the other portal. Projectiles can only travel through the portals once per cast. The portal can be interrupted during the placement phase if an allied Loki transformed into him."
    }
  ],
  "ultimate": {
    "name": "EYE OF AGAMOTTO",
    "keybind": "Q",
    "type": null,
    "description": "Separate nearby enemies' Souls from their bodies. Damage dealt to these Souls is transferred to their physical bodies.",
    "casting": "Single-cast spell field that surrounds the caster",
    "damage": 60,
    "range": "10m spherical radius",
    "effect": "Temporarily stuns all enemies within range for 3 seconds, projecting their souls outside of their bodies. Players can deal damage to these souls which will reflect the damage into their physical bodies.",
    "duration": "3s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 3100,
    "details": null
  },
  "passives": [
    {
      "name": "PRICE OF MAGIC",
      "details": {
        "generate_dark_magic": "Daggers of Denak: Each hit generates 3.5 Dark Magic. When using the V key, every enemy hit generates 10 Dark Magic"
      }
    }
  ],
  "teamups": [
    {
      "name": "Arcane Order",
      "partner": [
        "Scarlet_Witch"
      ],
      "teamup_bonus": "+150 Max Health"
    }
  ],
  "gameplay": {
    "strategy_overview": "Play Doctor Strange effectively, drawing insights from a top-ranked player. The core technique involves shooting and then either shielding to protect yourself and your team or meleeing for close-range combat, which requires remapping your melee button for easier access. Doctor Strange's shield can block powerful abilities, but his portal is best used for strategic plays with strong characters or for gaining high ground rather than for spawn kills. His 'Storm of Madness' ability grants an anti-heal effect and causes AOE damage when fully charged, pairing well with his ultimate. The 'Cloak of Levitation' is useful for evading certain ultimates and navigating the battlefield, especially against Groot's walls. Doctor Strange's ultimate stuns enemies, creating opportunities for team plays. Mastering these techniques will significantly improve your gameplay with Doctor Strange.",
    "weaknesses": [
      "Limited mobility due to the long cooldown of Cloak of Levitation.",
      "Vulnerable if his Shield of the Seraphim is destroyed.",
      "Shield of the Seraphim cannot block melee attacks.",
      "When Dark Magic begins to gradually decrease from its maximum 100 amount, it cannot be regained until it is released by Maelstrom of Madness or upon reaching zero stacks.",
      "Pentagram of Farallah has a very long cooldown, which will trigger if the player cancels the portal or if he is hit at all while he is casting.",
      "In addition, projectiles can only travel through the portals once per cast.",
      "Maelstrom of Madness relies on the player doing constant damage to build-up Dark Magic, and being within melee range to use it, which Doctor Strange is not a specialist at."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Inner Strength",
        "description": "As Doctor Strange, knock out the Hulk’s soul with Eye of Agamotto.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Perilous Portal",
        "description": "As Doctor Strange, land one terrain KO with the Portal.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Open your eyes, reality is but an illusion.\"",
    "ingame_bio_text": "As the Sorcerer Supreme, Doctor Stephen Strange gracefully wields ancient spells to turn the tide of even the most impossible battle. However, magic always comes at a cost, and each use of his arcane abilities gradually awakens the darkness within him.",
    "ingame_story_intro": "Sensing a massive temporal disturbance, Doctor Strange performed an arcane ritual to protect his reality. The spell failed, and Strange and his Sanctum Sanctorum became trapped within the Mirror Dimension. Lost in the timestream, Strange uses his mystic mastery to free himself for short spans of time in order to join the fight.",
    "hero_stories": [
      {
        "title": "Unexpected Guest",
        "content": "It was another sweltering summer night on the island of Manhattan. Though the sun had gone down hours earlier, the residual heat it left behind still radiated from the pavement in shimmering waves. The forecast had not called for any relief from the record temperatures in the immediate future, but the residents of Greenwich Village had come to expect the unexpected thanks to one of their more… colorful neighbors. So when a powerful blast of icy air swept down Bleecker Street, it barely drew any attention. At least from those outside. Within the confined of the building marked \"177A,\" however, someone had most certainly taken notice of the sudden chill.\n\"We have a visitor,\" said Doctor Stephen Strange, barely looking up from the ancient tome in front of him. The Sorcerer Supreme was sitting cross-legged, floating a few feet in the air as he studied the arcane rituals within the sacred text. He paused for a moment before speaking again, this time with a slightly more commanding tone. \"Wong, do get the door, please. We mustn't keep our guest waiting.\"\n\"Wong's out on a supply run,\" a gruff voice replied from below. \"Guess we ran outta Eye of Newt or somethin'. How come you never told me we were expectin' company, Doc?\"",
        "status": null
      },
      {
        "title": "Magic Standstill",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      },
      {
        "title": "Oath of Doom",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Doctor Strange was released as the 1st character to be introduced to Marvel Rivals as a Vanguard hero.",
          "Added 3 new costumes: Master of Black Magic, Sorcerer Supreme of the Galaxy, and God of Magic.",
          "Added the Perilous Portal achievement.",
          "Added to the Gamma Charge Team-Up Ability with Hulk and Iron Man."
        ]
      },
      {
        "date_version": "24/12/10: Version 20241210",
        "changes": [
          "When Doctor Strange's portal triggered terrain KOs, they would mistakenly restore Doctor Strange's Ultimate energy. For now, we have disabled the portal's terrain KO attribution to temporarily fix this issue (i.e., terrain KOs will not count toward Doctor Strange's own KOs). Rest assured, this bug will be resolved in a future update, at which time we will restore the portal's KO attribution."
        ]
      },
      {
        "date_version": "24/12/19: Version 20241219 / Winter Celebration Event",
        "changes": [
          "No more teammates charging Doctor Strange's ultimate ability through portals. Also, the portal terrain KOs are back in action!"
        ]
      },
      {
        "date_version": "25/01/08",
        "changes": [
          "Corrected minor movement ability discrepancies for certain heroes (like Doctor Strange and Magik) at both low and high frame rates."
        ]
      },
      {
        "date_version": "25/01/10: Version 20250110 / Season 1: Eternal Night Falls Launch",
        "changes": [
          "Add damage falloff to Maelstrom of Madness and Gamma Maelstrom. Starting at 5 meters and reducing to 70% at 8 meters.",
          "Slightly decrease the shield value recovery rate after releasing Shield of the Seraphim from 80/s to 70/s."
        ]
      },
      {
        "date_version": "25/01/17",
        "changes": [
          "Added 1 new costume: Sorcerer Immortal."
        ]
      },
      {
        "date_version": "25/02/14: Version 20250214",
        "changes": [
          "Fixed an issue where Doctor Strange's portal could be interrupted during the placement phase if an allied Loki transformed into him. The Sorcerer Supreme's magic now flows uninterrupted!"
        ]
      },
      {
        "date_version": "25/02/20",
        "changes": [
          "Fixed a bug where Doctor Strange's portals could get destroyed if they intersected with broken Recursive Destruction objects during the rewind phase in Empire of Eternal Night: Midtown. The Sorcerer Supreme's portals are now as reliable as his magic!",
          "Fixed an issue where if certain heroes were eliminated by terrain after using their abilities to pass through Doctor Strange's portals, it would sometimes not count as a KO for the Sorcerer Supreme. Now, every portal pitfall will be counted!",
          "Fixed a problem where other players sometimes couldn't see Doctor Strange's ultimate effect. The Eye of Agamotto will now dazzle everyone on the battlefield!",
          "Resolved an issue where Doctor Strange's ultimate control effect could be overridden by Luna Snow's or Scarlet Witch's control effects, prematurely ending his control. The Sorcerer Supreme's spells now hold strong--no more magic mix-ups!"
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "Reduce base health from 650 to 600."
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Decrease Daggers of Denak damage per projectile from 18 to 16.",
          "Reduce the Maelstrom of Madness conversion ratio of Dark Magic to damage from 1.3 to 1.2.",
          "Added to the Arcane Order Team-Up Ability with Scarlet Witch, but removed from the Gamma Charge Team-Up Ability with Hulk and Iron Man."
        ]
      },
      {
        "date_version": "25/04/18: Version 20250415",
        "changes": [
          "Added 1 new costume: Doctor Strange in the Multiverse of Madness."
        ]
      },
      {
        "date_version": "25/04/30: Version 20250430",
        "changes": [
          "Decrease the energy cost to unleash the Eye of Agamotto from 3400 to 3100."
        ]
      }
    ],
    "official_quote": "\"Magic is not to be owned, but to be felt. Experienced. Lived.\"",
    "official_description": "Doctor Strange is a Vanguard hero in Marvel Rivals, and is the 1st hero introduced to the game's roster. He has team-up abilities that work in conjunction with Scarlet Witch."
  },
  "background": {
    "real_name": "Dr. Stephen Vincent Strange",
    "aliases": [
      "Sorcerer Supreme"
    ],
    "birthplace": "Philadelphia, Pennsylvania",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Green",
    "hair_color": "Brown; Grey-haired streaks",
    "relatives": [
      "Donna Strange (younger sister; deceased)",
      "Bats (pet; deceased) (now ghost)"
    ],
    "affiliation": [
      "Avengers",
      "Illuminati"
    ],
    "first_appearance_comic": "Strange Tales (1951) #115",
    "recommended_comics": [],
    "lore_powers_skills": [
      "Mastery over various forms of magic",
      "Teleportation",
      "Chronokinesis",
      "Summoning",
      "Invocation of extradimensional entities and objects",
      "Flight"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Doctor+Strange%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "48.93%",
    "wr_change": "-1.79%",
    "pick_rate": "17.52%",
    "pr_change": "-20.59%",
    "ban_rate": "0.78%",
    "matches": "260,956"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}