{
  "name": "Emma Frost",
  "role": "Vanguard",
  "stats": {
    "health": 650,
    "speed": null,
    "difficulty": null,
    "color_theme": "#EC4899",
    "color_theme_secondary": "#A7D7F9"
  },
  "abilities": [
    {
      "name": "TELEPATHIC PULSE",
      "keybind": "LMB",
      "type": "beam",
      "description": "Fire a psionic beam to deal damage; the longer the beam hits, the higher the damage.",
      "casting": "Channeled",
      "damage": "Damage increases with energy: 0 - 70/s, 99 - 120/s, full energy - 150/s",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": 70,
      "critical_hit": null,
      "cooldown": null,
      "range": "15m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": "Energy gain: Hero hit: 10/s; Sentience hit: 15/s; Common summons hit: 5/s; Shield hit: 10/s. Falloff begins 3s after not hitting an enemy, at a rate of 30/s",
      "details": null
    },
    {
      "name": "MIND'S AEGIS",
      "keybind": null,
      "type": "Deployable Shield",
      "description": "Create a levitating barrier at the designated location.",
      "casting": "Deployable Shield",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "3s reposition, 4s after destroyed",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "infinite until destroyed or reclaimed",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "500 health, 70/s recovery speed, 2s delayed recovery after release"
    },
    {
      "name": "PSYCHIC SPEAR",
      "keybind": "E",
      "type": "Single-cast delayed projectile",
      "description": "Seize control of an enemy's sentience - damage dealt to the sentience cascades to the physical form and can be pierced by Telepathic Pulse. When the sentience shatters, it unleashes extra damage on its owner.",
      "casting": "Single-cast delayed projectile",
      "damage": "Deal 5 damage per direct hit. When the sentience shatters, it deals damage to the target, which is equal to 25% of the target's maximum health",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "24m",
      "projectile_speed": "80m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Sentience health: Target's 25% Maximum Health. When the distance between the target and its sentience is more than 15m, their linkage can be broken"
    },
    {
      "name": "DIAMOND FORM",
      "keybind": "SHIFT",
      "type": "Switch Form",
      "description": "Activate Diamond Form to transform your attack style while gaining Damage Reduction and becoming Unstoppable.",
      "casting": "Switch Form",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "8s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "30% Damage Reduction in Diamond form. Immune to displacements such as stuns, knockbacks"
    },
    {
      "name": "FACETED FURY",
      "keybind": "LMB",
      "type": "Single-cast Spell Field",
      "description": "In Diamond Form, deliver a crushing double-fisted strike to enemies.",
      "casting": "Single-cast Spell Field",
      "damage": "First & second hit: 50; third hit: 70; fourth hit: 80",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "4m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "CARBON CRUSH",
      "keybind": "E",
      "type": "Dash Based Control",
      "description": "In Diamond Form, lunge forward to grab an enemy, then execute a back slam to inflict damage.",
      "casting": "Dash Based Control",
      "damage": 30,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "5s",
      "range": "7m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Control effect duration: 1.6s. Can dash into the sky and grapple enemies above if they're within range. Can cancel enemy Ultimates during their start up."
    },
    {
      "name": "CRYSTAL KICK",
      "keybind": null,
      "type": "Single-cast Spell Field",
      "description": "In Diamond Form, unleash a flying kick forward and knock back enemies; extra damage is dealt if they're propelled into a wall.",
      "casting": "Single-cast Spell Field",
      "damage": "Hit damage: 50; damage increases to 100 when the target is knocked into walls",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "2s",
      "range": "5m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Maximum knockback distance: 10m"
    }
  ],
  "ultimate": {
    "name": "PSIONIC SEDUCTION",
    "keybind": "Q",
    "type": "Large-ranged Persistent Spell Field",
    "description": "Project a forward psychic assault that stuns foes and prevents them from unleashing their Ultimate Abilities; if the effect lingers, it gradually commandeers their mind, forcing them to move toward Emma Frost.",
    "casting": "Large-ranged Persistent Spell Field",
    "damage": "Basic damage 80/s; distance falloff: falloff begins at 10m, decreasing to 50% at 30m; angle falloff: falloff begins at 7° from the center of view, decreasing to 80% at 20°",
    "range": "Cone shape spell field, angle range: 80°, length: 30m",
    "effect": "Mind control",
    "duration": "6s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 3700,
    "details": "When exposed to the ability, enemies accumulate 10 stacks per second, and the stacks decrease by 10 stacks per second when they leave the exposure. At 15 stacks, a control effect is triggered. Each enemy can only be controlled once per ultimate activation. When mind controlled, enemies don't have access to their movement and will be lured towards Emma until they die or the ultimate ends. When mind controlled, enemies within their Ultimate can have their Ultimate cancelled."
  },
  "passives": [
    {
      "name": "MIND LINK",
      "keybind": null,
      "type": "Passive",
      "description": "Emma Frost can form a mental link with Magneto and Psylocke, calling on her to create illusory projections. When together, Emma Frost will create a Mental Projection of Magneto and Psylocke, forming a Duplicate Illusion in the enemy's perspective that confuses foes by moving and casting ability on its own.",
      "cooldown": null,
      "damage": null,
      "range": null,
      "trigger_condition": null,
      "effect_boost": null,
      "speed_details": null,
      "details": "+100 Max Health"
    }
  ],
  "teamups": [
    {
      "name": "Mental Projection",
      "partner": [
        "Magneto",
        "Psylocke"
      ],
      "effect": null,
      "keybind": "Passive",
      "teamup_bonus": "+100 Max Health",
      "duration": null,
      "cooldown": null,
      "range_target": null,
      "special_notes": "Role: Anchor | Ability: Mind Link",
      "details": null
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Emma Frost is a highly multifaceted Vanguard, uniquely distinguished by her ability to seamlessly transition between a ranged-focused Human Form and a melee-dominant, highly durable Diamond Form. Mastering the art of switching between these forms at opportune moments is paramount to playing Emma Frost effectively. Her playstyle revolves around crowd control, disruption, and adapting her offensive and defensive capabilities to the flow of combat, rather than solely absorbing damage like some traditional Vanguards. Success hinges on understanding the nuances of each form and leveraging their specific strengths.</p>\n<p>In <b>Human Form</b>, Emma functions best as a mid-ranged character, ideally positioned alongside her teammates to provide consistent poke damage with <b>Psychic Spear (E)</b> and crucial team support through <b>Mind's Aegis (RMB)</b>, which creates levitating barriers. Avoid deep incursions into enemy territory without Diamond Form ready. Conversely, <b>Diamond Form (F)</b> encourages a more aggressive stance, granting significant damage reduction and complete CC immunity. Use this form to engage, single out priority targets like healers or exposed damage dealers, or solidify control over contested points. Punishing enemies who overextend becomes a prime opportunity in this durable state. Her ultimate, <b>Psionic Seduction (Q)</b>, is a powerful tool for disrupting enemy backlines or interrupting key enemy ultimates; careful positioning is crucial for its impact. Remember that Diamond Form has a 15-second cooldown, so manage its usage wisely. Maintaining the charge of her Telepathic Pulse (part of her Human Form LMB) is also important for maximizing damage output in Human Form.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Diamond Form Engagement:</u></b><br>Switch to Diamond Form (F) → <b>Carbon Crush</b> (E) to grab an enemy → Follow with two quick <b>Faceted Fury</b> (LMB) punches → Finish with a <b>Crystal Kick</b> (RMB), aiming towards a wall for bonus damage. This is a fundamental burst combo in Diamond Form.<br><br></li>\n  <li><b><u>Human to Diamond Burst:</u></b><br>Start in Human Form and land a <b>Psychic Spear</b> (E) → Immediately transition into Diamond Form (F) → Follow up with two <b>Faceted Fury</b> (LMB) punches → Finish with a <b>Crystal Kick</b> (RMB). This allows for a quick burst after an initial ranged setup.<br><br></li>\n  <li><b><u>Max Burst Diamond Combo:</u></b><br><b>Psychic Spear</b> (E in Human Form) → Activate Diamond Form (F) → One <b>Faceted Fury</b> (LMB) punch → <b>Carbon Crush</b> (E) → Another <b>Faceted Fury</b> (LMB) punch → Finish with <b>Crystal Kick</b> (RMB). This sequence offers higher burst damage potential for securing eliminations.<br><br></li>\n  <li><b><u>Mind's Aegis Usage (RMB - Human Form):</u></b><br>Proactively deploy Mind's Aegis to create levitating barriers at a distance. Use it to deny enemy sightlines on objectives, protect vulnerable teammates from incoming projectiles, or create temporary safe zones for your team to operate from.<br><br></li>\n  <li><b><u>Psionic Seduction (Ultimate - Q) Usage:</u></b><br>This ultimate can be devastating. Aim to sweep it through enemy backlines to stun multiple targets or to interrupt critical, high-impact enemy ultimates. Be aware of ultimates it cannot cancel (see Matchups). Coordinate with your team to capitalize on stunned enemies. Its effective use can turn the tide of a team fight.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Strategists and ranged Duelists who are susceptible to her crowd control. Heroes reliant on ultimates that <b>Psionic Seduction</b> can interrupt. Dive characters can often be punished by <b>Carbon Crush</b> in Diamond Form.<br><br></li>\n  <li><b>Challenging Against:</b> Heroes with ultimates immune to <b>Psionic Seduction</b> (e.g., <u>Venom</u>, <u>Hela</u>, <u>Mister Fantastic</u>, <u>Psylocke</u>, <u>Storm</u>, <u>The Punisher</u> (some ults), <u>Cloak & Dagger</u>, <u>Luna Snow</u>). Tank busters like <u>Iron Fist</u> and <u>Wolverine</u> (who deal % HP damage). <u>The Thing</u> is immune to knockback, reducing the effectiveness of some Diamond Form abilities. Highly mobile characters like <u>Cloak & Dagger</u> and <u>Luna Snow</u> can potentially evade Psionic Seduction. Heroes with strong poke damage from range (e.g., <u>Iron Man</u>, <u>Human Torch</u>) can pressure her Human Form. <u>Groot's</u> walls can block Psionic Seduction and isolate her.<br><br></li>\n  <li><b>Key Synergies:</b> Her <b>Mental Projection</b> Team-Up with <u>Magneto</u> and <u>Psylocke</u> creates powerful combinations. Emma also synergizes well with heroes who can capitalize on her crowd control, such as <u>Winter Soldier</u>, <u>Wolverine</u>, <u>Invisible Woman</u>, <u>Mantis</u>, <u>Peni Parker</u>, <u>Magik</u>, and <u>Namor</u>.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Adaptive Duality:</b> Seamlessly transitions between ranged (Human Form) and melee (Diamond Form) to suit diverse combat scenarios.</li>\n  <li><b>Diamond Form Durability:</b> Grants significant damage reduction and complete immunity to crowd control effects, making her a strong frontline anchor or diver.</li>\n  <li><b>Potent Crowd Control:</b> <b>Psionic Seduction (Q)</b> offers a game-changing AoE stun capable of interrupting many enemy ultimates.</li>\n  <li><b>Single Target Lockdown:</b> <b>Carbon Crush (E)</b> in Diamond Form can isolate and control a key enemy.</li>\n  <li><b>High Burst Damage Potential:</b> Diamond Form combos, especially incorporating <b>Faceted Fury (LMB)</b> and <b>Crystal Kick (RMB)</b>, can quickly eliminate vulnerable targets.</li>\n  <li><b>Area Denial & Protection:</b> <b>Mind's Aegis (RMB)</b> in Human Form creates barriers, blocking sightlines and protecting allies.</li>\n  <li><b>Unique Ranged Debuff/Damage:</b> <b>Psychic Spear (E)</b> in Human Form seizes an enemy's 'sentience' for focused damage and a burst upon shattering.</li>\n  <li><b>Team-Up Potential:</b> Significant strategic depth added by her <b>Mental Projection</b> Team-Up with <u>Magneto</u> and <u>Psylocke</u>.</li>\n</ul>",
    "weaknesses": [
      "Her main attack Telepathic Pulse has a limited range of 15m which requires her to be mid-range to deal damage against enemies.",
      "Diamond Form also has no ranged attacks so whenever players utilize this form it is advised to do it when in melee range., unless they're within range of her Carbon Crush ability.",
      "Diamond Form's abilities have  cooldowns allowing only one or two uses of Carbon Crush and Crystal Kick each within this form.",
      "While Diamond Form grants Emma strong resistence, she still takes damage and can be killed within this state. Emma is still susceptible to be killed by Iron Man's Invincible Pulse Cannon.",
      "Due to Emma not having any abilities that allow her to move faster outside her Carbon Crush within Diamond Form, she does not have fast mobility and thus can be easily overwhelmed if being chased or surrounded by enemies.",
      "Because Mind's Aegis has a shield health of 500, if deployed this shield can be immediately destroyed when facing against significant damage and line of fire from multiple enemies."
    ],
    "achievements": []
  },
  "lore_details": {
    "ingame_bio_quote": "\"The higher the pressure, the more dazzling the diamond.\"",
    "ingame_bio_text": "For Emma Frost, war is the purest form of art. With her formidable telepathic abilities, she intricately weaves a deadly mental web that ensnares her foes, while her indestructible diamond form lets her lead her teammates fearlessly into the fray. Forever elegant and composed, Emma reigns as the one true queen of the battlefield!",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Forged in Hellfire",
        "content": "The Grove. Up until recently, this secluded location deep in the heart of the living island known as Krakoa had regularly been filled with the chatter of Mutant leaders heatedly debating the future of their nation and their people. But when the Timestream Entanglement ripped Krakoa from its original timeline and displaced it into the far future, many of Mutantkind’s most prominent voices ended up scattered across the ages. The hush that fell over the Grove in the days that followed was thicker than the island’s humid tropical air. But as the Mutants who still called Krakoa their home had come to learn so many times before, nothing lasts forever...",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "25/04/11\nVersion 20250411\n/Season 2: Hellfire Gala\nLaunch",
        "changes": [
          "Emma Frost was released as the 38th character to be introduced to Marvel Rivals as a Vanguard hero.",
          "Added 2 new costumes: Blue Sapphire and X-Revolution.",
          "Added to the Mental Projection Team-Up Ability with Magneto and Psylocke."
        ]
      },
      {
        "date_version": "25/04/25\nVersion 20250425\n/Giant-Size Brain Blast\nEvent",
        "changes": [
          "Fixed a glitch in Diamond Form where her Carbon Crush would sometimes catapult foes underground—or even off the map! Now, when Emma dazzles, every move lands as sharp as a perfectly cut gem!"
        ]
      }
    ],
    "official_quote": "\"I'm as flawless as they come, darling.\"",
    "official_description": "Emma Frost is a wealthy socialite, a fashion icon, and a powerful telepath. Though she once used her Mutant abilities to influence others for her own personal, she now devotes her talents to Charles Xavier's dream of coexistence between Mutants and mankind. After Krakoa was transported to the year 2099 through a temporal storm, Emma and her Hellfire Trading Company defended the island nation against multiple hostile corporations. She then convinced the Quiet Council to approve a Hellfire Gala to chart her people's future in this new timeline."
  },
  "background": {
    "real_name": "Emma Grace Frost",
    "aliases": [
      "White Queen"
    ],
    "birthplace": "Boston, Massachusetts",
    "birthdate": null,
    "gender": "Female",
    "eye_color": "Blue",
    "hair_color": "Blond",
    "relatives": [
      "Stepford Cuckoos (daughters)",
      "Tony Stark (alt. husband)"
    ],
    "affiliation": [
      "X-Men",
      "Illuminati",
      "Hellfire Club (formerly)"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "High-level telepathy",
      "Psionics",
      "Mind Control",
      "Memory Manipulation",
      "Diamond form transformation granting enhanced strength, stamina, durability and resistance to extreme temperatures."
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Emma+Frost%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "A",
    "win_rate": "50.36%",
    "wr_change": "N/A",
    "pick_rate": "37.21%",
    "pr_change": "N/A",
    "ban_rate": "7.12%",
    "matches": "554,220"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}