{
  "name": "Hela",
  "role": "Duelist",
  "stats": {
    "health": 250,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#10B981",
    "color_theme_secondary": "#34D399"
  },
  "abilities": [
    {
      "name": "NIGHTSWORD THORN",
      "keybind": "LMB",
      "type": null,
      "description": "Throw Nightsword thorns.",
      "casting": "Single-cast hitscan",
      "damage": "70",
      "damage_falloff": "Falloff begins at 18m, decreasing to 80% at 30m",
      "fire_rate_interval": "2/s",
      "ammo": 8,
      "critical_hit": true,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "PIERCING NIGHT",
      "keybind": "RMB",
      "type": null,
      "description": "Fire multiple Nightsword thorns that detonate after a delay. Projectiles stick to enemies on hit.",
      "casting": "Straight-line projectile that generates a spell field upon impact",
      "damage": "10 (per projectile) - 35 (spell field damage per round)",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": null,
      "projectile_speed": "80m/s",
      "charges": null,
      "duration": "3s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "NUMBER OF PROJECTILES - 4"
    },
    {
      "name": "SOUL DRAINER",
      "keybind": "E",
      "type": null,
      "description": "Project an explosive Hel sphere to Stun nearby enemies. This ability can even interrupt certain Ultimates.",
      "casting": "Arced projectile that generates a spell field upon impact",
      "damage": "1 (projectile) - 40 (spell field damage)",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "10s",
      "range": "3m spherical radius",
      "projectile_speed": "40m/s",
      "charges": null,
      "duration": "0.3s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "ASTRAL FLOCK",
      "keybind": "SHIFT",
      "type": null,
      "description": "Transform into a Nastrond Crow to glide forth, press again to undo the transformation. Invincible while transformed. Hela cannot be healed by teammates during flight.",
      "casting": "Dash",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "15m/s DASH SPEED\n18m DASH DISTANCE",
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "NASTROND CROWSTORM",
      "keybind": null,
      "type": "PASSIVE",
      "description": "Defeating an enemy will generate a Nastrond Crow, exploding after a duration.",
      "casting": null,
      "damage": "80",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "5m spherical radius",
      "projectile_speed": null,
      "charges": null,
      "duration": "1.8s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "HEL'S DESCENT",
      "keybind": "SPACE",
      "type": null,
      "description": "Hold Space to fall slowly.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "6m/s (horizontal movement) - 3.5m/s (descent speed)",
      "energy_cost_details": null,
      "details": null
    }
  ],
  "ultimate": {
    "name": "GODDESS OF DEATH",
    "keybind": "Q",
    "type": null,
    "description": "Soar into the sky and unleash Nastrond Crows from each hand at will. When activating Goddess of Death, Hela gains a hefty separate health bar of 1000 points. Even if this health bar is depleted, she will not die, but will instead revert to her normal form with the health she previously had before activating her Ultimate.",
    "casting": "Straight-line projectile that generates a spell field upon impact",
    "damage": "125",
    "range": "6m spherical radius",
    "effect": null,
    "duration": "10s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": "80m/s",
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 4000,
    "details": "FIRE RATE - 1.79/s\nDAMAGE FALLOFF - 32% falloff at 4m\nABILITY HEALTH - 1000"
  },
  "passives": [
    {
      "name": "QUEEN OF HEL",
      "effect_boost": "15% Damage Boost"
    }
  ],
  "teamups": [
    {
      "name": "Ragnarok Rebirth",
      "partner": [
        "Loki",
        "Thor"
      ],
      "effect": null,
      "keybind": "Passive",
      "teamup_bonus": "15% Damage Boost",
      "duration": null,
      "cooldown": null,
      "range_target": null,
      "special_notes": "Role: Anchor | Ability: Queen of Hel",
      "details": null
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Hela is a dominant Duelist who excels at dealing substantial and consistent mid-to-long range damage with her primary attack, <b>Nightsword Thorn (LMB)</b>. Accurate aiming for headshots is absolutely crucial for maximizing her high damage output. <b>Piercing Night (RMB)</b> fires multiple projectiles that detonate after a delay, used for burst, area denial, or finishing retreating enemies. <b>Soul Drainer (E)</b> projects an explosive Hel sphere, stunning nearby enemies, which is invaluable for setting up headshots or disrupting dives.</p>\n<p>Hela typically positions at a safe distance from the frontline, often seeking elevated platforms or off-angles to maximize damage while minimizing vulnerability. Maintaining this distance is key due to her lower health pool. <b>Astral Flock (LShift)</b> provides good mobility for repositioning, escaping dives, and reaching vantage points. Her ultimate, <b>Goddess of Death (Q)</b>, offers a powerful aerial assault dealing significant AoE damage, effective for clearing objectives and securing multiple kills. Her passive, <b>Nastrond Crowstorm</b> (AoE damage on elim), is a bonus effect rather than a core focus.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Basic Burst Combo:</u></b><br><b>Soul Drainer (E)</b> to stun an enemy → Barrage with <b>Nightsword Thorn (LMB spam)</b>, aiming for the head → Finish with <b>Piercing Night (RMB)</b>.<br><br></li>\n  <li><b><u>Mid-Range Pressure Combo:</u></b><br><b>Nightsword Thorn (LMB spam)</b> for initial pressure → <b>Soul Drainer (E)</b> to stun → Continue with <b>Nightsword Thorn (LMB spam)</b> → Use <b>Piercing Night (RMB)</b> as they try to recover or flee.<br><br></li>\n  <li><b><u>Advanced Ultimate Setup:</u></b><br><b>Soul Drainer (E)</b> → <b>Nightsword Thorn (LMB spam)</b> → <b>Piercing Night (RMB)</b> → <b>Astral Flock (LShift)</b> to reposition for a better angle or safety → Unleash <b>Goddess of Death (Q)</b>.<br><br></li>\n  <li><b><u>Astral Flock (LShift) Management:</u></b><br>Use for aggressive repositioning to gain sightlines, escaping dives, or reaching high ground. Manage its cooldown carefully for survivability.<br><br></li>\n  <li><b><u>Piercing Night (RMB) Tactics:</u></b><br>Use its delayed detonation for area denial, to hit enemies behind cover, or to add burst after primary fire pressure.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Low-mobility Duelists and Strategists (easier to hit with precise attacks). Can potentially disrupt dive characters with a well-timed <b>Soul Drainer (E)</b> stun. Characters with predictable movement or larger hitboxes.<br><br></li>\n  <li><b>Challenging Against:</b> High-mobility dive characters (e.g., <u>Spider-Man</u>, <u>Iron Fist</u>, <u>Black Panther</u>) who can quickly close distance. Other long-range DPS with similar/greater range or higher burst (e.g., <u>Hawkeye</u>, potentially <u>Black Widow</u>). Durable Vanguards (e.g., <u>Hulk</u>, <u>Captain America</u>, <u>Venom</u>) who are hard to burst down quickly. Characters with significant vertical mobility that can get above her (e.g., <u>Human Torch</u>, <u>Iron Man</u>), exploiting her primary fire's vertical aiming limitations.<br><br></li>\n  <li><b>Key Synergies:</b> Benefits from a team that can protect her and enable her to maintain optimal range.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Exceptional Mid-to-Long Range Damage:</b> <b>Nightsword Thorn (LMB)</b> deals high, consistent damage, especially with headshots.</li>\n  <li><b>Potent Stun Utility:</b> <b>Soul Drainer (E)</b> provides a valuable stun for setups, interruptions, and self-peel.</li>\n  <li><b>Good Mobility:</b> <b>Astral Flock (LShift)</b> allows for effective repositioning, escapes, and reaching high ground.</li>\n  <li><b>Powerful AoE Ultimate:</b> <b>Goddess of Death (Q)</b> offers significant area damage for team fights and objective clearing.</li>\n  <li><b>Area Denial/Burst (Piercing Night - RMB):</b> Delayed projectiles add tactical burst and zoning.</li>\n  <li><b>High Carry Potential:</b> Skilled Hela players can dominate matches with precise aim and positioning.</li>\n  <li><b>Strong Meta Standing (S+ Tier):</b> Consistently a top-tier damage dealer.</li>\n  <li><b>Effective Disruption:</b> Can interrupt key enemy abilities with her stun.</li>\n</ul>",
    "weaknesses": [
      "Poor means to deal with divers, especially when Astral Flock is on cooldown.",
      "Lacks any self-sustaining abilities.",
      "Hela cannot be healed by teammates during Astral Flock's flight.",
      "Needs proper awareness to use her Ultimate, as she is completely stationary while in use; if she does it while within the enemy lines, she will return directly to her original position once the ability ends and will be put at risk of death.",
      "Needs to land the final hit on enemies to trigger her Queen of Hel team-up ability."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Ragnaroked",
        "description": "As Hela, partner with Loki to take down an enemy Thor.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Terror of the Ten Realms",
        "description": "As Hela, land a 3-player KO streak in Yggsgard: Yggdrasill Path.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"No one escapes Hel.\"",
    "ingame_bio_text": "As the Goddess of Death, Hela wields supreme control over the fallen souls residing in Hel. With a haunting whisper and a murder of crows, the queen of the underworld gracefully reaps the souls of her enemies without an ounce of mercy.",
    "ingame_story_intro": "\"My domain will one day encompass all souls.\"",
    "hero_stories": [
      {
        "title": "Messenger of the Abyss",
        "content": "From the throne atop her realm, the Queen of Hel recalled feeling the shattering of worlds, the sundering of realities as unknown forces knit them together again. Differently. She remembered venturing forth into her kingdom, only to discover that in Hel little had changed. However, Hela suspected once she traveled beyond her realm, she would see profound changes - and when she had worked enchantments to gaze upon worlds newly interwoven with the Ten Realms, her suspicions were confirmed. Mortals had done this? Remade time itself? Broken it and rewound different streams into a different braid or worlds?\nWhat power was this for men to wield?\nImmediately, Hela set about scheming a way to make it hers.\nFirst, she knew, she must understand Chronovium. One of her thralls, in life a great wizard-king, had brought to her a stone of a sort she had never seen before in Hel. She had paid it little mind until she grasped what the mortal Victor von Doom had done. Then, she sent the flock. Her crows scouted other realms, all returning bearing samples of Chronovium, the crystallized residue of the monstrous shocks to the space-time continuum. And yet, they all differed slightly from the version in Hel and from one another.\nWhoever learned best to control it, Hela knew, would rule worlds beyond Asgard. Beyond the Ten Realms.\nHela's intrigue deepened. New lands meant expanding the borders of Hel and welcoming vast numbers of new creatures into her ever-growing legions, perhaps even claiming the souls of the great beings known as Celestials. Only recently had she become aware of them, and then only through a new soul in Hel, cast there from another universe by the - what had he called it? - the Timestream Entanglement. This pitiful mortal, who met their end in the event, spilled forth knowledge of vast realms of space filled with fantastic creatures.\nAt a wave of her hand, Hela's crows feasted on the mortal's soul, her mind settling on a goal. The souls, and thus the power, of these great beings would belong to her. And when they did, she would sweep unchallenged through the Ten Realms, uniting them under the banner of Hel. Undoubtedly, Loki was hatching his own schemes to utilize Chronovium to increase his own power and ensure Asgard never slipped from his grasp, but Loki's schemes never worried Hela. Often, his petty obsessions and caprices benefited her by causing conflicts that added to her legions. At some point, she suspected, he would approach her proposing some sort of arrangement. Perhaps an alliance. Perhaps she would consent, and they would begin the dance of waiting for the right moment to betray each other. The joys of family.\nUntil then, she would proceed with her own plans, which led her to the current moment, as a messenger from a distant place she had never heard of before. Her initial response was to annihilate it for the arrogant crime of trespassing in her realm. However, it seemed to her that these disruptions of time and space could be a gift. Had it not opened vast new possibilities for Hel? Surely, she should learn what new worlds - new universes! - now lay within her grasp.\nSo, her crows stood perched while the otherworldly emissary trudged into her throne room.\nIt was a strange creature, appearing like blobs and tendrils of a tarry black substance bonded with a host. Its liquid flesh mingled aspects of its own nature and that of its host - currently a Jotun priestess. Even though she was no longer alive, enough of the Jotun's soul was still present for Hela to feel her horror at being bound to such a monstrosity. How curious.\nThe creature, however - the symbiote - had no such misgivings, or at least did not betray them.\n\"Tell me, little creature. What brings you to this place?\"\n\"You would do well to listen, Queen of Death,\" it said. \"I bring tidings from Knull, mighty lord of the abyss.\"\n\"And what is a 'Knull'? Is he the god of all creatures such as you?\" She made no effort to hide her scorn. This Knull was, in all likelihood, as debased and parasitic as its worshipper who stood before her.\n\"His power is eons older than yours, ancient before light existed, and he has his own claims on creatures whose essences he has consumed.\"\nAh, Hela thought. Of course. \"I take it he means to claim the Celestials as well?\"\nThe symbiote nodded and flicked out its tongue. \"Knull has learned that one of the Celestials is now in this realm. You cannot keep it, Asgardian. It is his to claim and it will be the key to his freedom.\"\n\"I cannot?\" Hela stood from her throne. \"Bold of you, parasite, to tell me what I can and cannot do in my own realm. What enters Hel is mine, forever. In fact,\" she said, giving the symbiote a closer look, \"perhaps I will even keep you. What manner of soul does a creature like you possess?\"\nThe symbiote remained still. Hela let it wonder for quite a while, as she pondered what she had already learned. The key to his freedom, the emissary had said. So, this Knull was a god in chains, yet he still possessed the reach to send a message to Hel. He knew the power of Celestials. He knew that the tangled worlds had brought new souls into Hel.\nTherefore, there must now be a way from Hel to... \"What is the world you come from, creature?\"\n\"Klyntar, O Queen.\"\nA name she knew vaguely. People from a culture long since annihilated had once come to her realm from there. She considered a little longer.\n\"I release you,\" she said. \"Now, release your host.\"\nThe symbiote did,  peeling and secreting and withdrawing from the skeletal form of the Jotun priestess. \"Return to your master,\" Hela went on, \"and tell him that he may rule Klyntar, but Hela rules Hel. And if he wishes to fight me...\" she smiled. \"Then he too will become one of my subjects. Do you have that, messenger?\"\nThe symbiote mass quivered, but without a host it could not speak. Hela worked a spell, drawing forth knowledge from its mind. She swirled open a gateway to a world of darkness, an impenetrable jungle where no sane mortal would tread. \"Go,\" Hela said, \"before I change my mind.\"\nThe symbiote sprang through the gateway and was gone. Hela let the gateway close. Now, Knull knew that she could reach out to his world directly. Let him think on that and consider his next move.\nHela gathered up a mass of Chronovium, imbued with the essence of Hel. Just as all lives must end, she reflected, all things must move through time. Did it not follow that all time ended in Hel as well? And did it not follow that Hel could grow through this crystallized time, encompassing new realms brought near by the entanglement of worlds?\nThe Hel-Chronovium was shot through with black and green. She spoke to it, shaping it into an enchantment, the first of many. \"All living beings,\" she said, \"in all realms, in all universes. They shall be thralls of Hel. They need not come to me. I will use you, Chronovium, to expand Hel not through space but through time. Beings more ancient than stars will be mine, and beings not yet born will be mine. This is a powerful magic and will take some time to work. But it shall be done, and then Knull? She smiled. \"He will be mine as well.\"\nShe suspected that the symbiote emissary was not Knull's only gambit. Doubtless he was plotting against her, seeking ways to undermine her and the reach of Hel. Let him, she thought. Let him beguile mortals and persuade greedy gods that they can band together against me. That would bring them all the closer - and as she had already told the symbiote emissary, whatever entered Hel was Hela's. Unless she chose to let it go.\nAnd soon, souls would no longer come to Hel, Hel would come to them. Her realm would grow outward through time, drawing in numberless souls until she had an army so vast not even gods could hope to resist it. The Ten Realms were just the beginning.\nShe spun the black and green Chronovium jewel over her palm. \"Yield to me your secrets,\" she commanded. \"Bring to me the future, as I already rule the past.\"",
        "status": null
      },
      {
        "title": "Sunrise in the Land of Dusk",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      },
      {
        "title": "Six Magpies",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Hela was released as the 19th character to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 3 new costumes: Ultimate, Goddess of Death, and Empress of the Cosmos.",
          "Added the Terror of the Ten Realms achievement.",
          "Added to the Ragnarok Rebirth Team-Up Ability with Thor and Loki."
        ]
      },
      {
        "date_version": "24/12/10: Version 20241210",
        "changes": [
          "In the foggy areas of Intergalactic Empire of Wakanda: Hall of Djalia and Intergalactic Empire of Wakanda: Birnin T'Challa: Fog would disappear from Hela and Storm's perspectives when they activated their Ultimates. This issue has been resolved."
        ]
      },
      {
        "date_version": "25/01/10: Version 20250110 / Season 1: Eternal Night Falls Launch",
        "changes": [
          "Reduce base health from 275 to 250.",
          "Reduce Hela's season bonus from 20% to 15%.",
          "Added 1 new costume: Will of Galacta."
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "The damage falloff of Nightsword Thorn at 30 meters will be changed from 70% to 80%."
        ]
      },
      {
        "date_version": "25/03/07: Version 20250307 / Galacta's Cosmic Adventure Event",
        "changes": [
          "Resolved an inconsistency where Hela would sometimes be launched up after unleashing her Ultimate Ability. The Goddess of Death will now fly firm to rain destruction her foes!",
          "Fixed an issue where after Hela releases her Ultimate Ability, sometimes she may not be immediately detected when near the mission vehicle. Now her presence will be felt."
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Increase cooldown time for Astral Flock from 12 seconds to 15 seconds.",
          "Increase Spell Field Damage of Piercing Night from 30 to 35.",
          "Decrease cooldown time for Soul Drainer from 12 seconds to 10 seconds."
        ]
      },
      {
        "date_version": "25/04/25: Version 20250425 / Giant-Size Brain Blast Event",
        "changes": [
          "Added 1 new costume: Yami no Karasu."
        ]
      }
    ],
    "official_quote": null,
    "official_description": "Hela is a Duelist hero in Marvel Rivals, and is the 19th hero introduced to the game's roster. She has team-up abilities that work in conjunction with Loki and Thor."
  },
  "background": {
    "real_name": "Hela (ᚺᛖᛚᚨ)",
    "aliases": [
      "Goddess of Death",
      "Queen of Death",
      "Queen of Hel"
    ],
    "birthplace": "Asgard",
    "birthdate": null,
    "gender": "Female",
    "eye_color": "Green",
    "hair_color": "Black",
    "relatives": [
      "Loki",
      "Karnilla"
    ],
    "affiliation": [
      "Gods of Asgard"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Command over life and death",
      "Necromancy",
      "Weapon summoning",
      "Black magic",
      "Superhuman speed and strength",
      "Asgardian physiology"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Hela%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "48.43%",
    "wr_change": "-0.34%",
    "pick_rate": "12.29%",
    "pr_change": "+3.41%",
    "ban_rate": "4.56%",
    "matches": "183,013"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}