{
  "name": "Human Torch",
  "role": "Duelist",
  "stats": {
    "health": 250,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#F97316",
    "color_theme_secondary": "#EF4444"
  },
  "abilities": [
    {
      "name": "FIRE CLUSTER",
      "keybind": "LMB",
      "type": "Burst Projectile",
      "description": "Launch forward a splittable fireball",
      "casting": null,
      "damage": "7 per round",
      "damage_falloff": "Falloff begins at 15m, decreasing to 60% at 40m.",
      "fire_rate_interval": "0.5s per round",
      "ammo": 6,
      "critical_hit": true,
      "cooldown": null,
      "range": null,
      "projectile_speed": "150m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Each shot consumes one fire cluster out of 6. Regenerating fire clusters is extremely fast as it takes 2 seconds to load from 1 cluster to all 6 of them. This can be used indefinitely without stopping as when he reaches 0, the regeneration of his fire clusters is constant and thus can effectively keep launching them. It should be noted that while attacking when there are 1 or no fire clusters, his attack speed will be lowered somewhat."
    },
    {
      "name": "BLAZING BLAST",
      "keybind": "RMB",
      "type": null,
      "description": "Launch a fireball to create a Flame Field at the targeted area",
      "casting": "Straight-line projectile that generates a spherical spell field upon impact.",
      "damage": 40,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": 3,
      "critical_hit": null,
      "cooldown": "2s per strike",
      "range": "3m spherical radius",
      "projectile_speed": "80m/s",
      "charges": null,
      "duration": "6s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Each blazing blast field lasts up to 6 seconds before disappearing. Enemies take the most damage if hit with the blazing blast directly, but will take continuous damage if they stand within its field.  FLAME FIELD CONTINUOUS DAMAGE - 25/s"
    },
    {
      "name": "FLAMING METEOR",
      "keybind": "F",
      "type": null,
      "description": "Dive towards the ground, dealing damage to enemies and detonating any Flame Fields hit",
      "casting": null,
      "damage": 40,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": "5m spherical radius",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "bonus_health": "75",
        "bonus_health_falloff": "30 per second after 3 seconds"
      }
    },
    {
      "name": "PLASMA BODY",
      "keybind": "SHIFT",
      "type": null,
      "description": "Enter a state of accelerated ascent",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "50%",
      "energy_cost_details": "15/s. MAXIMUM ENERGY - 120. ENERGY RECOVERY SPEED - 20/s",
      "details": "This ability cannot be used at the same time as using his other abilities."
    },
    {
      "name": "PYRO-PRISON",
      "keybind": "E",
      "type": null,
      "description": "Form a fire wall between Fire Fields to burn enemies",
      "casting": null,
      "damage": 65,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": "MAX LINK DISTANCE - 40m. MAX LINK HEIGHT - 2m",
      "projectile_speed": null,
      "charges": null,
      "duration": "5s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Pyro-prison cannot create fire walls between Blazing Blasts if they each are on different elevations. Human Torch's Blazing Blasts and Pyro-prison are stationary when placed and thus cannot do active damage to enemies outside their range. FIRE WALL CONTINUOUS DAMAGE - 50/s. When this ability is used when 3 or more Blazing Blasts are active, it will create a geometric shape with the Blazing Blasts acting as connected dots. When making a shape like a triangle, rectangle, etc. the area inside also acts as a flame field to which any enemies caught within will take overtime damage. When 2 are active and are within range of each other can create a firewall which will damage enemies who walk over it."
    }
  ],
  "ultimate": {
    "name": "SUPERNOVA",
    "keybind": "Q",
    "type": null,
    "description": "Explode with cosmic fire to deal damage to enemies within range. Upon skill activation, all Flame Fields will transform into Flame Tornadoes, dealing extra damage",
    "casting": null,
    "damage": null,
    "range": "20m spherical radius",
    "effect": null,
    "duration": "8s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 4000,
    "details": {
      "activation_shockwave_damage": 80,
      "flame_tornado_damage": "120 per/s"
    }
  },
  "passives": [],
  "teamups": [
    {
      "name": "Fantastic Four",
      "partner": [
        "Invisible_Woman",
        "Mister_Fantastic",
        "The_Thing"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": "5s",
      "cooldown": "20s",
      "range_target": null,
      "special_notes": "Ability: Storm Siblings",
      "details": "Bonus Health Growth: Generate 5 Bonus Health per 0.1s<br/>Bonus Health Max: 100<br/>Bonus Health Decay: Lose 5 Bonus Health per 0.1s after ability is over<br/>Special Effect: Base Health is also increased by a maximum of 100. If full HP, Base Health is not increased. If missing 1-99 HP, it will only increase Base Health by the missing amount. Bonus Health will not exceed max Base Health throughout the ability duration"
    },
    {
      "name": "Storming Ignition",
      "partner": [
        "Storm"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": null,
      "cooldown": "15s; no cooldown if Ultimate is used with Q instead of X",
      "range_target": "Up to 40m",
      "special_notes": "Ability: Omega Fire",
      "details": "Strengthened Flame Tornado Range: 5m spherical radius; 10m high capsule-shaped spell field.<br/>Strengthened Flame Tornado Continuous Damage: 110/s<br/>Special Effect: Human Torch can either press X to start the Team-Up immediately, or Q to start it at the player's leisure"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Human Torch excels with exceptional aerial mobility (<b>Plasma Body - Shift</b>) and flanking maneuvers, applying pressure from unexpected angles. His strategy involves strategic placement of <b>Blazing Blast (RMB)</b> to create persistent flame fields for zoning and setting up his <b>Flaming Meteor (F)</b> dive combo. <b>Pyro-Prison (E)</b> forms fire walls between his flame fields, trapping opponents or denying access to objectives. His primary, <b>Fire Cluster (LMB)</b>, acts like a shotgun, best at closer ranges.</p>\n<p>Position Human Torch mid-range, utilizing flight for high ground or flanks. Strategically place flame fields to control enemy movement, then dive onto unsuspecting targets with <b>Flaming Meteor</b> for burst. His ultimate, <b>Supernova (Q)</b>, provides massive area control and damage, transforming pre-placed flame fields into powerful tornadoes. Effective flight resource management is crucial. He is characterized by disruption and aggressive engagements from multiple angles.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Flame Field Detonator Combo (Primary Burst):</u></b><br>Place two <b>Blazing Blasts (RMB)</b> near each other → Activate <b>Pyro-Prison (E)</b> to link them into a firewall → Dive in with <b>Flaming Meteor (F)</b> to detonate the fields for a fiery burst finish.<br><br></li>\n  <li><b><u>Fast Burst Combo (Animation Cancel):</u></b><br><b>Fire Cluster (LMB)</b> → <b>Blazing Blast (RMB)</b> → <b>Flaming Meteor (F)</b>. Requires precise timing for seamless transitions.<br><br></li>\n  <li><b><u>Aerial Attack Initiation:</u></b><br>Use <b>Plasma Body (Shift)</b> to ascend → Engage with <b>Fire Cluster (LMB spam)</b> and <b>Blazing Blast (RMB)</b> from the air → Dive down with <b>Flaming Meteor (F)</b>.<br><br></li>\n  <li><b><u>Supernova (Q) Ultimate Setup:</u></b><br>Pre-place several <b>Blazing Blasts (RMB - Flame Fields)</b> in a target area → Activate <b>Supernova (Q)</b>. This transforms the flame fields into damaging tornadoes during the ultimate's duration.<br><br></li>\n  <li><b><u>Plasma Body (Shift) Flight Management:</u></b><br>Use flight for flanking, gaining high ground, or escaping. Be mindful of the flight resource to avoid being grounded and vulnerable.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Low-mobility characters (e.g., <u>Cloak & Dagger</u>, <u>The Punisher's</u> turret) who struggle to escape flame fields and dives. Characters without strong vertical mobility who can't contest his aerial dominance. Tightly grouped enemies vulnerable to his AoE.<br><br></li>\n  <li><b>Challenging Against:</b> Accurate hitscan characters (e.g., <u>Hela</u>, <u>The Punisher</u>, <u>Hawkeye</u>) who can shoot him out of the air. High-mobility characters with strong anti-air (e.g., <u>Spider-Man</u>, <u>Iron Fist</u>, <u>Storm</u>). Flight counters (e.g., <u>Hawkeye's</u> Hypersonic Arrow). Characters creating persistent threats that limit safe maneuverability (e.g., <u>Namor's</u> turrets).<br><br></li>\n  <li><b>Key Synergies:</b> Benefits from team coordination, especially with characters providing crowd control (to hold enemies in flame fields) or shields (to protect him during dives).</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Remarkable Mobility & Verticality:</b> <b>Plasma Body (Shift)</b> allows rapid map traversal, effective flanking, and aerial dominance.</li>\n  <li><b>Strong Area Denial & Zoning:</b> <b>Blazing Blast (RMB)</b> and <b>Pyro-Prison (E)</b> effectively control enemy movement and secure objectives.</li>\n  <li><b>Significant Burst Damage Potential:</b> <b>Flaming Meteor (F)</b> combo can quickly eliminate non-tank heroes.</li>\n  <li><b>Massive AoE Ultimate:</b> <b>Supernova (Q)</b>, especially with pre-placed flame fields, offers immense area control and damage.</li>\n  <li><b>Disruptive Playstyle:</b> Constant pressure from multiple angles makes him hard to pin down.</li>\n  <li><b>Effective Flanker:</b> Excels at attacking from unexpected positions.</li>\n  <li><b>Shotgun-like Primary:</b> <b>Fire Cluster (LMB)</b> deals high damage at closer ranges.</li>\n  <li><b>Increased S2 Viability:</b> Enhancements to primary fire and survivability have made him a strong pick.</li>\n</ul>",
    "weaknesses": [
      "His main attack has a slow projectile speed and does less damage at long range that it does mid range.",
      "While he can infinitely throw fire clusters at enemies, when he depletes to 0-1 clusters he has a slower fire rate.",
      "Pyro-prison cannot create fire walls between Blazing Blasts if they each are on different elevations.",
      "Human Torch's Blazing Blasts and Pyro-prison are stationary when placed and thus cannot do active damage to enemies outside their range.",
      "His team up with Storm can only be active if both Human Torch and Storm have their ultimate abilities ready."
    ],
    "achievements": []
  },
  "lore_details": {
    "ingame_bio_quote": "\"I'm the brightest in the sky!\"",
    "ingame_bio_text": "The Human Torch is a Duelist hero in Marvel Rivals, and is the 36th hero introduced to the game's roster during Season 1: Eternal Night Falls. He has team-up abilities that work in conjunction with Invisible Woman, Mister Fantastic, The Thing and Storm.",
    "ingame_story_intro": "Teenager Johnny Storm joined his sister on the crew of an experimental space mission in hopes of visiting the stars. Instead, he became one, gaining power and popularity as a member of the world famous Fantastic Four. Able to generate scorching flames, Johnny is the hottest hero in town - the Human Torch. Since darkness fell on New York City, Johnny has been busy burning Dracula's legions with flames brighter that the sun.",
    "hero_stories": [
      {
        "title": "Fire Exemption Test",
        "content": "Johnny Storm saw a vampire sulking along the edge of Bryant Park, and did what he always did on such an occasion: Lit it up like a Roman candle. Then he saw another one, trying to get away around the corner onto Fifth Avenue. Boom, that one was gone too. He did this every night - or every day, it was hard to tell what time it was in Dracula’s New York, because the sun never came up and the moon always hung low and red seemingly right over Grand Central. Either way, the Human Torch kept the area near Baxter Building as free of vampires as he could. That meant a lot of vampires had gone up in smoke because of him, and that in turn meant that Johnny Storm was currently Number One on Dracula’s hit list. The vampire-in-chief had sent some of his top lieutenants after Johnny, veterans of the Cult of the Darkholders, but either Johnny had lit them up too, or he’d gotten away before they could get a bite on him. Vampires couldn’t bite you when you were made of superheated plasma. That was one reason why he went out on these patrols every day. He was safer than more New Yorkers from the threat of vampires, which made him especially well suited to vampire population control, especially in the area around the Baxter Building, which was uncomfortably close to Dracula’s castle. Johnny did this because he didn’t want vampires around the Baxter Building, but also because he knew that smoking so many vampires right around the castle - where Dracula would watch - was like waving a big old middle finger at the vampire lord. He might have stopped time and imprisoned New York in a weird eternal blood moon night, but that didn’t mean New Yorkers were just going to give up. Johnny stayed in the air, heading south on Madison to make sure no masses of undead monsters were gathering in that direction. Also he thought Ben Grimm was doing his own sweeps of the section of Park Avenue south of Dracula’s castle. Probably vampires couldn’t bite Ben either, but Johnny wanted to make sure. They couldn’t afford to lose him. There were so many vampires, so many monsters, and not nearly enough super heroes left to defend the innocent from them. Blade was around, Moon Knight, the Scarlet Witch...pretty quickly, Johnny ran out of names. Oh. There was also Spider-Man, of course. One of Johnny’s oldest friends, he stayed to fight vampires, but he also was dying to get back across the East River and see about Aunt May in Queens. New York wouldn’t be New York without him. Johnny decided to angle over to Park and see if Ben was staying out of trouble. He hadn’t seen any vampires in a few blocks. As he swooped diagonally over the shadowed buildings lining Park Avenue, he heard an echoing boom and saw a column of smoke blast upward from the center of the street. As it cleared, Johnny saw something so crazy  that it took him a minute to convince himself it was actually real. The creature that tore its way up through the street was a midnight blue in color, maybe ten times the size of an elephant, had three-digit pincers instead of hands, and moved like a dinosaur in an old stop-motion monster movie. It was one of the Deviant Mutates the FF had run into on their first mission together, way back when. Mole Man had a whole stable of bizarre creatures ready to unleash on the world. Johnny remembered this one because it was made of stone, but somehow still moved. Kind of like Ben Grimm, now that he thought about it. And now here it was tearing a huge hole in Park Avenue, revealing a destroyed subway tunnel below, and a cavern below that. As he got a better look at it, Johnny realized that something was different about it, and its surprise appearance suddenly makes a lot more sense. Its eyes, he saw, burned with the empty glow you saw in lower-level vampires, the minions Dracula and the other more powerful vampires created at will. So not only was it a giant rock monster, Johnny thought; it was a giant vampire rock monster. Clearly Dracula was sick of just throwing more and more humanoid vampires at Johnny. He’d decided to take a different track. This was a problem. Johnny couldn’t burn it, so he wasn’t sure at first how to fight back as the creature smashed its way up Madison Avenue toward the Baxter Building. It bared stony fangs and snapped at Johnny, who veered out of the way, streaking its side with fire to no effect. Holy smokes, he thought, was it a vampire now too? ”How did they even bite this thing?” Johnny wondered out loud. It was made of stone. If he couldn’t burn it, how could a vampire bite it? The creature swiped at Johnny, missed, and brought its gigantic pincers down on the street hard enough that manhole covers up and down Madison Avenue flew up into the air like giant spinning coins. From the corner of 33rd, Ben Grimm charged into view. “Torch, ya just draw trouble wherever ya go,” he growled. “Vampires ain’t bad enough?” ”This one’s a vampire too!” Johnny called back as the creature bared stone fangs and snapped at Ben. The Thing swatted its jaws to the side and tried to stomp it back into the hole it had made. ”Crazy!” he shouted. “This town’s gone ta heck in a handbasket since Dracula came along.” The monster shook Ben off and tried to spring on him, but for a guy made out of rocks, Ben Grimm was fairly nimble. He got out of the way. “What are we gonna do about it?” This was a good question. Johnny couldn’t burn it, so the best thing they could do was what Ben was trying to do: Put it back in its hole and make sure it didn’t come out again. The monster snapped at Johnny again as he swooped close, harrying it - and it might have gotten him, too, if a taut cable of spider-webbing hadn’t thwipped out of nowhere and pulled its head to the side. ”Hey, Torch!” Spider-Man called out as he swung into view. “My Spidey-Sense has been tingling like crazy for the last ten minutes. Now I know why.” ”You’re just in time,” Johnny answered l, as he distracted the monster again by swooping close to its snapping jaws - and then narrowly avoiding its pincers, which stabbed through the air where he’d been just a second before. “Get some webs on it, Pete! I’m going to dive under it.” ”You’re gonna what?” the Thing echoed incredulously. ”Easy,” Johnny said. “Pete gets it hanging over the hole, I get underneath it, then break the webs and I’ll help it down the hole.” ”From underneath?” the Thing echoed again. ”Trust me!” Johnny said as he dodged another pincer. ”I can’t break my webs,” Spider-Man said. “They’re too strong.” ”Can I?” the Thing asked. “Don’t remember even trying.” ”Maybe?” Spider-Man wondered. “I’d hate to plan on it, you know?” ”Yeah.” Johnny had a thought. “Ben, if you can’t break the webs, you can just tear off the part of the building they’re stuck to, right?” “Sure,” Ben said. “But you forgot one thing. I can’t climb like him,” jutting a rocky thumb at Spider-Man, “and I can’t fly like you.” Johnny glanced over at Spider-Man, and saw that Pete was reaching the same conclusion he was. “I think we can work around that,” he said. ”Aw, no,” Ben said. “I don’t wanna-“ But Spider-Man had already snapped a web onto his back and started swinging him up into the air. More webs followed, binding the monster to the upper corners of buildings on both sides of Park Avenue, so it hung in the middle, half-in and half-out of the hole it had made. Here was the part part, Johnny thought. He had to get the monster to stay in one place, and the best way to do that was to offer himself up as bait. So he dove underneath it, and the monster pounced. Both of its pincers clamped down on Johnny, not hurting him much but keeping him pinned as the monster bared its fangs. Here’s where he would find out if he was right that vampires couldn’t bite superheated plasma, Johnny thought. He focused and felt his temperature get hotter. Then hitter still. Then so hot that the subway tracks and the concrete pillars inside the ruined station started to buckle. “Now, Ben!” he shouted again. Up above, Ben Grimm tore Spider-Man’s web away from its anchor on the corner of the office tower. Maybe a cubic yard of brick and concrete came with it, tumbling down to crash onto the monster’s stone carapace. And Johnny Storm went nova. The vast mass of the stone monster blocked most of the nova blast from surfing upward and out onto the street. The blast wave radiated downward into the tunnel carved by the stone Deviant on its way up from the deep caves where it originated, melting stone along with the reinforced concrete of the subway tunnel. The monster couldn’t burn, but the shock of the nova blast stunned it and let Johnny break free. He streaked up out of the hole as it collapsed over the monster, which tumbled into the bottomless cavern it had crawled out of just a few minutes before. Molten asphalt, steel, and stone sealed the hole, cooling quickly into a huge pit in the middle of Park Avenue. Whew, Johnny thought. “Flame off,” he said, and dropped to the street. Ben lowered into view on the end of one of Spider-Man’s webs. ”This is humiliatin’,” he said. ”Couldn’t have done it without you, Benjy,” Johnny grinned. As the Thing’s feet hit the pavement, Spider-Man swung down and landed next to him. “Pretty neat trick,” he said. ”Yeah, not bad,” Johnny said. “All about the teamwork.” ”Who ever heard of a vampire rock monster?” Ben was looking at the pit. Then his wonderment was replaced by his typical pessimism. “It might come up again, ya know.” Johnny looked down at the wreckage, the up Park Avenue towards Dracula’s castle. “Yeah,” he said. “I know. This isn’t a war we’re going to win tonight. But it is a war we’re going to win.” The longer he looked at Dracula’s castle, the more Johnny imagined he could see Dracula looking back at him, cold and angry at the failure of his latest scheme to extinguish the Human Torch once and for all. He loved it. “Come and get me,” he dared the distant vampire lord. “If you’ve got the guts.”",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "25/02/21\nVersion 20250221\n/Season 1.5 Launch",
        "changes": [
          "Human Torch was added as the 36th hero to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 2 new costumes: First Family and Negative Zone Gladiator.",
          "Added to the Fantastic Four Team-Up Ability with Invisible Woman, Mister Fantastic, and The Thing and the Storming Ignition Team-Up Ability with Storm."
        ]
      },
      {
        "date_version": "25/03/07\nVersion 20250307\n/Galacta's Cosmic Adventure Event",
        "changes": [
          "Resolved a glitch where the Human Torch's Flaming Meteor ability could sometimes trap hit enemies inside walls. Now, foes will feel the burn, not the barrier!",
          "Fixed an issue that the Human Torch's Pyro-Prison wouldn't promptly disappear upon his defeat. No more lingering flames!"
        ]
      },
      {
        "date_version": "25/03/14\nVersion 20250314",
        "changes": [
          "Increase Fire Cluster projectile speed from 120m/s to 150m/s and projectile count from 12 to 14.",
          "Increase the energy cost of Supernova from 3400 to 4000.",
          "Increase activation wave damage from 70 to 80 and Flame Tornado damage from 100 per/s to 120 per/s."
        ]
      },
      {
        "date_version": "25/03/27\nVersion 20250327",
        "changes": [
          "Addressed a rare bug where the Human Torch's Primary Attack would sometimes miss its target entirely, leaving his incendiary prowess a little less scorching. With this fix, every burst of flame burns as brilliantly as intended--ensuring his heat is always on target!"
        ]
      },
      {
        "date_version": "25/04/11\nVersion 20250411\n/Season 2: Hellfire Gala Launch",
        "changes": [
          "Reduce attack interval for Fire Cluster from 0.6 seconds to 0.5 seconds; the launch timing of the primary attack projectile has been advanced.",
          "Increase the cooldown for Flaming Meteor from 12 seconds to 15 seconds, but add a new effect: After releasing Flaming Meteor, immediately gain 75 Bonus Health, which will start to falloff 3 seconds later at a rate of 30 per second.",
          "Added 1 new costume: Blood Blaze (unlocked from ranked mode in Season 1.5)"
        ]
      }
    ],
    "official_quote": "\"Is it hot in here or is it just me? Oh right. It's totally me!\"",
    "official_description": "The Human Torch is a Duelist hero in Marvel Rivals, and is the 36th hero introduced to the game's roster during Season 1: Eternal Night Falls."
  },
  "background": {
    "real_name": "Jonathan Lowell Spencer \"Johnny\" Storm",
    "aliases": [
      "Torch"
    ],
    "birthplace": "Long Island, New York",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Blue",
    "hair_color": "Blond",
    "relatives": [
      "Sue Storm (older sister)",
      "Franklin Richards (nephew)",
      "Valeria Richards (niece)",
      "Reed Richards (brother-in-law)"
    ],
    "affiliation": [
      "Fantastic Four"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Pyrokinesis",
      "Plasma fire generation",
      "Heat energy manipulation and absorption",
      "Flight"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Human+Torch%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "50.91%",
    "wr_change": "N/A",
    "pick_rate": "7.52%",
    "pr_change": "N/A",
    "ban_rate": "22.69%",
    "matches": "111,976"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}