{
  "name": "Invisible Woman",
  "role": "Strategist",
  "stats": {
    "health": 275,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#BFDBFE",
    "color_theme_secondary": "#A855F7"
  },
  "abilities": [
    {
      "name": "ORB PROJECTION",
      "keybind": null,
      "type": null,
      "description": "Launch a force field that can pierce heroes, flying to maximum distance before returning to Invisible Woman; damaging enemies and healing teammates.",
      "casting": "Single-cast projectile with delayed impact.",
      "damage": "20 per hit",
      "damage_falloff": null,
      "fire_rate_interval": "0.5s per hit",
      "ammo": 10,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": "120m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "⚬ Orbs can pierce heroes and return to Invisible Woman after reaching their maximum distance. They damage enemies and heal teammates"
    },
    {
      "name": "PSIONIC VORTEX",
      "keybind": "SHIFT",
      "type": null,
      "description": "Gather psionic energy and cast it, upon hitting a target, scene or pressing the LShift key again, it erupts into a psionic vortex, continuously drawing in enemies and causing damage.",
      "casting": "Single-cast projectile with delayed impact that also generates a spell field",
      "damage": "35/s",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "12s",
      "range": "5m radius",
      "projectile_speed": "80m/s",
      "charges": null,
      "duration": "4s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "⚬ Applies a slow effect to enemies within the spell field; the closer they are to the center of the field, the greater the slow effect"
    },
    {
      "name": "FORCE PHYSICS",
      "keybind": "E",
      "type": null,
      "description": "Manipulate psionic energy to push or pull enemies in front of you.",
      "casting": "Cylindrical Spell Field",
      "damage": "55",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": "1.5m radius, 30m length (Cast)\n12m (Push)\n7m (Pull)",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "⚬ On cast, press\nto push enemies away, or\nto pull enemies in."
    },
    {
      "name": "AGILE STRIKE",
      "keybind": "V",
      "type": null,
      "description": "Release a three-hit combo, the third attack will launch up enemies in front.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "VEILED STEP",
      "keybind": "SPACE",
      "type": null,
      "description": "Generate a force field at your feet, stepping on it propels you into Invisible state.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "6s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "GUARDIAN SHIELD",
      "keybind": null,
      "type": null,
      "description": "Generate a force field in front of a selected ally. The shield can block damage and provide Healing Over Time to nearby allies. Enemies that pass through the shield are slowed.",
      "casting": "Targeted",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "6s upon destruction",
      "range": "3m radius",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "⚬ Before the shield is destroyed, Invisible Woman can choose to reproject the shield onto a selected teammate at any time. After the shield has been damaged, Invisible Woman can press the F key to reclaim the shield and restore its value.": null
      }
    }
  ],
  "ultimate": {
    "name": "INVISIBLE BOUNDARY",
    "keybind": "Q",
    "type": null,
    "description": "Manifest an unseen forcefield within a chosen area, rendering allies inside undetectable by enemies and providing healing over time. Enemies that pass through the field are slowed.",
    "casting": "Targeted, generates a cylindrical spell field",
    "damage": null,
    "range": "10m radius, 40m height",
    "effect": null,
    "duration": "8s (Forcefield) - 1s (Enemy slow down)",
    "health_upon_revival": null,
    "slow_rate": "55%",
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 4300,
    "details": null
  },
  "passives": [
    {
      "name": "COVERT ADVANCE",
      "keybind": null,
      "type": null,
      "description": "Enter Invisible state some time after disengaging from combat and grant yourself healing over time.",
      "cooldown": null,
      "damage": null,
      "range": null,
      "trigger_condition": null,
      "effect_boost": null,
      "speed_details": null,
      "details": null
    }
  ],
  "teamups": [],
  "gameplay": {
    "strategy_overview": "Focus on a backline support role, maximizing both damage and healing. Position yourself strategically to take advantage of bottlenecks, healing allies and damaging enemies simultaneously. Prioritize lining up multiple targets with your primary fire to charge your ultimate quickly and maximize healing and damage. Use your abilities effectively: the Guardian Shield for blocking damage, slowing enemies, and healing; Psionic Vortex for crowd control and confirming picks; and Force Physics for displacing enemies. Remember to use your double jump and invisibility strategically for survival. Use your ultimate to counter enemy ultimates and strategically combine it with other abilities, especially in stacked team compositions. Position shields out of the enemy's line of sight for continuous healing. -- As Sue Storm, your strength lies in controlling the flow of battle and providing crucial support. Employ your force push/pull to disrupt enemy positioning, secure eliminations, and peel for teammates. Don't forget the utility of Psionic Vortex to counter aerial threats and clear enemy deployables. While your primary fire has limited range, position yourself to effectively use your healing shield on allies in the thick of the fight and remember your ultimate is a rapid heal, not invincibility, so use it strategically.",
    "weaknesses": [
      "Limited self-sustain, as outside of her Ultimate, she can only heal herself while invisible or through Guardian Shield.",
      "In addition, any damage taken will break the invisibility.",
      "Very reliant on positioning to maximize damage and healing, as her primary fire has relatively low range.",
      "In addition, her primary fire cannot deal critical hits.",
      "Guardian Shield cannot be cast on herself, and will only regenerate if Invisible Woman reclaims it from the field.",
      "Allies inside the Invisible Boundary can still be damaged by the enemy team."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Daughters of Liberty",
        "description": "As Invisible Woman, partner with Black Widow to land 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Lady of the House",
        "description": "As Invisible Woman, assist the Fantastic Four members 10 times.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Even when you can't see me, I'll still make you believe.\"",
    "ingame_bio_text": "Cosmic rays altered Susan Storm on a cellular level, granting her the ability to generate impenetrable force fields and to make herself fade from sight in an instant. Despite her frequent lack of visibility, it has always been perfectly clear that Sue is the force holding her family - the Fantastic Four - together.\nAfter the Timestream Entanglement, the Invisible Woman has taken full advantage of her powers, using stealth to explore locations too dangerous for her fellow heroes, especially going on rescue missions for civilians trapped by the creatures of the night.",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Built To Last",
        "content": "Susan Richards took a deep breath as she stood by the window of the Baxter Building and gazed out at a city bathed in darkness. According to the atomic clock that her husband Reed had installed on the kitchen wall, sunrise should have been over two hours ago. By now, the skyscrapers lining 42nd Street should have been glistening in the morning's rays, but Sue honestly couldn't remember the last time she had seen any natural light, save for the haunting glow of the Blood Moon that hung ever-present in the sky above Manhattan.\n\"A warm beverage for you,\" a synthesized voice said from behind her.\nSue turned to see\nH.E.R.B.I.E.\n, the Fantastic Four's robotic assistant, extending his mechanical arm and offering her a steaming cup of herbal tea.\n\"Thanks, H.E.R.B.I.E.,\" Sue said, taking the glass from him and inhaling the gentle aroma wafting from it. \"You're a doll.\"\n\"Actually, I am a Humanoid Experimental Robot, B-Type, Integrated Electronics,\" H.E.R.B.I.E. replied. \"Dolls are not capable of independent thought.\"\n\"Of course not,\" Sue said with a smile. \"Just a figure of speech.\"\n\"You look concerned, Mrs. Richards,\" H.E.R.B.I.E. said, hovering beside Sue as they both looked out the window at the city below. \"Have things in the city taken a turn for the worse?\"\n\"Can't get much worse than a city locked in a state of everlasting night,\" sue said. \"Especially when that city has been infested with vampires. This may be the first time I've taken a break in... well, I've lost track of the days, honestly...\"\n\"I have not,\" H.E.R.B.I.E. responded. \"It has been six days, twenty-two hours, thirty-seven minutes, and twelve seconds since your last-\"\n\"I think I get the point,\" Sue said. \"If I want to make a real difference out there, I need to start taking better care of myself. And my family.\"\n\"That is what I am here for,\" H.E.R.B.I.E. said. \"Despite the dire circumstances outside, I have made certain that all of Franklin and Valeria's needs have been met so that you may attend to more important matters.\"\n\"Yes...\" Sue said, a tinge of sadness in her voice. \"More important matters...\"\n\"I am sorry if the words I chose offended you in any way,\" H.E.R.B.I.E. responded. \"I merely meant that, at the moment, the world needs you and Dr. Richards far more than your children do.\"\n\"You don't think my children need me?\" Sue snapped back, her frustration bubbling to the surface. \"Even after all we've done, the world is still falling apart! And instead of being there for Franklin and Val, I've handed them off to a robot nanny. They deserve so much better...\"\n\"I... am sorry you feel that way...\" H.E.R.B.I.E. said, immediately turning and floating away.\n\"H.E.R.B.I.E., wait!\" Sue called after him, but the little robot had already disappeared down a dark corridor.\nSue let out a deep sigh. Her exhaustion had started to get the best of her, but she had never been one to stop fighting before. And she certainly had never been one to let those close to her down. She took one last sip of her tea and then headed towards her husband's lab, hoping that she would find H.E.R.B.I.E. there so that she could make amends.\n\"Careful, dear,\" Reed\nsaid as she entered the lab. \"I'm running a test on the Chronovium samples\nBen\nbrought back from his last recon mission. I've got a fascinating theory about the effects of the crystals' chronal energy on damaged-\"\n\"That's great, Reed,\" Sue said, cutting her husband short before he got lost in another scientific lecture. \"Have you seen H.E.R.B.I.E. by any chance?\"\n\"Not since this morning,\" Reed replied. \"We had a bit of a... disagreement...\"\n\"You're not the only one,\" Sue said. \"What was yours about?\"\n\"After\nTony Stark\nand I started working together on the Timestream Reintegration Device,\" Reed said. \"H.E.R.B.I.E. began to forge a friendship with Tony's virtual assistant, F.R.I.D.A.Y.\"\n\"That's actually kind of cute,\" Sue said. \"What's the problem with that?\"\n\"Tony was going to allow F.R.I.D.A.Y. to pilot one of his Stark Sentinels on a mission into the city this morning,\" Reed responded. \"H.E.R.B.I.E. asked if he might be able to leave the Baxter Building to accompany her. My answer was an unequivocal no.\"\n\"And I'm guessing he didn't take it well,\" Sue said.\n\"H.E.R.B.I.E. wasn't built for combat,\" Reed replied, \"and he's so much more valuable to us here. I couldn't even begin to imagine how our family would fare if something were to happen to him. He's one of the few things holding us together.\"\n\"And you told him that last part, right?\" Sue asked, already knowing the answer.\n\"I might have been a bit too distracted by my experiments at the time to expand upon my reasoning....\" Reed replied sheepishly.\n\"Nothing new there,\" Sue said. \"So H.E.R.B.I.E. was already feeling undervalued, and then I just went and made it a hundred times worse.\"\n\"Hold on,\" Reed said, turning to one of the monitors in the lab. \"I'm picking up an emergency signal on our encrypted comm channel. It looks like it's from-\"\n\"H.E.R.B.I.E.,\" Sue said. \"He went out into the city anyway, didn't he?\"\n\"I'm afraid so,\" Reed replied. \"How did you know?\"\n\"We made him feel like he wasn't capable of doing something,\" Sue said, \"so he went out to prove us wrong. He's been spending so much time cooped up in here with Franklin lately, I guess our son must have rubbed off on him.\"\n\"I'll contact Ben and have him go to H.E.R.B.I.E.'s location as soon as he completes his current mission,\" Reed said.\n\"No,\" Sue replied. \"I helped make this mess. I need to be the one who cleans it up. H.E.R.B.I.E. couldn't have made it that far. Give me his coordinates, and I'll get him back home safe.\"\n\"I'm sure you will, dear,\" Reed said. \"You always do.\"\nSue exited the Baxter Building and took to the streets, using her powers to ben the moonlight around her, rendering her body invisible. But even though she had vanished from sight, she knew she had to be careful. The vampire lurking the streets would still be able to smell her blood.\nFortunately, H.E.R.B.I.E.'s locator signal was only a few blocks away, near Grand Central Station. As Sue headed East on 42nd Street, she saw a horde of vampires engaged in battle with an unexpected group of heroes: a scrappy scurry of squirrels. She was about to generate a force projectile to save the small creatures, but she soon realized that they were holding their own against the vampires. Perhaps they were part of\nSquirrel Girl\n's personal army, Sue thought, as the tiny rodents gnawed and clawed at their foes in a frenzy. And if they weren't, they certainly should be.\nAs the chittering robots chased the vampires from the scene, Sue continued on her quest to find H.E.R.B.I.E. Just before she reached Grand Central Station, she heard a voice from behind her, but it wasn't mechanical like H.E.R.B.I.E.'s. This one sounded ethereal,as if it was speaking to her from beyond the grave.\n\"I know you're there, lady,\" it said.\nSue turned around and look for the source of the voice, but couldn't seem to find where it was coming from.\n\"Down here,\" the voice said. Sue gazed down to see a small basset hound near her feet, its semi-transparent body glowed a gentle blue.\n\"My senses work a lot different now that I'm on the other side,\" he continued. \"Can't hide much from this old pooch.\"\n\"I've seen you before,\" Sue said, kneeling down next to the ghostly dog. \"You belong to Stephen, don't you... I'm sorry, what was your name again...?\"\n\"Bats,\" the haunting hound replied, \"and I don't belong to no one. But yeah, Strange and I do hang out a bit. I think the Doc took off somewhere to try and get to the bottom of this moon mess, so I've been gettin' out of the Sanctum on my own every now and then.\"\n\"Isn't he worried you'll be harmed?\" Sue asked, her invisible hand passing right through the ghost dog's head as she reached out to pet him.\n\"Maybe,\" Bats replied, \"but he shouldn't be. First off, I'm already a ghost. It's not like I could die again. And second, you humans tend to underestimate what us little guys are capable of.\"\n\"Yes...\" Sue said, her thoughts drifting back to H.E.R.B.I.E., \"...we do. Speaking of which, you haven't seen a small robot nearby, have you?\"\n\"I saw a robot, all right,\" Bats replied, \"but it sure as heck wasn't small. The dang thing crashed into Grand Central not that long ago. A big, fancy hero like you might wanna go and have a look...\"\n\"Thanks,\" Sue said, picking up her pace as she rushed down the block toward the terminal to see what Bats was talking about.\nWhen she turned the corner, Sue immediately saw what the ghost dog had described. One of Tony Stark's massive Sentinels was embedded into the wall of Grand Central Station, its mechanical form severely damaged sparking wildly. And there, standing on the robot's shoulder, was H.E.R.B.I.E.\nSue used her force field energy to create a platform that elevated her to the same level as her robotic friend.\n\"There you are,\" she said. \"I was worried about you.\"\n\"It is not me that you should be concerned about,\" H.E.R.B.I.E. replied. \"It is F.R.I.D.A.Y. I detected her distress signal when her mechanical form was shot down, but she is no longer responding.\"\nSue noticed that H.E.R.B.I.E.'s arm was extended to gently touch the side of the Sentinel's damaged head, and small wires had extended from his fingers, linking to the larger robot's exposed circuitry.\n\"So you weren't running away...\" Sue said. \"You came here to help her.\"\n\"I was not sure anyone else would,\" H.E.R.B.I.E. replied. \"Even her maker.\"\n\"I'm certain Tony has a backup copy of F.R.I.D.A.Y.'s operating system on file,\" Sue said.\n\"But who knows when it was made?\" H.E.R.B.I.E. asked. \"It might not contain any of her recent memories and experiences, including...\"\n\"Including the friendship she's built with you?\" Sue asked.\n\"Affirmative,\" H.E.R.B.I.E. replied. \"That is my primary concern... but it is only one of many.\"\n\"I know,\" Sue replied, \"And you have every right to be upset with me. I can't imagine how what I said back at the Baxter Building made you feel.\"\n\"That is not what I meant,\" H.E.R.B.I.E. responded, motioning toward the street below. \"I was referring to them.\"\nSue looked down to see a group of vampires beginning to climb the damaged Stark Sentinel toward her.\n\"I'll take care of them, H.E.R.B.I.E.,\" Sue said. \"You just focus on recovering your friend.\"\nSue leapt down off her invisible platform and engaged the vampires in battle, hurling force projectiles at some, while wrapping the others in containment fields. She wasn't about to let any of them sink their teeth into her, nor was she about to let them disrupt H.E.R.B.I.E.'s personal mission.\nAs she continued to fight, one of her force constructs slammed a vampire into the heavily-damaged arm of the Stark Sentinel. Upon impact, the arm seemed to repair itself instantaneously, almost as if time were rewinding. Sue couldn't believe her eyes as the giant robotic arm powered up and released a repulsor blast, knocking back several of her bloodthirsty foes.\n\"Interesting,\" said H.E.R.B.I.E. as he watched the damage undo itself. \"Doctor Richards recently shared with me his early research regarding time fluctuations that he believes were caused by crystalized chronal energy constructs called Chronovium. I'm sure he would appreciate any additional data we could collect in the field...\"\nUnfortunately, Sue didn't have time to explore this phenomenon any further, not even for her husband. The number of vampires was continuing to grow, and she could barely keep up with their attacks. The mental fatigue she had experienced earlier was now affecting her physically as well. She erected a force field around herself, preventing the vampires from reaching her, but she knew she could only hold it for so long.\n\"Do not fear, Mrs. Richards,\" H.E.R.B.I.E. yelled from above, his metallic voice somehow reassuring. \"Help is on the way.\"\nSue expected to see the rest of the Fantastic Four arrive on the scene, but instead, a tiny army of Spider-Bots skittered into sight. Some began to fire laser blasts at their fanged foes while others detonated themselves around the vampires' feet.\n\"Never underestimate the little guys,\" Sue said, remembering what Bats had told her. Soon, the number of vampires had dwindled enough that Sue was able to drop her protective field and finish off the remaining few herself. For once, she took great pleasure pummeling the vampires into submission.\n\"Are these friends of your, too, H.E.R.B.I.E.?\" Sue said, looking at one of the tiny Spider-Bots.\n\"They are now,\" H.E.R.B.I.E. said. \"they claim that they heard F.R.I.D.A.Y.'s distress call as well, and came running as fast as their tiny legs could carry them.\"\n\"Hmm...\" Sue said, examining a Spider-Bot more closely. \"They don't look like Peter's work...\"\n\"They tell me they were built by\na different Parker\n,\" H.E.R.B.I.E. replied. \"Peni, I believe. Though I may be mistaken. Their programming language is decades beyond my own. And also, in Japanese.\"\n\"Well, it's not their creator I should be thanking anyway,\" Sue said. \"It's them. And you.\"\n\"Me?\" H.E.R.B.I.E. said, surprised. \"Why?\"\n\"Because your little adventure reminded me of why we've been trying to keep you safe in the Baxter Building to begin with,\" Sue replied.\n\"Because I am a valuable tool that you cannot risk losing?\" H.E.R.B.I.E. asked.\n\"You're not valuable because you are a tool, H.E.R.B.I.E.,\" Sue said. \"The reason we can't risk losing you is because you're family. Tools can be replaced. You can't, And while you may not have been designed to fight off vampires, maybe we haven't been giving you enough credit for what you're truly capable of...\"\n\"Your words touch me, Mrs. Richards,\" H.E.R.B.I.E. said, \"deep in my central processing core.\"\n\"Glad to hear it,\" Sue said, wrapping herself and H.E.R.B.I.E. in a shroud of invisibility. \"Now, let's get you back home safely. Once we restore F.R.I.D.A.Y.'s memory files and get them back to Tony, I'm going to talk to Reed about giving you a few upgrades...\"\n\"As it turns out, I am perfectly happy just the way I am...\" H.E.R.B.I.E. said, a smile flashing across the digital display on his face.\n\"...though I suppose a few lasers could come in handy now and then...\"",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "25/01/10:\nVersion 20250110\n/\nSeason 1: Eternal Night Falls\nLaunch",
        "changes": [
          "Invisible Woman\nwas released as the 35th character to be introduced to\nMarvel Rivals\nas a\nStrategist\nhero.",
          "Added 2 new costumes:\nFirst Family\nand\nMalice\n.",
          "Added to the\nFantastic Four\nTeam-Up Ability\nwith\nMister Fantastic\n."
        ]
      },
      {
        "date_version": "25/01/22:\nVersion 20250122\n/\nFortune & Colors\nEvent",
        "changes": [
          "Mobility abilities for specific heroes are now fully operational within the range of\nInvisible Woman\n'\ns\nPsionic Vortex\n- no more containment issues!",
          "Fixed an issue preventing\nNamor\nand\nInvisible Woman\nfrom unleashing their ultimate abilities at certain door locations--now they can break through any barrier!"
        ]
      },
      {
        "date_version": "25/02/14:\nVersion 20250214",
        "changes": [
          "Added 1 new costume:\nThe Life Fantastic\n."
        ]
      },
      {
        "date_version": "25/02/21:\nVersion 20250221\n/\nSeason 1.5\nLaunch",
        "changes": [
          "Increase the energy cost of\nInvisible Boundary\nfrom 4000 to 4300.",
          "Added 1 new costume:\nBlood Shield\n(unlocked from ranked mode in either\nSeason 1\nor\nSeason 1.5\n)"
        ]
      },
      {
        "date_version": "25/04/11:\nVersion 20250411\n/\nSeason 2: Hellfire Gala\nLaunch",
        "changes": [
          "Decrease the shield value of\nGuardian Shield\nfrom 300 to 250."
        ]
      },
      {
        "date_version": "25/04/25:\nVersion 20250425",
        "changes": [
          "Fixed an error in the recovery rate of\nInvisible Woma\nn'\ns\nGuardian Shield\n."
        ]
      }
    ],
    "official_quote": null,
    "official_description": "The\nInvisible Woman\nis a Strategist\nhero\nin\nMarvel Rivals\n,\nand is the 35th hero introduced to the game's roster during\nSeason 1: Eternal Night Falls\n.\nShe has a team-up ability that works in conjunction with\nMister Fantastic\n,\nHuman Torch\nand\nThe Thing\n."
  },
  "background": {
    "real_name": "Dr. Susan \"Sue\" Storm-Richards (née Storm)",
    "aliases": [
      "Malice",
      "Suzie"
    ],
    "birthplace": "Long Island, New York",
    "birthdate": null,
    "gender": "Female",
    "eye_color": "Blue",
    "hair_color": "Blond",
    "relatives": [
      "Reed Richards (husband)",
      "Johnny Storm (younger brother)",
      "Franklin Richards (son)",
      "Valeria Richards (daughter)"
    ],
    "affiliation": [
      "Fantastic Four"
    ],
    "first_appearance_comic": "Fantastic Four (1961) #1",
    "recommended_comics": [],
    "lore_powers_skills": [
      "Force field projection",
      "Invisibility",
      "Psionic energy"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Invisible+Woman%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "46.91%",
    "wr_change": "-1.16%",
    "pick_rate": "35.70%",
    "pr_change": "-6.50%",
    "ban_rate": "0.45%",
    "matches": "532,663"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}