{
  "name": "Iron Fist",
  "role": "Duelist",
  "stats": {
    "health": 300,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#15803D",
    "color_theme_secondary": "#FACC15"
  },
  "abilities": [
    {
      "name": "JEET KUNE DO",
      "keybind": "LMB",
      "type": "Melee",
      "description": "Strike the targeted enemy with Jeet Kune Do, reducing the cooldown of Block and Strike with every hit.",
      "casting": null,
      "damage": "The first four strikes each deal 30 damage, while the fifth strike deals 50 damage",
      "damage_falloff": null,
      "fire_rate_interval": "The first four strikes have an interval of 0.45s between them, while the fifth strike has a 0.67s interval from the fourth strike",
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "3m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "cooldown_reduction": "1.5 seconds"
      }
    },
    {
      "name": "YAT JEE CHUNG KUEN",
      "keybind": null,
      "type": "Melee",
      "description": "Dash forward to pursue the targeted enemy and unleash a flurry of attacks.",
      "casting": null,
      "damage": "9 flat damage + 2.1% of the target's maximum health with each strike",
      "damage_falloff": null,
      "fire_rate_interval": "7/s",
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "3m",
      "projectile_speed": null,
      "charges": null,
      "duration": "5s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "damage_per_strike": "9 flat damage + 2.1% of the target's maximum health"
      }
    },
    {
      "name": "K'UN-LUN KICK",
      "keybind": "SHIFT",
      "type": "Movement-based damage ability",
      "description": "Dash forward, delivering a flying kick when hitting an enemy or reaching full range, dealing damage to nearby enemies. Damage increases with lower enemy health.",
      "casting": null,
      "damage": "30 (first kick)\n35 - 70 (second kick; maximum damage is achieved when the target is at 50% Health)",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "10s",
      "range": "12m",
      "projectile_speed": "40m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "This ability is highly versatile as a gap closer or a escape tool, as well as a way to finish off enemies with low health. Iron Fist will dash forward to perform the first kick and then perform the second kick at the end of the dash. Additionally, the second kick will deal double the damage against opponents that are below 50% HP (up to 105 total damage if you land both kicks). This ability can be used as a mobility option, an escape tool, or a finishing attack against weak enemies. It is recommended you avoid using your kick to open fights unless you know the target is below 50% HP. If you primarily use the ability as a finisher, you'll take down opponents faster and deal more damage. When escaping from fights, always dash towards either a health pack or your team so you can be healed by your Strategists."
    },
    {
      "name": "HARMONY RECOVERY",
      "keybind": "E",
      "type": "Channel",
      "description": "Cross legs and channel Chi, slowly gaining Bonus Health.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "12s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "3s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "bonus_max_health": "100",
        "decay_rate": "15 HP/s"
      }
    },
    {
      "name": "CRANE LEAP",
      "keybind": "SPACE",
      "type": null,
      "description": "Perform up to three consecutive jumps while airborne.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "1s per charge",
      "range": null,
      "projectile_speed": null,
      "charges": 3,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Crane Leap consists of three additional midair jumps to cover distances faster and gain elevation. Note that your jumps will not recharge if you are midair, so try to stay to the ground every once and awhile to regain your mobility."
    },
    {
      "name": "DRAGON'S DEFENSE",
      "keybind": null,
      "type": null,
      "description": "Assume a defensive stance with the boost of Chi to block incoming attacks and gain Damage Reduction. Once he exits the defensive stance, he gains Bonus Health and can strike back with Yat Jee Chung Kuen.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s - 3s (during Living Chi)",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "1s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "bonus_health_conversion": "200"
      }
    },
    {
      "name": "WALL RUNNER",
      "keybind": "SPACE",
      "type": null,
      "description": "Run horizontally along the walls.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "9m/s",
      "energy_cost_details": null,
      "details": "Wall Runner allows you to run on walls for greater elevation. Whilst doing so, you can also recharge usages for your Crane Leap ability. Use this ability as much as possible so you can recharge your jumps faster and have more options to engage in a fight."
    },
    {
      "name": "CHI ABSORPTION",
      "keybind": null,
      "type": "Passive",
      "description": "Assist in taking down enemies allow him to absorb their Chi and gain Bonus Health.",
      "cooldown": null,
      "damage": null,
      "range": null,
      "trigger_condition": "Assist in taking down enemies",
      "effect_boost": null,
      "speed_details": null,
      "details": "Chi Absorption will grant you an additional 50 bonus health every elimination or assist you earn. This should allow you to play more confidently against isolated targets and slightly increase your survivability when dealing with multiple opponents.",
      "casting": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null
    }
  ],
  "ultimate": {
    "name": "LIVING CHI",
    "keybind": "Q",
    "type": null,
    "description": "Become living Chi to boost his speed, damage, and attack range, delivering stronger punches while reducing the cooldown of Dragon's Defense.",
    "casting": null,
    "damage": "30%",
    "range": null,
    "effect": "⚬ 100% range boost to Jeet Kune Do, K'un-Lun Kick, and Yat Jee Chung Kuen\n⚬ 80% cooldown reduction to Dragon's Defense\n⚬ Refreshes Dragon's Defense",
    "duration": "12s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": "20%",
    "bonus_health_details": null,
    "energy_cost": null,
    "details": "Living Chi provides boosts to a majority of your stats. You gain a 30% damage boost, 20% movement speed boost, and an 100% attack range boost. Your primary fire also becomes Yat Jee Chung Kuen for the duration of the Ultimate. Dragon's Defense has a cooldown of 4 seconds, allowing you to use it a lot more frequently whilst also bombarding enemies with your attacks. This grants Iron Fist high potential to wipe out the enemy team with how agile he becomes and how much damage he can deal to both opponents of low and large health pools. Use it when the enemy team is least expecting you to at least get a few eliminations out of it so your team has a better chance of following up."
  },
  "passives": [],
  "teamups": [
    {
      "name": "Atlas Bond",
      "partner": [
        "Luna_Snow"
      ],
      "effect": null,
      "keybind": "Passive",
      "teamup_bonus": "15% Damage Boost",
      "duration": null,
      "cooldown": null,
      "range_target": null,
      "special_notes": "Role: Anchor | Ability: Dragon's Chill",
      "details": null
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Iron Fist is a highly mobile and aggressive Duelist specializing in disrupting the enemy backline and eliminating high-priority targets. His core gameplay involves identifying vulnerable opponents, using his exceptional agility (triple jumps via <b>Crane Leap - Space</b>, wall-running, <b>K'un-Lun Kick - Shift</b> dash) to reach them from unexpected angles, and delivering bursts of damage. Due to his lower health, engage opportunistically, often after your team initiates, to avoid being focused down.</p>\n<p>At the start of rounds, consider flanking out of sight to scout enemy movements and identify targets or pathways. Utilize high ground and wall-running for sneaky positioning. Before diving, especially from the air, use <b>Harmony Recovery (E)</b> mid-air for an overheal and bonus shields. Engage from unusual angles to cause panic and make yourself harder to counter. Timing attacks with team pressure is crucial; avoid solo dives into grouped enemies. His primary targets are isolated enemies and Strategists.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Basic Squishy Target Combo:</u></b><br>Hold <b>Jeet Kuen Do (LMB)</b> until the full six-hit sequence concludes → Immediately follow with <b>K'un-Lun Kick (Shift)</b>. Often enough to execute low-health targets.<br><br></li>\n  <li><b><u>Mid-Air Dive Engage:</u></b><br>Use <b>Harmony Recovery (E)</b> mid-air for overheal/shields → Drop onto the enemy backline → Execute the basic combo (Hold <b>LMB</b> → <b>Shift</b>).<br><br></li>\n  <li><b><u>Extended Engagement/Reposition:</u></b><br><b>Jeet Kuen Do (LMB)</b> attacks → <b>Dragon's Defense (RMB)</b> to block/parry → <b>Yat Jee Chung Kuen (LMB after block)</b> → <b>K'un-Lun Kick (Shift)</b> → Use <b>Crane Leap (Space)</b> and Wall Run to reposition to high ground → Use <b>Harmony Recovery (E)</b> and re-engage if opportune.<br><br></li>\n  <li><b><u>Ultimate (Living Chi - Q) Usage:</u></b><br>Activate <b>Living Chi (Q)</b> for boosted speed, damage, attack range, and drastically reduced <b>Dragon's Defense (RMB)</b> cooldown. Focus on eliminating healers first, then other targets. Repeatedly use the short-cooldown <b>Dragon's Defense</b> during your ultimate.<br><br></li>\n  <li><b><u>Chase Down Combo:</u></b><br><b>Crane Leap (Space)</b> → <b>Jeet Kuen Do (LMB)</b> attacks while airborne/landing → Repeat jump and attack sequence → Finish with <b>K'un-Lun Kick (Shift)</b> to close distance and execute.<br><br></li>\n  <li><b><u>Defensive Counter:</u></b><br>Initiate with <b>Dragon's Defense (RMB)</b> to block an incoming attack → Assess the situation → Counter with <b>Jeet Kuen Do (LMB)</b>.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Isolated targets. Support characters (Strategists) due to their typically lower health/mobility. Flying heroes (e.g., <u>Iron Man</u>, <u>Storm</u>) due to his aerial agility. Ranged Duelists who struggle at close range (e.g., <u>Hawkeye</u>, <u>Black Widow</u>, <u>The Punisher</u>).<br><br></li>\n  <li><b>Challenging Against:</b> Coordinated teams that protect vulnerable members. <u>Luna Snow</u> (freeze effects interrupt mobility). <u>Groot</u> (ultimate hinders mobility and dive combos). Tanky Vanguards (unless already low health). <u>Loki</u> (clones and runes make him a risky dive target). Long-range, high burst heroes (e.g., <u>Hela</u>, <u>Hawkeye</u>, <u>Human Torch</u>) can eliminate him before he engages effectively.<br><br></li>\n  <li><b>Key Synergies:</b> His team-up with <u>Luna Snow</u> (<b>Dragon's Chill</b>) empowers her ice abilities, creating a Chi-infused frost ring that knocks back, slows, and heals allies.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Exceptional Mobility:</b> Triple jumps (<b>Crane Leap</b>), wall-running, and <b>K'un-Lun Kick (Shift)</b> dash allow for rapid navigation and engagement.</li>\n  <li><b>Effective Backline Disruption:</b> Excels at ambushing and eliminating enemy Strategists and vulnerable DPS.</li>\n  <li><b>Vertical Space Control:</b> Can consistently pressure high ground and chase down flying heroes.</li>\n  <li><b>Strong Defensive Ability:</b> <b>Dragon's Defense (RMB)</b> parries attacks, reduces damage, and empowers a counter-attack.</li>\n  <li><b>Powerful Ultimate (Living Chi - Q):</b> Significantly boosts speed, damage, attack range, and defensive cooldowns.</li>\n  <li><b>Execution Potential:</b> <b>K'un-Lun Kick (Shift)</b> deals increased damage to low-health enemies.</li>\n  <li><b>Self-Sustain:</b> <b>Harmony Recovery (E)</b> provides healing and overheal/shields. Passive (<b>Chi Absorption</b>) grants bonus health on assists.</li>\n  <li><b>Cooldown Reduction Mechanic:</b> Basic attacks reduce <b>Dragon's Defense</b> cooldown, rewarding aggressive play.</li>\n</ul>",
    "weaknesses": [
      "Has very low attack range, especially when Yat Jee Chung Kuen is on cooldown.",
      "Requires proper resource management to play as his defensive tools are also his offensive; the player needs to be careful to activate them at the right time to ensure his survivability while also dealing damage.",
      "Very vulnerable if his defensive and evasive tools are on cooldown."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "The New Agents of Atlas",
        "description": "As Iron Fist, land one KO with an assist from Luna Snow.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Might of Fuxi",
        "description": "As Iron Fist, land 3 KOs with a single use of Living Chi.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"There were lots of Iron Fists before me, but I'll be the best.\"",
    "ingame_bio_text": "Lin Lie is a master of Chinese martial arts who once wielded the shattered Sword of Fu Xi. After fusing its pieces with the mighty Chi of Shou-Lao, he is poised to strike his foes with the grace and force of a soaring dragon as the latest immortal Iron Fist.",
    "ingame_story_intro": "The Timestream Entanglement has caused great upheaval in a number of magical realms. As wars between the gods begin to rage, Lin Lie must protect the sanctuary of K'un Lun from those who seek to tarnish its majestic splendor.",
    "hero_stories": [
      {
        "title": "Fog Over the Kunlun Mountains",
        "content": "Lin Lie closed his eyes and opened his mind. He had come to this sacred place, beneath the Tree of Immortality in the fabled city of K'un-Lun, to meditate on the current state of the universe and his place in it. And, thanks to recent events, he had far more to ponder than he had ever imagined possible. Lin Lie first reflected on how his own journey had brought him here. Not long ago, he was an ordinary young man living in Shanghai, just another face in a sea of 24 million. That all changed when his father, an archaeologist, gifted him an ancient and mysterious sword. Lin Lie would eventually learn that the blade was a divine weapon, known as the Sword of Fu Xi, which had been used to vanquish the demon Chiyou five millenia ago. Pulled into a modern day conflict between ancient mystical forces, Lin Lie became the hero known as the Sword Master, wielding his legendary blade against countless foes. For a time, he fought alongside the Agents of Atlas, a network of pan-Asian heroes dedicating to combating global threats. But during a battle with a vicious Kumiho, Lin Lie found himself gravely wounded and his sacred sword shattered. When Lin Lie awoke from his injuries, not only was he on the shores near the mystical city K'un-Lun, he was also in the presence of the ancient dragon Shou-Lao the Undying. The dragon saved Lin Lie's life by bestowing the boy with his powerful Chi, thus granting Lin Lie the power and mantle of the protector of K'un-Lun — the Immortal Iron Fist. It was an honor that sent Lin Lie's life spiraling in a whole new direction. But not even his newfound power could have prepared him for what was about to happen. A phenomenon known as the Timestream Entanglement was unleashed upon the Multiverse by a pair of mad tyrants, causing entire dimensions to collide and collapse into each other. Though K'un-Lun's unique place just outside of reality had long kept it safe from such crises, this time, the fabled city would not escape the cosmic conflict unscathed. As the Timestream Entanglement rippled through the pocket dimension in which K'un-Lun existed, the city merged with the other six Capital Cities of Heaven — K'un-Zi, Peng Lai, Tiger Island, Z'Gambo, the Kingdom of Spiders, and the Under City. In the past, these mystical realms had only existed in the same space every 88 years, converging for a great tournament between their champions, the Immortal Weapons. But now, they had been joined together far sooner than anyone could have anticipated. To make matters worse, all of the other Immortal Weapons — from Crane Mother to Fat Cobra — had vanished from this newly amalgamated Heart of Heaven. Lin Lie was the only one of their number who remained... and he wondered why... Was it because he had not earned the power of the Iron Fist in the same method that his predecessors had, by plunging their fists into the heart of Shao-Lao? Was his legitimacy as the Iron Fist — and as an Immortal Weapon — in question? Or had the broken shards of the Sword of Fu Xi, which were now embedded within Lin Lie's hands, somehow protected him from the fate that had befallen his fellow warriors? Lin Lie didn't know... and meditating on the subject wasn't provided him with the answers he had come to seek. Fortunately, a much needed distraction had arrived...",
        "status": null
      },
      {
        "title": "Crossing the Sea of Stars",
        "content": null,
        "status": "Coming soon. Stay Tuned!"
      },
      {
        "title": "The Longsword Cuts Across the Heavenly Lands",
        "content": null,
        "status": "Coming soon. Stay Tuned!"
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Iron Fist was released as the 30th character to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 2 new costumes: Martial Arts Savant and Sword Master.",
          "Added the Might of Fuxi achievement.",
          "Added to the Atlas Bond Team-Up Ability with Luna Snow."
        ]
      },
      {
        "date_version": "24/12/10: Version 20241210",
        "changes": [
          "When Iron Fist used pings, the corresponding voice lines would not be triggered. This issue has been resolved."
        ]
      },
      {
        "date_version": "25/01/22: Version 20250122 / Fortune & Colors Event",
        "changes": [
          "Added 1 new costume: Lion's Gaze (Limited-time store release: 2025/01/23 - 2025/02/14)"
        ]
      },
      {
        "date_version": "25/02/20",
        "changes": [
          "Addressed an exploit that allowed Iron Fist to perform rapid consecutive jumps under specific conditions. The martial artist's acrobats are now finely tuned!"
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "Reduce the damage of Jeet Kune Do's 1st, 2nd, and 5th strikes from 32 to 30, while the 3rd and 4th strikes will deal 15 damage instead of 16. The final, devastating strike has been dialed back from 55 to 50.",
          "The cooldown reduction for Dragon's Defense has been extended from 1s to 1.5s.",
          "The damage of each hit from Yat Jee Chung Kuen will take a hit, dropping from 19 to 10 flat damage (including during Living Chi). However, each strike from the Yat Jee Chung Kuen now delivers an extra blow, dealing damage equal to 1.7% of the opponent's maximum health (including during Living Chi).",
          "Increase the additional maximum health granted by Harmony Recovery from 50 to 150. A new decay mechanism for the extra health has also been introduced: one second after the ability ends, the additional health will deplete at a rate of 25 health per second.",
          "Increase the maximum Bonus Health converted from damage blocked during Dragon's Defense from 150 to 200.",
          "Increase base health from 250 to 300."
        ]
      },
      {
        "date_version": "25/03/27: Version 20250327",
        "changes": [
          "Fixed a glitch in Practice Range where Iron Fist wall-climbing was beyond expectations. The master of martial arts can now keep his acrobatic feats on track!"
        ]
      },
      {
        "date_version": "25/04/08",
        "changes": [
          "Resolved a rare glitch where Iron Fist could end up floating indefinently. The Immortal Weapon is now back on the ground, delivering justice and martial arts mastery without any unintended levitation!"
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Reduce the Bonus Max Health gained from Harmony Recovery from 150 to 100, but slow the falloff rate of that health from 25 per/s to 15 per/s.",
          "Lower fixed damage of Yat Jee Chung Kuen from 10 to 9, but increase the percentage damage of the enemy's Max Health per strike from 1.7% to 2.1%.",
          "Decrease the cooldown for K'un-Lun Kick from 12 to 10 seconds.",
          "Added 1 new costume: Immortal Weapon of Agamotto."
        ]
      },
      {
        "date_version": "25/04/25: Version 20250425 / Giant-Size Brain Blast Event",
        "changes": [
          "Squashed a bug causing Iron Fist's K'un-Lun Kick to suddenly rollback in high-latency battles. Now, his moves blast forward with the unstoppable momentum of a true warrior!"
        ]
      },
      {
        "date_version": "Version 20250430",
        "changes": [
          "corrected a spelling mistake in Fog Over the Kunlun Mountains which spelled Lin's name as \"Line\" once."
        ]
      }
    ],
    "official_quote": null,
    "official_description": "Iron Fist is a Duelist hero in Marvel Rivals, and is the 30th hero introduced to the game's roster. He has team-up abilities that work in conjunction with Luna Snow."
  },
  "background": {
    "real_name": "Lin Lie (林烈)",
    "aliases": [
      "The Immortal Weapon",
      "Protector of K'un-Lun",
      "Sword Master"
    ],
    "birthplace": "Shanghai, China",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Brown",
    "hair_color": "Black",
    "relatives": [
      "Lin Feng (older brother)"
    ],
    "affiliation": [
      "Agents of Atlas"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Expert martial artist",
      "Expert hand-to-hand combatant",
      "Harness Spiritual Energy (Chi)",
      "Enhanced strength, speed and agility",
      "Generating blades   (As Sword Master)",
      "Expert swordsmanship (As Sword Master)"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Iron+Fist%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "50.73%",
    "wr_change": "+1.30%",
    "pick_rate": "11.49%",
    "pr_change": "+5.43%",
    "ban_rate": "24.14%",
    "matches": "171,207"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}