{
  "name": "Jeff the Land Shark",
  "role": "Strategist",
  "stats": {
    "health": 250,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#5EEAD4",
    "color_theme_secondary": "#7DD3FC"
  },
  "abilities": [
    {
      "name": "JOYFUL SPLASH",
      "keybind": "LMB",
      "type": null,
      "description": "Unleash a healing splash.",
      "casting": "Rapid-fire, delayed projectile",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": "20/s",
      "ammo": 100,
      "critical_hit": null,
      "cooldown": null,
      "range": "infinite",
      "projectile_speed": "100m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "Healing": "150/s"
      }
    },
    {
      "name": "AQUA BURST",
      "keybind": "RMB",
      "type": null,
      "description": "Launch a high-speed water sphere that bursts upon impact, dealing damage to enemies within range.",
      "casting": "Single-cast projectile with delayed impact that also generates a spell field",
      "damage": 25,
      "damage_falloff": "Falloff begins at 1m, decreasing to 50% at 3m (projectile damage has no falloff)",
      "fire_rate_interval": "1.75/s",
      "ammo": 12,
      "critical_hit": false,
      "cooldown": null,
      "range": "3m spherical radius",
      "projectile_speed": "100m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "The projectile creates a spell field that deals area-of-effect damage when hitting an enemy or a surface. SPELL FIELD DAMAGE - 40"
    },
    {
      "name": "HIDE AND SEEK",
      "keybind": "SHIFT",
      "type": null,
      "description": "Dive into the scene with only his dorsal fin exposed, granting himself a Movement Boost. Jeff can heal while submerged and gains the wall-crawl ability.",
      "casting": "Instant Cast",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "60%",
      "energy_cost_details": null,
      "details": "During the dive, gain Unstoppable, healing over time (35/s), and a Movement Boost, while Jeff's hitbox is reduced. Jeff cannot capture objectives while in Hide and Seek."
    },
    {
      "name": "HEALING BUBBLE",
      "keybind": "E",
      "type": null,
      "description": "Spit a bubble that heals the ally who collects it, granting them Healing Boost and Movement Boost while also launching up nearby enemies.",
      "casting": "Summons",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "6s per charge",
      "range": null,
      "projectile_speed": null,
      "charges": 6,
      "duration": "180s",
      "movement_boost": "60%",
      "energy_cost_details": null,
      "details": "Touching the bubble will immediately activate its effect and will knock back nearby enemies. HEALING - 85, HEALING BOOST - 15% for 4s. Up to 5 bubbles can be placed on the map at once."
    },
    {
      "name": "FROZEN SPITBALL",
      "keybind": "X",
      "type": null,
      "description": "Luna Snow infuses ice energy into Namor and Jeff the Land Shark, who then can tap into the ice energy to power up abilities at will.",
      "casting": "Single-cast projectile with delayed impact that also generates a spell field",
      "damage": 30,
      "damage_falloff": null,
      "fire_rate_interval": "1.75/s",
      "ammo": 12,
      "critical_hit": false,
      "cooldown": null,
      "range": "5m spherical radius",
      "projectile_speed": "100m/s",
      "charges": null,
      "duration": "3s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Aqua Burst will be replaced by Frozen Spitball. When Frozen Spitball hits an enemy or the environment, it will create an area that slows down enemies. Enemies within this area will experience a slowing effect. SPELL FIELD DAMAGE - 40"
    },
    {
      "name": "NEW FRIENDS",
      "keybind": "C",
      "type": null,
      "description": "Jeff the Land Shark and Rocket Raccoon can ride on Groot's shoulders, receiving Damage Reduction.",
      "casting": "Targeted",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "12m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "DAMAGE REDUCTION - 35%"
    }
  ],
  "ultimate": {
    "name": "IT'S JEFF!",
    "keybind": "Q",
    "type": null,
    "description": "Deep dive into the scene and resurface to swallow both enemies and allies within range, activating Hide and Seek for a brief duration before ejecting the swallowed heroes forward.",
    "casting": "Targeted",
    "damage": "25/s",
    "range": "10m radius, 5m high cylindrical spell field",
    "effect": "After swallowing allies and enemies, Jeff will deal damage to enemies and heal allies for the duration of the effect, during which they will also benefit from Hide and Seek",
    "duration": "6s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 4000,
    "details": "When first activated, Jeff vanishes from the battlefield and the player has 6 seconds to choose where he will attack. After eating the enemies and/or allies, Jeff is automatically put in his Hide and Seek, and can move around for 6 seconds. After this duration has passed, he'll automatically spit anyone he swallowed. Players can manually spit enemies and allies earlier and separately with different inputs. If Jeff falls off a ledge before spitting out, both him and anyone he swallowed will also be taken down with him. This ability grants Jeff one of the most powerful crowd-controls in the game, and allows him to single-handedly change the course of matches when capturing objectives."
  },
  "passives": [
    {
      "name": "OBLIVIOUS CUTENESS",
      "keybind": null,
      "type": null,
      "description": "Reduce damage taken from critical hits.",
      "cooldown": null,
      "damage": null,
      "range": null,
      "trigger_condition": null,
      "effect_boost": null,
      "speed_details": null,
      "details": "CRITICAL DAMAGE REDUCTION - 50%"
    }
  ],
  "teamups": [
    {
      "name": "Chilling Charisma",
      "partner": [
        "Luna_Snow"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": "10s",
      "cooldown": "30s",
      "range_target": "5m spherical radius",
      "special_notes": "Ability: Frozen Spitball",
      "details": "Casting: Single-cast projectile with delayed impact that also generates a spell field<br/>Special Effect: Aqua Burst will be replaced by Frozen Spitball. When Frozen Spitball hits an enemy or the environment, it will create an area that slows down enemies. Enemies within this area will experience a slowing effect<br/>Damage: Projectile Damage: 30; Spell Field Damage: 40<br/>Slow Rate: 15%<br/>Slow Duration: 3s<br/>Damage Falloff: No falloff<br/>Projectile Speed: 100m/s<br/>Fire Rate: 1.75 rounds per second<br/>Ammo: 12<br/>Critical Hit: No"
    },
    {
      "name": "Planet X Pals",
      "partner": [
        "Groot",
        "Rocket_Raccoon"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": null,
      "cooldown": null,
      "range_target": "Up to 12m",
      "special_notes": "Ability: New Friends",
      "details": "Casting: Targeted<br/>Damage Reduction: 35%<br/>Special Effect: Pressing SHIFT will exit the Team-Up status with Groot"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Jeff the Land Shark is a premier healing Strategist, boasting the highest and most consistent healing output in the game. His primary, <b>Joyful Splash (LMB)</b>, is a continuous stream of healing water. <b>Healing Bubbles (E)</b> provide burst heal, speed/heal received boosts, and launch nearby enemies. For mobility and survival, <b>Hide and Seek (Shift)</b> allows him to dive underground, becoming mostly immune, healing himself, moving faster, and climbing walls. While <b>Aqua Burst (RMB)</b> deals damage, Jeff's focus should overwhelmingly be on healing.</p>\n<p>Position Jeff close to his team, especially Vanguards and damage dealers, for consistent healing. Place <b>Healing Bubbles</b> near combat but not on fully healed allies to allow access when needed. Use <b>Hide and Seek</b> primarily for repositioning to maintain healing range, escaping danger, and self-healing, rather than pure offense. His ultimate, <b>It's Jeff! (Q)</b>, lets him dive, resurface to swallow allies (massive heal) and enemies (DoT), then spit them out. Use this defensively to save key allies from enemy ultimates or offensively to disrupt pushes by removing critical targets.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Enhanced Healing Combo:</u></b><br>Shoot a <b>Healing Bubble (E)</b> at a critically wounded ally → Immediately follow with sustained healing from <b>Joyful Splash (LMB)</b>. The bubble provides burst health and a healing boost, making Joyful Splash more effective.<br><br></li>\n  <li><b><u>Surprise Attack/Reposition:</u></b><br>Use <b>Hide and Seek (Shift)</b> for quick, unpredictable repositioning → Emerge from underground or off a wall to surprise enemies with a burst of damage from <b>Aqua Burst (RMB)</b> if an opportunity arises.<br><br></li>\n  <li><b><u>Ultimate Save/Disrupt:</u></b><br>Strategically use <b>It's Jeff! (Q)</b> to swallow a teammate targeted by a high-damage enemy ultimate, removing them from danger and healing them. Offensively, swallow key enemies to disrupt their formation or spit them into hazards.<br><br></li>\n  <li><b><u>Reload Cancel Tech (Advanced):</u></b><br>During the reload animation (after ammo depletion for Joyful Splash/Aqua Burst), immediately submerge using <b>Hide and Seek (Shift)</b> as soon as you hear the audio cue of Jeff swallowing the fish. This can shorten the reload downtime.<br><br></li>\n  <li><b><u>Healing Bubble Utility:</u></b><br>Remember bubbles also grant allies a temporary movement speed increase and launch nearby enemies, offering minor disruption and escape aid.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Compositions reliant on high damage needing consistent healing (e.g., multiple Duelists, aggressive Vanguards). Opponents using burst damage (his rapid healing can often counteract). Effective on maps with narrow corridors/chokepoints (Joyful Splash hits multiple allies). Can counter impactful enemy support ultimates by swallowing key allies with his own ultimate.<br><br></li>\n  <li><b>Challenging Against:</b> Extreme burst damage heroes (e.g., <u>Hela</u>, <u>Magik</u>) who can kill teammates before healing reacts. Strong crowd control that can interrupt his healing or ultimate. Coordinated focus fire (large head hitbox). <u>Neymar</u> (with <u>Luna Snow</u> team-up granting Ice Squid). <u>Cloak and Dagger</u> (Cloak's Dark Teleportation can prevent allies from being swallowed by Jeff's ultimate).<br><br></li>\n  <li><b>Key Synergies:</b> Team-Up with <u>Luna Snow</u> (grants Frozen Spitball ability, replacing Aqua Burst with a slow) and with <u>Groot</u> (Jeff can ride Groot's shoulders for damage reduction, E bubbles instantly pop healing both). Fits well in almost any team due to strong healing.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Unparalleled Healing Output:</b> Highest and most consistent healing in the game via <b>Joyful Splash (LMB)</b>.</li>\n  <li><b>Excellent Tank Support:</b> Enables high-health tanks to withstand immense damage.</li>\n  <li><b>Versatile Healing Bubbles (E):</b> Provide burst heal, movement/healing buffs, and enemy knock-up.</li>\n  <li><b>High Survivability & Stall:</b> <b>Hide and Seek (Shift)</b> grants self-heal, speed, near-invulnerability, and wall climb.</li>\n  <li><b>Impactful Ultimate (It's Jeff! - Q):</b> Offers defensive saves (swallowing allies) and offensive disruption (swallowing enemies).</li>\n  <li><b>Beginner-Friendly:</b> Relatively easy to pick up and play effectively.</li>\n  <li><b>Critical Hit Damage Reduction:</b> Passive (Oblivious Cuteness) reduces damage from crits by 50%.</li>\n  <li><b>Strong Team-Up Abilities:</b> Synergies with <u>Luna Snow</u> and <u>Groot</u> add significant utility.</li>\n</ul>",
    "weaknesses": [
      "While Jeff's passive decreases his damage taken from headshots, he has a very large hurtbox, especially his head, which makes it easy to deal critical hits to him. Additionally, even with the damage reduction he can still be easily taken down by enemies with high burst damage, such as Hawkeye and Hela.",
      "Despite his high healing output, Jeff can struggle to heal when the team spreads out.",
      "Joyful Splash can be difficult to aim at heroes with high mobility such as Spider-Man and Venom.",
      "Aqua Burst cannot deal critical hits.",
      "Jeff cannot capture objectives while in Hide and Seek.",
      "Jeff can put himself in dangerous situations if he misses his Ultimate, allowing the enemy team to retaliate.",
      "Peni Parker can directly counter Jeff's Ultimate directly if he uses it while inside the area of her Bionic Spider-Nest, which will result in all the nearby Arachno Mines swarming Jeff, likely taking him out.",
      "Abilities that provide invulnerability and/or immunity to crowd control can completely negate Jeff's Ultimate, such as Cloak's Dark Teleportation, Punisher's Culling Turret and Final Judgement, Star-Lord's Stellar Shift, among others.",
      "Hoping on Groot's shoulders can leave Jeff vulnerable, as Groot usually fights in the frontlines. Even with the damage reduction, he can still be focused and taken down easily, or be plucked off Groot with abilities that pull him towards enemies."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Wanna Make a Snow Shark?",
        "description": "As Jeff the Land Shark, partner with Luna Snow to land 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Snack Attack!",
        "description": "As Jeff the Land Shark, swallow 4 enemies with a single use of It's Jeff!",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Mmmm...\"",
    "ingame_bio_text": "Most landsharks are vicious creatures of the deep... but not Jeff! This adorable and mischievous little landshark brings splashes of joy and healing to every battle. But if the tide turns, Jeff can morph into a voracious beast, swallowing an army of foes in one giant gulp!",
    "ingame_story_intro": "What's more huggable than a puppy, but hungrier than a great white? It's Jeff! This baby landshark may be one of the most unusual and adorable creatures to ever waddle his way out of the ocean. But anyone who's crossed Jeff's path can tell you that behind his sweet little bark is one nasty bite!\nAfter getting captured and displayed as a curiosity at the Collector's Theme Park, Jeff broke free when the Timestream Entanglement scrambled reality. Now's his chance to prove he's a hero, one chomp at a time!",
    "hero_stories": [
      {
        "title": "Sharknado",
        "content": "As Jeff the Land Shark swam another lap around his small glass enclosure, frustration finally began to settle in. He had tried so hard to stay his usual optimistic self, even after he lost track of how long he had been held captive here inside this strange Theme Park created by the enigmatic Elder of the Universe known as the Collector.\nJeff didn't really know how he got here in the first place. One second, he was frolicking in the endless waves lapping at the California coast with his BFF Gwen. The next, he was here, trapped within a tiny tank that he couldn't seem to chomp his way out of, no matter how wide he opened his powerful, little jaws.\nBut since his unexpected arrival, Jeff had pieced together why he was here. Surrounding his own enclosure were countless other holding cells, each containing unique specimens of lifeforms he had never seen before. Some almost looked like the human friends he had made back home, but others were so bizarre and alien that they couldn't possibly have lived on the land or beneath the waves of his native world. Jeff had visited a zoo before with another of his friends, the archer called Kate. And now, he thought that he was probably in one — just another exhibit on display in an intergalactic menagerie on the edge of the known universe.\nJeff didn't love being confined in his tank, but he had taken some comfort in the fact that he wasn't here alone. And while none of the other creatures around him seemed to be fluent in landshark, there was one fellow captive whose thoughts Jeff could hear in his own head. She said her name was Mantis and that she was a friend. And if there's one thing that Jeff loved — other than devouring everything in his path — it was new friends!\nBut one thing that Jeff hated was when those friends were in trouble... which brings us back to why Jeff had suddenly lost his cheerful demeanor in the first place. Jeff had felt Mantis's psionic scream as she was removed from her cell and dragged away. He had heard the guards talking about taking her to some sort of arena where the Collector's prisoners were forced to fight for their lives against multi-dimensional variants of themselves. Jeff had no idea what any of that meant. But he did know that Mantis was in trouble. He couldn't hear her voice in his head anymore. He couldn't feel her calming presence. He couldn't see where she was or if she was safe. And that made Jeff mad!\nJeff began to swim frenzied circles in his tank, increasing his speed by swishing his tail and paddling his tiny legs as fast as he could. When he had built up enough momentum, he propelled himself toward the wall that separated him from freedom. But the only result was sharp pain as his sweet little face smooshed against the crystal clear wall. Not even the slightest chip or crack could be seen in the glass... though a few may have been left behind in his teeth. It was clear that Jeff would need another plan if he wanted to escape.\nAs he floated there, dazed from the impact, Jeff wondered what his friends back home would do if they were in his situation. Kate would probably use an explosive arrow. Gwen would find an unexpected way to break through a wall (probably the fourth one). Elsa would have hidden some ancient enchanted blade in her ponytail to slice through the impenetrable glass. And Wade would simply sweet talk the guards into letting him out, winning their favor with false promises of money and tacos. None of those options would work for Jeff. He was stuck here, and the thoughts of his lost friends — including Mantis — left him feeling more and more alone with every second that passed.\nBut then he sensed it. A familiar tingle in his brain. Mantis was alive! And she was coming back... for him! Jeff couldn't help but grin as his friend approached, flashing several rows of serrated teeth in her direction. This was the first time he had seen Mantis in person, but while he may not have known her face, he immediately recognized her mind. Now that mind was clearly focused on one thing only — escaping from captivity once and for all.\n\"MMMRRRRR!!!!\"\n\"He's going to draw the guards,\"\nanother voice\nsaid.\nIn all his excitement, Jeff hadn't even noticed that Mantis was not alone. She had another humanoid with her, this one far more dark and brooding in demeanor. She did not look nearly as happy to see Jeff as Mantis did. And, to be honest, Jeff wasn't convinced that he liked her much either.\n\"Mrrr?\" Jeff grunted quizzically, noticing the way the second woman was looking at him. He felt as though she was sizing him up, preparing to strike him down the second there was no longer any glass between them.\n\"Don't mind her,\" Mantis said as she started to activate the release mechanism on the side of Jeff's enclosure. \"She wants to get out of here as badly as we do. And she knows the only way we can make that happen is if we work together.\"\nJeff smiled at Mantis, and she smiled back. Despite the fact that they were attempting to break out of the Collector's exhibition, with no real idea how to escape or where they would go if they did get free, there was something about this humanoid that made Jeff feel like everything was going to be all right. And it was clear he had the same effect on her.\nMantis continued to fiddle with the latch on Jeff's tank just as a squadron of armed guards came into view. As the guards shouted something in an alien language, Jeff could sense that Mantis was already reaching out with her mind in hopes of diverting them. But as quick as Mantis's thoughts were, somehow their new friend managed to get to the Collector's crew first. Her blades flashed in a glittering dance, and in seconds, the guards were down for the count. Jeff couldn't have been more impressed.\n\"Mrrr,\" Jeff said, trying to express his appreciation to the purple-haired warrior. Her cold gaze never softened. Jeff could sense that her mind was powerful, just like Mantis's, but her thoughts and emotions were heavily guarded. Jeff wanted his newest friend to like him as much as Mantis did, but for now he would simply have to accept that she no longer seemed to want to kill him or leave him behind.\nMantis finally managed to swing open the door of Jeff's tank, releasing a flood of water into the hallway. Jeff emerged from the miniature wave it created, propping himself up on his stubby legs and giving his body a quick shake to expel the excess moisture from his skin. Mantis laughed with pure delight as a deluge of droplets rained down on her. The other woman was not nearly as amused.\n\"Let's go,\" Mantis said, beckoning to her unlikely pair of partners. She began to run through the Collector's menagerie with a determination that made Jeff believe she knew where she was going. The warrior woman stayed close at Mantis's side, so Jeff felt the best thing to do was bound along right behind them.\nAs Mantis and her companion forged ahead, Jeff suddenly found himself distracted by an unusual smell. It was unlike anything he had ever encountered before, either on land or in the sea. It smelled delicious... and powerful...\nBefore he realized what he was doing, Jeff had veered off from his companions, entering the Collector's private gallery. Here, the Elder of the Universe had gathered some of the most powerful items and artifacts in all of existence and was displaying them for his wealthiest patrons to gaze upon. Jeff didn't know what any of these strange things were. Not the six colorful stones, nor the glowing cube, nor the otherworldly crimson gem, nor the flaming demonic scroll. But he did know one thing. He hadn't eaten in a very long time...\nJeff's instincts took control. He opened his tiny jaws wide and started to swallow down almost everything in the gallery as quickly as he could. Alarms began to blare, but it didn't stop Jeff from consuming one object of power after another!\n\"There you are, Jeff!\" Mantis cried as she and her mysterious ally entered the now-empty gallery. \"We thought we had lost you. Are you... okay...?\"\n\"Mrrr...URP!\" Jeff belched in response. His tiny tummy had started to rumble after he had gulped down a little metal vial marked PYM.\nAs Jeff blushed with embarrassment, Mantis chuckled. Even the steel-willed stranger couldn't help but smirk. But all levity instantly faded as another group of guards arrived in the gallery.\n\"Tivan is going to have our heads!\" one guard shouted, as he realized that all of the artifacts in the private gallery had somehow vanished.\n\"Not if we bring him theirs first,\" another guard responded, aiming his weapon directly at Mantis and pulling the trigger.\n\"MRRRRR!\"\nWithout a second of hesitation, Jeff leapt between the guard and Mantis, instinctively shielding his friend from the oncoming blast. But as he intercepted the attack, something extraordinary happened. Jeff grew to ten times his regular size!\n\"Hmm,\" mused the warrior woman. \"Must've been something he ate...\"\nThe enlarged Jeff let out a delighted squeal as he charged toward the guards, all of whom dropped their weapons and retreated as swiftly as possible.\nAs soon as they were in the clear, Jeff beckoned Mantis and her friend to follow him.\n\"That's not the right way, friend,\" Mantis said. \"We found the hangar. It's in the other direction. That hall will just lead you back to your cell.\"\n\"Mrrr,\" Jeff said confidently, fully aware of what he was doing.\n\"Oh, I see,\" Mantis said with a smile. \"Good boy, Jeff.\"\nThe women raced after the giant Jeff, back into the heart of the menagerie.\n\"Stand back, everyone,\" Mantis cried out directly into the minds of all the captive creatures.\nAs the alien assemblage took cover within their cells, the massive land shark gave a mighty twirl, swinging his tail with tremendous force and shattering through the outer glass walls of countless enclosures. The lifeforms once trapped within suddenly emerged from holding and scattered in all directions, each seeking their own way out of the Collector's custody.\n\"Mrrr?\" Jeff asked as he began to shrink back down to his normal size.\n\"I know, Jeff,\" Mantis responded. \"But we don't have time to save them all. At least not yet.\"\n\"Come on,\" their curious companion said, leading Jeff and Mantis through the chaos and back toward the hangar. \"This may be our only chance.\"\nTogether, they entered the hangar, and Mantis located a spacecraft similar to the one she had flown during her time with the Guardians of the Galaxy. Relief washed over her as she led her new teammates onto the ship and powered it up.\n\"We're finally free,\" the other woman said with relief. \"We can go home now...\"\nBut the stoic warrior paused. She didn't need Mantis's empathic abilities to sense the sadness radiating through Jeff's mind as he looked back toward the creatures rampaging through the Theme Park below them.\n\"And they will be free, too,\" Mantis said reassuringly, placing a hand on Jeff's smooth fin and giving it a gentle rub. \"We will find help and come back for them. We will free every single one of them. And we will make sure the Collector pays for what he has done. How does that sound, little one?\"\nAs the ship lifted off, Jeff responded as only he could. With a toothy grin and an emphatic:\n\"MMMRRRRRR!!!\"",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Jeff the Land Shark was added as the 22nd character to be introduced to Marvel Rivals as a Strategist hero.",
          "Added 2 new costumes: Adopted Avenger and Incognito Dolphin.",
          "Added the Snack Attack! achievement.",
          "Added to the Chilling Charisma Team-Up Ability with Luna Snow and Namor and the Planet X Pals Team-Up Ability with Groot and Rocket Raccoon."
        ]
      },
      {
        "date_version": "24/12/10: Version 20241210",
        "changes": [
          "After Jeff the Land Shark was revived while in the fog, his teammates and enemies would not be able to see the special effects of Joyful Splash. This issue has been resolved.",
          "When the target area is ascending or descending, if Jeff the Land Shark used his Ultimate to devour characters, they would potentially become stuck beneath the terrain if they were right on the target area platform. This issue has been resolved."
        ]
      },
      {
        "date_version": "24/12/19: Version 20241219 / Winter Celebration Event",
        "changes": [
          "Added 1 new costume: Cuddly Fuzzlefin (unlocked from Winter Celebration event)"
        ]
      },
      {
        "date_version": "25/01/08",
        "changes": [
          "Fixed occasional sound irregularities that could occur after being consumed by the Jeff the Land Shark's ultimate ability."
        ]
      },
      {
        "date_version": "25/01/10: Version 20250110 / Season 1: Eternal Night Falls Launch",
        "changes": [
          "Adjust It's Jeff! range from a 10m sphere to a 10m radius, 5m high cylindrical spell field.",
          "Increase the healing of Joyful Splash from 140/s to 150/s."
        ]
      },
      {
        "date_version": "25/02/07: Version 20250207",
        "changes": [
          "Fixed an issue where if Jeff the Land Shark spit out others just as his Ultimate Ability was about to end, it would be interrupted and automatically spit them out when the ultimate ended, causing it to look like the animation played twice. He'll now eject everyone in one smooth motion!"
        ]
      },
      {
        "date_version": "25/02/14: Version 20250214",
        "changes": [
          "Resolved a quirky situation where Jeff's bubbles could, in rare instances, sneak past enemy healing gates into the spawn room. No more bubble bath break-ins!"
        ]
      },
      {
        "date_version": "25/03/07: Version 20250307 / Galacta's Cosmic Adventure Event",
        "changes": [
          "Corrected a bug where when the Team-Up Ability is active, Jeff the Land Shark could launch Frozen Spitballs that exceed expectations via certain actions. The aquatic cutie's attacks are now as intended!"
        ]
      }
    ],
    "official_quote": "\"Mrrrr... [growling]\"",
    "official_description": "Jeff the Land Shark is a Strategist hero in Marvel Rivals, and is the 22nd hero introduced to the game's roster. He has team-up abilities that work in conjunction with Luna Snow, Groot, and Rocket Raccoon."
  },
  "background": {
    "real_name": "Jeffrey the First of His Name of the Former Staten Island",
    "aliases": [
      "Jeff the Baby Land Shark"
    ],
    "birthplace": "A.I.M. base, Pacific Ocean",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Black",
    "hair_color": null,
    "relatives": [
      "Gwen Poole",
      "Kate Bishop"
    ],
    "affiliation": [
      "West Coast Avengers"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Water manipulation",
      "Size-shifting via Pym Particles",
      "Shark physiology"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Jeff+the+Land+Shark%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "D",
    "win_rate": "41.91%",
    "wr_change": "-1.56%",
    "pick_rate": "12.33%",
    "pr_change": "-0.43%",
    "ban_rate": "0.39%",
    "matches": "183,617"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}