{
  "name": "Loki",
  "role": "Strategist",
  "stats": {
    "health": 250,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#BEF264",
    "color_theme_secondary": "#16A34A"
  },
  "abilities": [
    {
      "name": "MYSTICAL MISSILE",
      "keybind": null,
      "type": "Single-cast projectile with delayed impact that also generates a spell field",
      "description": "Fire Mystical Missiles to heal allies or deal damage to enemies",
      "casting": null,
      "damage": "The projectile deals no damage, while the spell field inflicts 30 damage per cast",
      "damage_falloff": "Falloff begins at 0.5m, decreasing to 50% at 2.5m",
      "fire_rate_interval": "1.75/s",
      "ammo": 12,
      "critical_hit": false,
      "cooldown": null,
      "range": "3m spherical radius",
      "projectile_speed": "100m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "The projectile does not provide healing, but the spell field provides 40 Health per cast"
    },
    {
      "name": "REGENERATION DOMAIN",
      "keybind": "SHIFT",
      "type": "Release a spell field at the location of Loki and the Illusion",
      "description": "Use Rune Stones to create a magical field that provides allies Healing and converts incoming damage into further healing.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "30s",
      "range": "A cylindrical spell field with a radius of 5m and a height of 2m",
      "projectile_speed": null,
      "charges": null,
      "duration": "5s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "The spell field is sustained by Rune Stones. It will disappear if the Rune Stone is destroyed or if its maximum duration is reached. Allies within the field will receive healing over time, and any damage taken will be converted into healing based on the amount of damage taken. HEALING - 100/s ABILITY HEALTH - 100 CONVERSION RATE - 30%"
    },
    {
      "name": "DOPPELGANGER",
      "keybind": "E",
      "type": "Targeted",
      "description": "Project an Illusion that can cast some of Loki's abilities.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "12s per charge",
      "range": null,
      "projectile_speed": null,
      "charges": 2,
      "duration": "60 seconds",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "MAXIMUM DISTANCE - 30m"
    },
    {
      "name": "DEVIOUS EXCHANGE",
      "keybind": "F",
      "type": "Targeted",
      "description": "Swap with the selected Illusion.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "MAXIMUM DISTANCE - 30m"
    },
    {
      "name": "BACKSTAB",
      "keybind": "V",
      "type": "Single-cast Spell Field",
      "description": "Pull out a dagger to stab enemies, dealing extra damage when attacking an enemy from behind",
      "casting": null,
      "damage": "30 (Melee) - 45 (Backstab)",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "3m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "DECEPTION",
      "keybind": null,
      "type": "Instant Cast",
      "description": "Become Invisible and conjure an Illusion to deceive enemies.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Loki leaves an illusion in his place and becomes invisible while continuously healing himself. This invisibility has no time limit, but any actions other than casting Devious Exchange, reloading, or casting Doppelganger will render him visible. HEALING - 20/s whilst invisible"
    }
  ],
  "ultimate": {
    "name": "GOD OF MISCHIEF",
    "keybind": "Q",
    "type": "Targeted",
    "description": "Shapeshift into a targeted ally or enemy hero and use all their abilities except any of their Team-Up Abilities.",
    "casting": null,
    "damage": null,
    "range": null,
    "effect": "After transforming, Loki's Ultimate ability will be fully charged. Casting a transformation-type Ultimate ability will extend the duration of Devious Exchange until the transformation ability ends.",
    "duration": "15s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 4000,
    "details": null
  },
  "passives": [
    {
      "name": "LAUFEYSON REBORN",
      "keybind": null,
      "type": "PASSIVE",
      "description": "When Hela lands a final hit in defeating an enemy, she can instantly resurrect Loki and Thor in the respawn phase, or grant them bonus health if they are still alive.",
      "cooldown": null,
      "damage": null,
      "range": null,
      "trigger_condition": "Hela's final hit on an enemy",
      "effect_boost": null,
      "speed_details": null,
      "details": "BONUS HEALTH - 50 ABILITY DELAY - 1.5s"
    }
  ],
  "teamups": [
    {
      "name": "Ragnarok Rebirth",
      "partner": [
        "Hela",
        "Thor"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": null,
      "cooldown": null,
      "range_target": "Up to 100m",
      "special_notes": "Ability: Laufeyson Reborn",
      "details": "Bonus Health: 50; can stack twice, max 100<br/>Resurrection Delay: 1.5s<br/>Resurrection Health Percentage: 90%<br/>Special Effect: Resurrection occurs wherever Loki was defeated; cannot be resurrected if KO'd off the map"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Loki, the God of Mischief, is an intricate strategist excelling through illusions, deception, and shapeshifting. His <b>Mystical Missile (LMB)</b> heals allies on hit and deals splash damage to nearby enemies. <b>Regeneration Domain (Shift)</b> places a rune healing allies and converting some incoming damage to more healing (long cooldown). <b>Doppelganger (E)</b> projects up to two immobile illusions that mimic his attacks and place additional Regeneration Domains. <b>Devious Exchange (F)</b> lets him swap positions with illusions, even through walls. <b>Deception (RMB)</b> grants invisibility (no time limit, breaks on attack/damage), leaving an illusion and providing self-heal.</p>\n<p>Loki's positioning is flexible, using illusions for map control, diversions, and off-angles. Meticulous cooldown management (especially Regeneration Domain - 30s, and Doppelganger) is key. Use <b>Deception</b> for scouting, safe repositioning, and self-healing. His ultimate, <b>God of Mischief (Q)</b>, allows him to shapeshift into any targeted hero, gaining their full kit including a fully charged ultimate. Use this to counter enemy ultimates (e.g., transform into a defensive support) or bolster a push (e.g., transform into high-damage ally). Aim Mystical Missiles carefully; due to slow projectile speed, aim at the ground near enemies for splash damage.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Illusion Pressure & Support:</u></b><br>Place <b>Doppelganger (E)</b> illusions on opposite sides of your own position. This creates multiple angles for healing allies and dealing damage to enemies with <b>Mystical Missile (LMB)</b>.<br><br></li>\n  <li><b><u>Invisible Surprise Attack:</u></b><br>Use <b>Deception (RMB)</b> to turn invisible and reposition to an advantageous spot → Immediately deploy two <b>Doppelganger (E)</b> illusions to launch a surprise attack or establish a healing/damage zone.<br><br></li>\n  <li><b><u>Enhanced Regeneration Domain:</u></b><br>Activate <b>Regeneration Domain (Shift)</b> while you have active <b>Doppelganger (E)</b> illusions. Each illusion will also deploy a rune stone, significantly increasing the AoE of the healing and damage conversion effect.<br><br></li>\n  <li><b><u>Ultimate Counter/Playmaking (God of Mischief - Q):</u></b><br>Strategically transform into an enemy or ally. Examples: Transform into a healer like <u>Luna Snow</u> or <u>Mantis</u> to use their healing ultimate to save your team; transform into a hero with a strong defensive ultimate to counter an enemy push.<br><br></li>\n  <li><b><u>Devious Exchange (F) Mobility:</u></b><br>Use this to escape danger by swapping with a distant illusion (even through walls) or to instantly reposition for an offensive play or better support angle.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Dive-heavy compositions (illusions create space, Devious Exchange for escape). Brawl compositions (Mystical Missile splash damage). Certain ultimates (e.g., from <u>Psylocke</u>, <u>Iron Fist</u>, <u>Magik</u>) can be countered by Regeneration Domain. Slow, large targets (easier to hit with Mystical Missile). Teams that don't focus illusions.<br><br></li>\n  <li><b>Challenging Against:</b> Heroes who easily clear illusions (e.g., <u>Iron Man's</u> AoE, <u>Scarlet Witch's</u> wide attacks). Melee heroes who can close distance quickly (e.g., <u>Iron Fist</u>, <u>Spider-Man</u>). <u>Namor's</u> turrets (quickly destroy illusions). Teams with good communication and focus fire. Strong tracking abilities that can identify the real Loki.<br><br></li>\n  <li><b>Key Synergies:</b> The <b>Laufeyson Reborn</b> Team-Up with <u>Hela</u> can grant bonus health or resurrection. Works well with teams that can capitalize on the chaos and misdirection his illusions create.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Remarkable Versatility:</b> Effective against both dive and brawl compositions due to illusions and adaptive ultimate.</li>\n  <li><b>High Healing Potential (with aim):</b> <b>Mystical Missile (LMB)</b>, amplified by illusions, can provide significant healing.</li>\n  <li><b>Illusion Pressure & Support:</b> Doppelgangers provide healing/damage from multiple angles and can deploy extra Regeneration Domains.</li>\n  <li><b>Ultimate Counter (Regeneration Domain):</b> Can provide near-invincibility against many enemy ultimates.</li>\n  <li><b>Excellent Evasion & Mobility:</b> <b>Deception (RMB)</b> for invisibility/self-heal and <b>Devious Exchange (F)</b> for instant repositioning.</li>\n  <li><b>Unparalleled Ultimate Adaptability:</b> <b>God of Mischief (Q)</b> allows access to any hero's kit, including a full ultimate.</li>\n  <li><b>Map Control via Illusions:</b> Can create diversions and control sightlines.</li>\n  <li><b>Team-Up Resilience:</b> Synergy with <u>Hela</u> offers increased survivability.</li>\n</ul>",
    "weaknesses": [
      "Requires high skill to play efficiently.",
      "Has low healing output if his illusions and Regeneration Domain are not available.",
      "Very vulnerable if his Devious Exchange and Regeneration Domain is on cooldown.",
      "Mystical Missile cannot deal critical hit.",
      "Backstab has a low range and is very situational."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Brotherly Love",
        "description": "As Loki, assist Thor in landing 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "God of Treachery",
        "description": "As Loki, land one KO by stabbing from behind.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"I am Loki. God of mischief and the king of Asgard.\"",
    "ingame_bio_text": "Born the son of Laufey, king of the Frost Giants, Loki was adopted by Odin and raised as a prince of Asgard. But his true nature could not be undone, and Loki would come to fully embrace his role as the God of Mischief. With his father deep in the Odinsleep, Loki seized his chance to take the throne for himself. After enlisting Hela in his plot and hurling his brother Thor into a distant timeline, Loki now harvests Chronovium sap from the World Tree, Yggdrasill, in an effort to conquer the entire timestream.",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Destined Kingship",
        "content": "In the immediate aftermath of the reckless mortals' clumsy scrambling of timelines, Loki noticed something quite curious. The sap bleeding from Yggdrasill had a new, particularly magical essence. He began to experiment with it. Shape it. Concentrate and intensify it. Time, he discovered, was the core of its essence, and right away, he conceived an intense desire to visit a future Asgard to see what mischief he might make there. Quickly, he learned how to do just that, but he came away not only disappointed but frightened and-not that he ever would have admitted it- saddened. For the future Asgard he beheld was a ruin, its throne broken and cast down, its collections looted, its surviving people grubbing in the ruins to survive. No, Loki thought. Surely this is not Asgard's only future. He brewed the enchantment once more...and discovered an Asgard overrun by Jotun, with Laufey himself grunting on the throne and Asgard's people little more than bones. And another Asgard in flames, with Surtur bestride the blazing trunk of Yggdrasill while the fabled towers of the realm collapsed in fiery rubble. And another, windswept and empty, the Cask of Eternal Winters broken open in the throne room. And another, shattered into drifting fragments against a sea of stars. And another, impossibly sunk under an ocean, with vast shadows moving in the moonlit waters above. Hundreds more, thousands more. Asgards burned, Asgards frozen, Asgards overrun by Dark Elves or dwarves or enemies from Midgard or the worlds beyond the stars. A Kree- devastated Asgard, an Asgard ravaged by the Eternals, an Asgard ruled by an alien overlord whose minions oozed and sprang like living shadows, hunting down the last of the realm's true subjects. In all of these, Loki did not find the one thing for which he truly searched. Himself. And then, at last, an Asgard mighty and unbroken. An Asgard overarched by Yggdrasill's branches and underpinned by Yggdrasill's roots. Her towers shining, her people vibrant and untroubled, her wealth untouched...and her throne occupied by Loki. He reeled back into his own time, mind aflame with the implications of what he had seen. How many destroyed Asgards had he witnessed? After all that, to see the one surviving realm be ruled by himself… Well, Loki thought. The only Asgard that survives this absurd misadventure is one in which my true destiny is at last acknowledged, my primacy accepted, my sovereignty celebrated. As it should be. Now remains the work of bringing this future to pass. Immediately the crucial points of the plan presented themselves to him. First, or course, he would have to maneuver the All-Father into the deep enchanted slumber of Odinsleep. Tricky, but he had done it before. The biggest obstacle was making sure that Heimdall didn't notice until it was too late. Then, Loki would use Thor's desire to help their father against him, guiding him into a certain place where Loki wouldn't have to worry about him for a long time. But these were powerful enchantments, even for Loki. He was going to need to bring in a co-conspirator or two. It would be easy enough to betray them and rid himself of them later, but for a brief time they would be useful. Karnilla, of course. Aligning with the Norns was an absolute necessity if he were to retain rule over Asgard and not see it suffer any of the tragic fates he had witnessed. And while a master of magic, the Queen of the Norns was no great schemer – at least not compared to the God of Lies. He also thought of Karnilla's closest ally, Hela. She was family, after all, and these kinds of things should be kept in the family whenever possible. Also, she would be useful because of her vast power and unlimited legions, who would keep the Valkyrior and Crimson Hawks busy, leaving the throne unguarded… If Loki could just figure out what to offer Hela in return. He manifested in her realm unannounced, just because he could, and he knew it annoyed her. As soon as she sensed his presence, Hela sent an escort. This time, it was a retinue of fallen Asgardian warriors riding skeletal horses and singing the ghostly songs of the Asgardian dead who never made it to Valhalla. To the accompaniment of these mournful, discordant strains, Loki followed his escort to Hela's throne. In this kingdom, bones twisted by dark magic paved the path to her castle while particularly favored souls became feasts for her Nastrond crows. Loki hated the décor even more than he hated the thought of Thor sitting on the throne of Asgard. Well, perhaps not quite that much. And speaking of thrones. Hela sat on hers, regarding him with an imperious and icy stare as he approached and the ghostly retinue vanished. \"Loki,\" she said. \"Whatever foolish scheme has brought you here, be assured it will not succeed. Return to your realm and disturb me no further.\" \"O sister, great queen, it–\" \"Whenever you call me queen, Loki–or, for that matter, sister– I know you want something. Tell me what it is and spare me the insincere implication that you care about family.\" \"Oh, I do,\" he said. \"I do very much. Our family rules realms, and we have a responsibility to rule them as well as possible. Unfortunately, we are not currently doing that, because I am not ruling Asgard. I propose to rectify this error, and–\" \"And you want my help.\" \"Yes,\" Loki said. \"My plan will succeed with or without you, but as I said, we're family, and-\" For the third time, she interrupted him. \"Why should I?\" \"Why, to be rid of the All-Father, whose time is past and to be rid of our beloved Odinson, who would otherwise succeed to the throne of Asgard.\" \"Which is the one thing you cannot stand to see happen.\" Loki did not give her the satisfaction of agreeing. \"You see, Loki,\" Hela said, \"of all master plotters you are the easiest to predict because all of your plots are ultimately only about one thing.\" Loki inclined his head, again unwilling to make a verbal acknowledgement. \"You have been working new magic. I smell it on you,\" Hela said. \"Tell me.\" \"Ah. The sap of Yggdrasill, Observe.\" Loki cut a small notch in one of the World-Tree's roots. As the sap oozed out, he captured it and began to work a charm to extract its essence. \"As the World-Tree shapes the limits of our realms,\" he said, \"this substance shapes the limits of our time.\" After a moment he held a small ball of what looked like amber in the palm of his hand. \"Take it. It will show you the future of your realm just as it showed me the future of mine.\" \"Yours? You speak of Asgard?\" \"Yes,\" Loki said. \"That is why I wanted to see you.\" He placed the ball in Hela's hand and began to describe what he had seen. * \"Ah,\" she said when they had returned from the visionary voyage. \"Yes, it is quite deserving of an 'ah,\" Loki said. \"But the real question is, will you help me?\" \"I will,\" Hela said. \"But I have my own vision for this Chronovium - for it has fallen in my realm as well. In return for my help, you will help me bring this vision to fruition.\" \"Of course,\" Loki said, intending it to be a lie but not even he knew when an attempted lie might become an inadvertent truth.",
        "status": null
      },
      {
        "title": "Journey into Mystery",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      },
      {
        "title": "Root Erosion",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Loki was released as the 7th character to be introduced to Marvel Rivals as a Strategist hero.",
          "Added 2 new costumes: Frost Giant and Loki Season 2.",
          "Added the God of Treachery achievement.",
          "Added to the Ragnarok Rebirth Team-Up Ability with Hela and Thor."
        ]
      },
      {
        "date_version": "24/12/10: Version 20241210",
        "changes": [
          "When the target area is ascending or descending, if Thor or Loki were revived by Hela's team-up ability, they would potentially revive and be stuck beneath the terrain if they were right on the target area platform. This issue has been resolved."
        ]
      },
      {
        "date_version": "25/01/08:",
        "changes": [
          "Fixed occasional camera irregularities after Loki transformed into certain characters during his ultimate ability."
        ]
      },
      {
        "date_version": "5/01/10: Version 20250110 / Season 1: Eternal Night Falls Launch",
        "changes": [
          "Added 1 new costume: All-Butcher."
        ]
      },
      {
        "date_version": "25/01/22: Version 20250122 / Fortune & Colors Event",
        "changes": [
          "Resolved a problem where under low frame rate conditions, activating Storm's ultimate ability as Loki after transforming into her would be canceled.",
          "Resolved a problem where Loki, after using his ultimate ability to shapeshift into the Punisher, if Warrior's Gaze was triggered when the transform was about to end its effects lingered too long. The Warrior's Gaze effect will now fade as soon as the ultimate concludes--no more lingering vision trickery!"
        ]
      },
      {
        "date_version": "25/02/07: Version 20250207",
        "changes": [
          "Fixed a rare issue where Loki's Mystical Missiles would not refill after reloading during unstable network conditions. He's back to being the trickster with a full arsenal!",
          "Resolved a rare occurrence where Loki's Ultimate Ability transformation would end immediately after activation in unstable network conditions. His mischief will now last as intended!"
        ]
      },
      {
        "date_version": "25/02/20:",
        "changes": [
          "Fixed an issue where Loki would incorrectly indicate he was out of Adam Warlock's revival range while transforming within Adam Warlock's ultimate range.",
          "Resolved an issue where, after transforming into another hero and using their ultimate, the ultimate's effects could remain in the scene if Loki was defeated during the process. We've ensured that his tricks vanish appropriately--no more ghostly ultimates haunting the battlefield!"
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "Increase the energy cost of God of Mischief from 3400 to 4000.",
          "Increase Mystical Missile charges from 10 to 12."
        ]
      },
      {
        "date_version": "25/03/07: Version 20250307 / Galacta's Cosmic Adventure Event",
        "changes": [
          "Fixed an issue where Loki's UI would vanish after he transformed. The God of Mischief can now keep his tricks visible!",
          "Fixed a problem where if Loki and his doppelganger placed Regeneration Domains that overlapped and Loki walked over the overlapped area, then back into his own Regeneration Domain, it would lose its healing effect. Now, the trickster can heal without a hitch!"
        ]
      },
      {
        "date_version": "25/03/14: Version 20250314",
        "changes": [
          "Resolved an issue where Loki's Ultimate Ability transformation could sometimes cause incorrect camera angles during Past Lives replays. The God of Mischief can now enjoy his dramatic exits without a hitch!",
          "Added 1 new costume: Presidential Attire."
        ]
      },
      {
        "date_version": "25/03/27: Version 20250327",
        "changes": [
          "Fixed an issue in Doom Match where Loki's transformation into Doctor Strange allowed the use of the forbidden Pentagram of Farallah. This minds-warping mix-up has been vanquished."
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411",
        "changes": [
          "Increase Regeneration Domain cooldown from 25 seconds to 30 seconds."
        ]
      },
      {
        "date_version": "25/04/25: Version 20250425 / Giant-Size Brain Blast Event",
        "changes": [
          "Added 1 new costume: Shin Sagi-Shi."
        ]
      }
    ],
    "official_quote": null,
    "official_description": "Loki is a Strategist hero in Marvel Rivals, and is the 7th hero introduced to the game's roster. He has team-up abilities that work in conjunction with Hela and Thor."
  },
  "background": {
    "real_name": "Loki Laufeyson",
    "aliases": [
      "God of Lies",
      "God of Mischief",
      "Trickster God"
    ],
    "birthplace": "Jotunheim",
    "birthdate": null,
    "gender": "Fluid",
    "eye_color": "Green",
    "hair_color": "Black",
    "relatives": [
      "Laufey",
      "Bor",
      "Odin",
      "Frigga",
      "Hela",
      "Angela",
      "Thor"
    ],
    "affiliation": [
      "Gods of Asgard"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Mastery over Asgardian magic",
      "Superhuman strength, intellect, reflexes, healing, and longevity",
      "Master illusionist, sorcerer, and manipulator",
      "Shapeshifting",
      "Teleportation",
      "Telekinesis",
      "Frost giant physiology"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Loki%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "51.11%",
    "wr_change": "+0.04%",
    "pick_rate": "24.91%",
    "pr_change": "+6.39%",
    "ban_rate": "2.96%",
    "matches": "371,040"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}