{
  "name": "Luna Snow",
  "role": "Strategist",
  "stats": {
    "health": 275,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#C084FC",
    "color_theme_secondary": "#EC4899"
  },
  "abilities": [
    {
      "name": "LIGHT & DARK ICE",
      "keybind": null,
      "type": null,
      "description": "Fire ice shots that damage enemies or heal allies.",
      "casting": "Hitscan 3-round burst",
      "damage": "20 per round (60 per burst)",
      "damage_falloff": "Falloff begins at 20m, decreasing to 60% at 40m",
      "fire_rate_interval": "0.5s for three shots. The interval between the first two shots is 0.05s",
      "ammo": 30,
      "critical_hit": true,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Adjust the damage falloff of Light & Dark Ice from 60% at 40m to 75%."
    },
    {
      "name": "ICE ARTS",
      "keybind": "SHIFT",
      "type": null,
      "description": "Fire ice shards for a short duration, damaging enemies or healing allies while restoring her own Health.",
      "casting": "Single-cast spell field that pierces through enemies",
      "damage": "50 per round",
      "damage_falloff": null,
      "fire_rate_interval": "1.43/s",
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": "A cylindrical spell field with a radius of 1m and a height of 40m",
      "projectile_speed": null,
      "charges": null,
      "duration": "6s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "SHARE THE STAGE",
      "keybind": "E",
      "type": null,
      "description": "Attach Idol Aura to an ally. Allies with Idol Aura also restore Health when Luna Snow is healing others.",
      "casting": "Targeted",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "If Luna Snow directly heals the target with Idol Aura, they gain 35% increased healing from her abilities.\nThis is a versatile healing tool that can be placed on key targets such as Vanguards and other Strategists, or placed on mobile heroes such as Spider-Man or Iron Man.\nAllies that die under the effects of Share the Stage will lose the buff upon respawning.\nIn addition, Luna Snow can't use Share the Stage on herself."
    },
    {
      "name": "ABSOLUTE ZERO",
      "keybind": null,
      "type": null,
      "description": "Cast a clump of ice to Freeze the hit enemy and restore Health.",
      "casting": "Single-cast projectile with delayed impact",
      "damage": 50,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": "60m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "♻ Freeze enemies for 2.7s. However, if they are attacked during the last 2.2s of the freeze, the effect will be canceled.\nThis is a versatile tool that can be used for defense to avoid dives, or for offense to pin down a key target.\nThis ability can even interrupt Ultimates, such as Scarlet Witch's Reality Erasure or Spider-Man's Spectacular Spin."
    }
  ],
  "ultimate": {
    "name": "FATE OF BOTH WORLDS",
    "keybind": "Q",
    "type": null,
    "description": "Take center stage and start dancing! Press to toggle between two performances: Heal allies or grant them Damage Boost.",
    "casting": "Persistent spell field that surrounds the caster",
    "damage": null,
    "range": null,
    "effect": null,
    "duration": "12s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": "40%",
    "bonus_health_details": null,
    "energy_cost": 4500,
    "details": "Luna Snow becomes immune to all forms of crowd control while dancing.\nUnable to use other abilities during Fate of Both Worlds.\nIncrease the interval for switching between healing and damage in Fate of Both Worlds from 0.1s to 0.5s.\nThe healing dance provides a massive healing-per-second and bonus health.\nIn addition, she also heals all allies a single time per cast for a large amount.\nThis is the most powerful healing ability in the game, being a clutch in moments where the team is getting bombarded by enemy fire. It can change the course of the battle, being especially useful to contest objectives since her entire team will be very hard to take down even with focused fire.\nThe damage boost dance provides 40% increased damage from all sources.\nIncrease the energy cost to activate Fate of Both Worlds from 4000 to 4500.\nHEALING - 200 on cast - 250/s\nCOOLDOWN - Luna Snow can swap between healing and damage boosting every 0.5s\nDAMAGE BOOST - 40%\nMAXIMUM SHIELD VALUE - 250"
  },
  "passives": [
    {
      "name": "CRYO HEART",
      "keybind": null,
      "type": null,
      "description": "Automatically restore Health when casting Ice Arts or Absolute Zero.",
      "cooldown": null,
      "damage": null,
      "range": null,
      "trigger_condition": null,
      "effect_boost": null,
      "speed_details": null,
      "details": "HEALING - 30/s for 3 seconds when casting Ice Arts or Absolute Zero"
    },
    {
      "name": "SMOOTH SKATE",
      "keybind": null,
      "type": null,
      "description": "Keep moving forward to start ice skating and enable higher jumps",
      "cooldown": null,
      "damage": null,
      "range": null,
      "trigger_condition": "Move forward for longer than 0.5s",
      "effect_boost": null,
      "speed_details": "9.6m/s",
      "details": "Smooth Skate's effects end if Luna Snow stops moving forward."
    }
  ],
  "teamups": [
    {
      "name": "ICY DISCO",
      "keybind": null,
      "partner": [
        "Namor",
        "Jeff the Land Shark"
      ],
      "effect": "Luna Snow infuses ice energy into Namor and Jeff the Land Shark, who then can tap into the ice energy to power up abilities at will",
      "teamup_bonus": "15% Healing Boost",
      "duration": null,
      "cooldown": null,
      "range_target": null,
      "special_notes": null,
      "details": null
    },
    {
      "name": "FROZEN CHI",
      "keybind": "C",
      "partner": "Iron Fist",
      "effect": "Iron Fist channels the Chi of Shou-Lao into Luna Snow, transforming her ice power into a Chi-infused frosty ring that radiates from her. This ring can knock back enemies with chilling damage and applies a slowing effect, while simultaneously healing her allies",
      "teamup_bonus": null,
      "duration": null,
      "cooldown": null,
      "range_target": "10m radius",
      "special_notes": "Knock back enemies and apply a Slow",
      "details": null
    }
  ],
  "gameplay": {
    "strategy_overview": "As Luna Snow, focus on maintaining a consistent stream of healing while weaving in impactful damage and crowd control. Utilize 'Absolute Zero' both for its stun and self-healing capabilities. Position yourself to effectively land your primary fire, understanding its importance for resource management. Employ 'Share the Stage' thoughtfully, using the snowflake to provide targeted healing and a healing boost to key allies in need.",
    "weaknesses": [
      "Smooth Skate's effects end if Luna Snow stops moving forward.",
      "Has limited self-sustain.",
      "Susceptible to dives.",
      "Relies on positioning to get the most out of Ice Arts.",
      "Allies that die under the effects of Share the Stage will lose the buff upon respawning.",
      "In addition, Luna Snow can't use Share the Stage on herself.",
      "Unable to use other abilities during Fate of Both Worlds."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Frozen Fathoms",
        "description": "As Luna Snow, freeze an enemy Namor with Absolute Zero.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Multiverse Tour",
        "description": "As Luna Snow, complete a match on 5 maps with different themes.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "I'm Luna Snow. Like the moon, I shine in darkness.",
    "ingame_bio_text": "Equal parts pop star and Super Hero, Luna Snow puts on a dazzling show with both her light and dark ice powers. The arena is her stage, where Seol Hee and her team orchestrate spectacular displays that earn her an ever-increasing number of fans and wins.",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Guests from the Deep Sea",
        "content": "High summer on the beach was a great time to be alive anywhere. It was even better when you were on the gem of the Pacific, Jeju Island. And it was way better when you were on Jeju Island singing in front of a hundred thousand screaming fans against the backdrop of a deep blue sea and a cloudless sky.\nLuna Snow soaked it all in as she closed the fifth song of her set, \"Flow,\" hearing the fireworks go off behind her right on schedule as her last line — Finally now we feel alive! — drove the crowd into an even bigger frenzy. Whoa, they're extra loud, she thought. Not just the crowd, but the fireworks even more so, loud enough to shake the stage. Some gear fell over in the wings. She glanced at the crew, keeping her show smile big. It looked like they had things under control, but they were also looking around like —\nWhoa again. The ground really shook that time, and it wasn't any kind of stage effect she and her choreographers had programmed into the set.\nA split second later, she saw it among the fans, a surge of fear passing through the crowd as they all felt the shaking and turned to face the sea.\nThen Luna saw it too.\nThe horizon moved. A slow bulge at first, but as it approached, it grew into a great wave surging in the direction of the beachside amphitheater. A tsunami! But no ordinary tsunami, because behind it — no, within it — lurked an immense shadow, as if the wave had not arisen naturally but was being driven by something below. How big would a creature have to be to cause a wave of this size? Already the water was draining away from the shore. That meant she had very little time to act.\nSo act she did, springing off the stage and rushing toward the beach as the crowd scattered away. The wave was growing with no signs of stopping. She planted her feet when she reached the coastline and called up every atom of her cryokinetic powers. Singing a high, wordless note, she found the frequency of the waves and tuned herself to it, feeling the power flow from her, through the wet sand at her feet and out into the base of the immense wave. Dark ice shot up from the exposed seabed, threading up through the wave and spreading until the entire tsunami was frozen in place. Even though less than a minute had passed since she had left the stage, Luna had managed to calm the seas for a moment.\nAnd a long moment it was, the only sounds along the beach being the astonished gasps and sobs of the audience.\nThen cracks began to apear.\nSomething was moving within the ice. The shadow, she thought — and just as the thought formed in her head, the frozen standing wavefront shattered.\nThe momentum of the tsunami was broken, so its towering water flowed across the shore and back into the sea, but what emerged amid the battleship-sized shards of ice made Luna realize that she had solved the symptom, not the cause.\nThe monster was perhaps a hundred meters tall, octopus-like, with tentacles that lashed out over the water as it churned through the shallows toward the shore. Toward her fans. Its body was weirdly translucent, bizarre organs glowing within its massive form. In its eyes was pure, mindless rage. She had heard suspenseful tales of this creature, but never thought it was real: the menace from the murky depths, Monstro.\nAs the beast arose from the sea, she saw something else: A jagged wound in the side of its body, where the tentacles all gathered.\nNo wonder it's so mad, that cut is huge! she thought as she skated towards the base of one tentacle, just below the corner of its eye. This creature was most definitely enraged by the agony of its wound. If it got to the shore, a lot of people would not be making it home from the island.\nBut she wasn't going to let that happen.\n\"Hey, hey, Monstro,\" she crooned, taking a step forward as Monstro's tentacles churned the shallows into foam that swirled around her feet. One of its tentacles slashed through the air just over her head. If she got too close, or didn't get close enough, all the people watching from the amphitheater and via streams all over the world were going to see the end of Luna Snow...and who knew how many other people.\nSo she focused on what she could do. She channeled her powers, the light ice she had learned how to wield as the other aspect of her cryokinesis blooming where her fingertips touched the churning surf. She reached out, and the water around Monstro's body transformed into curling veins of warm healing ice. They crept up, finding the wound and tracing its length. Luna trembled with the effort of healing the wound— it was so much larger than anything she had ever tried to heal before. Behind her, she dimly heard a new sound rushing through the crowd, but whether it was fear or excitement or anticipation she couldn't tell without losing her focus, and if she lost her focus now, much more would also be lost. Little by little, her healing ice grew filaments across the wound, one side reaching toward the other. Monstro grew still, as if it knew what she was trying to do...or was biding its time until she failed.\nThere! The ice linked up across the bleeding gap, knit it together again, then melted into Monstro's skin. Its tentacles fell limp for a moment, as if in relief, like that was Monstro's way of letting out a long sigh. Then, slowly and peacefully, it slipped back out into deeper water and was gone, leaving the huge chunks of ice to crash and grind against each other in its wake.\nThen Luna heard a voice off to her right. \"Surface dweller. So-called superstar. Luna Snow.\"\nShe turned, and barely suppressed a squeak of shock. Hovering above her on winged feet was none other than Namor, ruler of Talocan and all the endless expanse of the deep ocean. And apparently, he wanted to talk to her? Luna was a little starstruck, which didn't happen to her often, but she kept her wits about her enough to make sure that her mic was still live.\n\"Your...Majesty?\" she said. \"Welcome to Jeju Island.\"\n\"You need not welcome me to what I am about to possess,\" Namor said. \"Talocan shall soon rule this island, and all surface dwellers who venture here will kneel before me.\"\n\"I don't know about that, Your Majesty,\" Luna said as she rode her ice into the sky to look him in the eye. \"At the moment, I think it's pretty clear that I rule Jeju Island. I mean, look at this crowd!\"\nThe remaining crowd burst into loud cheers at this, and Luna let Namor soak in it for a moment. He might have been a Mutant king, but she was Luna Snow, and nobody was going to bully her in front of a million fans.\n\"Careful, human,\" Namor said. \"I came here to give you my thanks. And while I admire your courage, if you show me any more disrespect, I promise that your song will be cut short.\"\n\"Oh. Um.\" Luna gave a little chuckle, relying on cuteness to buy her some time. \"Well, in that case, you're welcome? And what are you thanking me for?\" She looked around at the mess the melting ice was causing all along the shoreline.\n\"The creature you call Monstro,\" Namor said. \"It was wounded by the careless maneuvering of a submarine, and thus driven to a frenzy by the pain.\"\n\"Yeah, no one likes a bad cut. Wait...\" she said. \"A submarine? How fast can those things go, anyway?\"\n\"The technical specifications of surface-dweller vessels matter little to me,\" Namor said. \"They will all soon be laid to waste. However, the fact that Monstro in its madness destroyed some settlements of Talocan did concern me. You have saved not just the lives of surface dwellers, but citizens of the deep, my people. So. For that you have our gratitude.\"\n\"Well, wow,\" Luna said. \"I don't know what to say.\"\n\"Perhaps you should say nothing. Not when more singing remains.\" Was that a little glint of good humor in Namor's eye? Or a subtle warning for Luna to stay in her lane? She wasn't sure until Namor spoke again. \"Let the humans here have one more night of revelry before the oceans rise.\"\n\"Since you're here... care to join me for an encore?\" Luna reached out her hand to Namor, hoping her music might help ease the tensions of two worlds clearly on the brink of war.\n\"The surface dwellers will get to see me perform soon enough,\" Namor said, each word soaked in disdain. \"And when that time comes, those who are wise will be cheering my name far louder than they cheer yours now.\"\n\"I find that hard to imagine,\" Luna said, glancing back towards her adoring public. \"You can't force people to love you, Namor. You have to earn it. And that's exactly what I try to do on this stage, every single night. The bond I have with my fans? That's something that no monster of the deep — not even you — can ever take away.\"\nLuna's icy gaze sent a chill down Namor's spine, but she quickly switched back to her usual positive persona the instant she turned to face the crowd. \"So, who's ready to get this show re-started?\"\nEven Monstro's roar couldn't have been heard over the pandemonium from the crowd. Music, Luna thought. It brings people together.\nBut as she watched a grim Namor silently disappear back into the ocean's depths, she wondered how much longer that would be the case...",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06",
        "changes": [
          "Season 0: Dooms' Rise",
          "Launch",
          "Luna Snow was released as the 5th character to be introduced to Marvel Rivals as a Strategist hero.",
          "Added 2 new costumes: Minty Beats and Shining Star.",
          "Added the Multiverse Tour achievement.",
          "Added to the Chilling Charisma Team-Up Ability with Namor and Jeff the Land Shark and the Atlas Bond Team-Up Ability with Iron Fist."
        ]
      },
      {
        "date_version": "25/01/08",
        "changes": [
          "Resolved instances where Luna Snow's ultimate ability occasionally failed to heal teammates."
        ]
      },
      {
        "date_version": "25/01/10",
        "changes": [
          "Version 20250110",
          "Season 1: Eternal Night Falls",
          "Launch",
          "Increase the interval for switching between healing and damage in Fate of Both Worlds from 0.1s to 0.5s."
        ]
      },
      {
        "date_version": "25/02/07",
        "changes": [
          "Version 20250207",
          "Added 1 new costume: Mirae 2099."
        ]
      },
      {
        "date_version": "25/02/21",
        "changes": [
          "Version 20250221",
          "Season 1.5",
          "Launch",
          "Increase the energy cost to activate Fate of Both Worlds from 4000 to 4500.",
          "Increase the healing amount of Frozen Chi from 50 to 75, and the slow effect on enemies from 20% to 30%."
        ]
      },
      {
        "date_version": "25/04/11",
        "changes": [
          "Version 20250411",
          "Season 2: Hellfire Gala",
          "Launch",
          "Added 1 new costume: Nolaehaneun Manyeo."
        ]
      },
      {
        "date_version": "25/04/18",
        "changes": [
          "Added 1 new costume color for Mirae 2099: Plasma Pulse."
        ]
      },
      {
        "date_version": "25/04/30",
        "changes": [
          "Version 20250430",
          "Adjust the damage falloff of Light & Dark Ice from 60% at 40m to 75%."
        ]
      }
    ],
    "official_quote": null,
    "official_description": "Luna Snow is a Strategist hero in Marvel Rivals, and is the 5th hero introduced to the game's roster."
  },
  "background": {
    "real_name": "Seol Hee (설희)",
    "aliases": [],
    "birthplace": "Seoul, South Korea",
    "birthdate": null,
    "gender": "Female",
    "eye_color": "Blue, Brown",
    "hair_color": "Black, White",
    "relatives": [
      "Grandmother"
    ],
    "affiliation": [
      "Agents of Atlas"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Destructive and healing Cryokinesis",
      "Enhanced agility"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Luna+Snow%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "45.24%",
    "wr_change": "-2.11%",
    "pick_rate": "21.58%",
    "pr_change": "-9.36%",
    "ban_rate": "0.42%",
    "matches": "321,981"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}