{
  "name": "Magneto",
  "role": "Vanguard",
  "stats": {
    "health": 650,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#EC4899",
    "color_theme_secondary": "#A855F7"
  },
  "abilities": [
    {
      "name": "IRON VOLLEY",
      "keybind": "LMB",
      "type": "Projectile",
      "description": "Fire a volley of magnetic orbs forward. The range of the resulting explosion increases based on distance flown.",
      "casting": "Single-cast projectile with delayed impact that also generates a spell field",
      "damage": "Projectile Damage: 40. The spell field deals 40 damage at its center, reducing to 50% within a 3m radius from the center",
      "damage_falloff": "50% within a 3m radius from the center",
      "fire_rate_interval": "0.8s",
      "ammo": 10,
      "critical_hit": null,
      "cooldown": null,
      "range": "Initially, it produces a spell field with a 1m spherical radius; when the projectile reaches maximum distance, the explosion radius expands to a spell field with a 3m spherical radius",
      "projectile_speed": "80m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "MAG-CANNON",
      "keybind": null,
      "type": "Projectile",
      "description": "Convert the iron rings on Magneto's back into a Mag-Cannon and launch a metallic mass forward. Higher stacks of rings increase damage, and full stacks knock back enemies.",
      "casting": "Single-cast projectile with delayed impact",
      "damage": "40 (Iron Rings first charge)\n65 (Iron Rings second charge)\n90 (Iron Rings third charge)",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "No cooldown, but the ability can only be activated when the Iron Ring has at least one charge",
      "range": null,
      "projectile_speed": "120m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "When fully charged, Mag-Cannon has a 6m knockback distance"
    },
    {
      "name": "METAL BULWARK",
      "keybind": "E",
      "type": "Shield",
      "description": "Conjure a metal shield around a chosen ally. Damage taken will transform into rings on Magneto's back.",
      "casting": "Targeted",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "12s",
      "range": "20m",
      "projectile_speed": null,
      "charges": null,
      "duration": "2.5s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Cooldown shared with Iron Bulwark\nThe shield grants one charge of Iron Ring for every 100 damage it absorbs"
    },
    {
      "name": "IRON BULWARK",
      "keybind": "F",
      "type": "Shield",
      "description": "Conjure an iron shield around himself. Damage taken will transform into rings on Magneto's back.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "12s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "2.5s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Cooldown shared with Metal Bulwark\nThe shield grants one charge of Iron Ring for every 100 damage it absorbs"
    },
    {
      "name": "METALLIC CURTAIN",
      "keybind": "SHIFT",
      "type": "Shield",
      "description": "Change the magnetic field around to form a metallic curtain, blocking all incoming projectiles.",
      "casting": "Shield",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "3s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": "65/s",
      "details": "MAXIMUM ENERGY - 100\nENERGY RECOVERY DELAY - 1s\nENERGY RECOVERY SPEED - 11/s"
    },
    {
      "name": "MAGNETIC DESCENT",
      "keybind": "SPACE",
      "type": "Movement",
      "description": "Hold Space to fall slowly.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "6m/s (horizontal) - 3.5m/s (descending)",
      "energy_cost_details": null,
      "details": null
    }
  ],
  "ultimate": {
    "name": "METEOR M",
    "keybind": "Q",
    "type": "Projectile",
    "description": "Draw in all materials around to forge an iron meteor that deals massive damage upon impact. Absorbing enemy projectiles can enhance the meteor's power, yet overloading will cause it to self-destruct.",
    "casting": "Create a persistent spell field that launches a projectile upon completion, which generates another spell field on impact",
    "damage": "The projectile deals no damage. The base damage at the center of the spell field starts at 100 and increases to 300 when fully charged. Each point of Energy adds an extra 3 points of damage to the spell field, with damage reducing to 50% at a distance of 6m from the center",
    "range": "Initially, the ability has a spherical range with a radius of 5m. After charging for 4s, it expands to an 8m radius",
    "effect": "For each point of projectile damage absorbed, the power increases by 0.125, with a maximum absorption of 800 projectile damage",
    "duration": "4s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": "30m/s",
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 3400,
    "details": "PROJECTILE ABSORPTION RANGE - 15m spherical radius"
  },
  "passives": [],
  "teamups": [
    {
      "name": "Mental Projection",
      "partner": [
        "Emma_Frost",
        "Psylocke"
      ],
      "details": "Invisibility Duration: 1s<br/>Duplicate Duration: Up to 5s<br/>Duplicate Damage Reduction: 70%<br/>Duplicate Max Damage Recieved: 150<br/>Special Effect: Upon activation, Magneto and his Duplicate Illusion become invisible. The damage dealt by the projection is reduced, and it dissipates after taking a specific amount of damage; When the player uses an Ultimate ability, the Duplicate Illusion will auto-shoot the closest enemy target instead"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Magneto is a formidable off-tank Vanguard, renowned for his exceptional ability to control space, provide robust protection for his teammates, and neutralize crucial enemy ultimates. His kit excels at holding defensive lines and disrupting enemy advances. Success with Magneto hinges significantly on player accuracy with his predominantly projectile-based abilities, especially his <b>Iron Volley (LMB)</b> and the powerful <b>Mag-Cannon (RMB)</b>.</p>\n<p>Effective positioning involves utilizing cover to mitigate incoming damage. In team compositions focused on diving, maintaining proximity to your supports is advisable. Strategically deploy your <b>Metallic Curtain (Shift)</b> to block off key chokepoints, hinder enemy movement, and protect allies from projectiles, including devastating ultimates. Remaining near the objective allows Magneto to effectively safeguard teammates and control the immediate area. Efficiently manage the cooldowns of both your <b>Metal Bulwark (E)</b> and <b>Iron Bulwark (F)</b> shield abilities, as they are critical for generating charges for your high-burst Mag-Cannon. Understanding the charge time of his <b>Meteor M (Q)</b> ultimate is crucial for maximizing its damage and knockback. His versatility makes him a valuable addition as a resilient solo tank or a supportive off-tank, but be mindful of his vulnerability to melee attacks by maintaining mid-range positioning.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Basic Damage Sequence:</u></b><br>Fire two volleys of <b>Iron Volley (LMB)</b> → Follow immediately with a charged shot from your <b>Mag-Cannon (RMB)</b> for burst damage.<br><br></li>\n  <li><b><u>Shield to Mag-Cannon Charge:</u></b><br>Utilize <b>Metal Bulwark (E)</b> on an ally (or <b>Iron Bulwark (F)</b> on yourself) to quickly generate Mag-Cannon charges → Unleash a powerful <b>Mag-Cannon (RMB)</b> shot. This is key for consistent high damage output.<br><br></li>\n  <li><b><u>Close-Range Animation Cancel:</u></b><br>For a quick close-range burst: Basic attack (LMB) → Animation cancel into a melee strike → Animation cancel into a <b>Mag-Cannon (RMB)</b> shot.<br><br></li>\n  <li><b><u>Metallic Curtain (Shift) Deployment:</u></b><br>Use strategically to block major chokepoints, deny enemy sightlines, or completely negate incoming projectile ultimates (e.g., Star-Lord's, Punisher's). It provides comprehensive defense against all projectiles.<br><br></li>\n  <li><b><u>Meteor M (Ultimate - Q) Usage:</u></b><br>Charge and aim to disrupt grouped enemies, knock them out of position, or secure kills. It can also counter numerous enemy ultimates by displacing or damaging them during their cast.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Heroes who rely on projectile-based ultimates (e.g., <u>Star-Lord</u>, <u>The Punisher</u>, <u>Iron Man</u>, <u>Hela</u>, <u>Luna Snow</u>, <u>Cloak & Dagger</u>). Teams that primarily focus on dealing damage from a distance, as <b>Metallic Curtain</b> excels here.<br><br></li>\n  <li><b>Challenging Against:</b> <u>Doctor Strange</u> can fly directly towards him and potentially negate <b>Meteor M</b>. Melee-heavy compositions, as melee attacks bypass his shields. <u>Wolverine</u> can be problematic despite protective bubbles. Highly mobile characters who can effectively evade his <b>Iron Volley</b> projectiles.<br><br></li>\n  <li><b>Key Synergies:</b> The <b>Mental Projection</b> Team-Up with <u>Emma Frost</u> enhances his survivability and opens up coordinated plays. Works well with dive-oriented DPS characters who benefit from the space he controls and the protection his shields offer.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Superior Space Control:</b> <b>Metallic Curtain</b> and strategic positioning excel at denying areas and holding defensive lines.</li>\n  <li><b>Projectile Negation:</b> <b>Metallic Curtain</b> provides comprehensive defense against all incoming projectiles, including many ultimates.</li>\n  <li><b>Ultimate Counter Potential:</b> <b>Meteor M (Q)</b> and <b>Metallic Curtain</b> can directly counter or mitigate numerous enemy ultimates.</li>\n  <li><b>High Burst Damage:</b> The <b>Mag-Cannon (RMB)</b>, when charged, delivers significant burst damage for eliminating priority targets.</li>\n  <li><b>Team Shielding:</b> <b>Metal Bulwark (E)</b> for allies and <b>Iron Bulwark (F)</b> for self provide valuable damage mitigation and charge his Mag-Cannon.</li>\n  <li><b>Objective Control:</b> Strong at holding points and protecting teammates playing around objectives.</li>\n  <li><b>Effective Disruption:</b> <b>Meteor M (Q)</b> provides significant knockback and area disruption.</li>\n  <li><b>Team-Up Synergy:</b> Enhanced tactical options and survivability through the <b>Mental Projection</b> Team-Up with <u>Emma Frost</u>.</li>\n</ul>",
    "weaknesses": [
      "Limited mobility and unable to fly, despite having slow fall.",
      "Surprisingly frail if his shields are on cooldown.",
      "His shields share a cooldown, meaning he requires proper timing to use them.",
      "Unlike Doctor Strange, he can't hold his Metallic Curtain indefinitely.",
      "If Magneto absorbs too many projectiles while charging Meteor M (displayed by a gauge when he casts), the Ultimate will be cancelled.",
      "The overloading is based on the number of projectiles, not their damage output. This means that certain attacks that fire multiple projectiles at once, such as The Punisher's Deliverance shotgun, will absorb more projectiles than his Adjucation automatic rifle."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "House of M",
        "description": "As Magneto, partner with Scarlet Witch to land 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Homo Superior",
        "description": "As Magneto, assist Mutant allies 10 times.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Be wary, no timeline exists where Magneto yields.\"",
    "ingame_bio_text": "The Master of Magnetism bends even the strongest metal to his whims, shielding his allies and striking at his foes. Whether he calls himself Max Eisenhardt, Erik Lehnsherr, or simply Magneto, the hardships this warrior has endured have made him as unbreakable as the steel he brandishes.",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Trial of Magneto",
        "content": "As he gazed off into the distance towards the line where the ocean met the sky, Magneto's cape fluttered gently in the calm breeze that was drifting across the coast of the sentient island nation of Krakoa. His was a life far longer than most people ever had the chance to live, and this was one of the few moments of true peace that he could recall. But he knew from experience it would not last for long. It never did.\n\n...[rest of the story]",
        "status": null
      },
      {
        "title": "The Battle Within",
        "content": "Magneto hovered high above the nation of Krakoa. He had lived through more than his share of wars, but as he gazed down at the Mutant homeland below, he could barely begin to comprehend the full scope of the horrors unfolding on his own sovereign soil. Still, it was not as if he hadn’t seen this coming...\n\n...[rest of the story]",
        "status": null
      },
      {
        "title": "The Messiah of Mutants",
        "content": "Coming soon. Stay Tuned!",
        "status": "Coming soon"
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Magneto was released as the 14th character to be introduced to Marvel Rivals as a Vanguard hero.",
          "Added 3 new costumes: Uncanny Blacksteel, Will of Galacta, and Master of Magnetism.",
          "Added the Homo Superior achievement.",
          "Added to the Metallic Chaos Team-Up Ability with Scarlet Witch."
        ]
      },
      {
        "date_version": "25/01/10: Version 20250110 / Season 1: Eternal Night Falls Launch",
        "changes": [
          "Increase Metallic Fusion projectile damage from 55 to 60 and Metallic Fusion spell field damage from 30 to 35.",
          "Added 1 new costume: King Magnus."
        ]
      },
      {
        "date_version": "25/02/20",
        "changes": [
          "Addressed an issue where Magneto's ultimate could pass through characters without dealing damage due to discrepancies between collision models and visual effects. The collision body is now properly optimized to better suit the visual presentation."
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "Increase Iron Volley projectile damage from 35 to 40.",
          "Increase Metallic Curtain's energy consumption from 50/s to 65/s and reduce its maximum duration from 2s to 1.5s."
        ]
      },
      {
        "date_version": "25/03/27: Version 20250327",
        "changes": [
          "Resolved an issue in the post-match where Magneto's MVP could sometimes display some bizarre, offbeat visuals. The master of magnetism now commands his moments with true polar precision."
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Increase energy cost for Meteor M from 3100 to 3400.",
          "Added to the Mental Projection Team-Up Ability with Emma Frost and Psylocke, but removed from the Metallic Chaos Team-Up Ability with Scarlet Witch."
        ]
      }
    ],
    "official_quote": "\"Perhaps we should give these humans good reason to hate and fear us after all.\"",
    "official_description": "Magneto is a Vanguard hero in Marvel Rivals, and is the 14th hero introduced to the game's roster. He has team-up abilities that work in conjunction with Emma Frost and Psylocke."
  },
  "background": {
    "real_name": "Max Eisenhardt",
    "aliases": [
      "Erik Lehnsherr",
      "Magnus",
      "Master of Magnetism"
    ],
    "birthplace": "Nuremberg, Germany",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Blue",
    "hair_color": "White",
    "relatives": [
      "Pietro Maximoff",
      "Wanda Maximoff"
    ],
    "affiliation": [
      "X-Men",
      "Brotherhood of Mutants"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Mastery over all forces of magnetism",
      "Energy Manipulation",
      "Magnetic Force Fields",
      "Electromagnetic Pulse",
      "Flight"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Magneto%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "46.58%",
    "wr_change": "-1.27%",
    "pick_rate": "18.55%",
    "pr_change": "-9.67%",
    "ban_rate": "0.33%",
    "matches": "276,289"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}