{
  "name": "Mantis",
  "role": "Strategist",
  "stats": {
    "health": 250,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#FDE047",
    "color_theme_secondary": "#84CC16"
  },
  "abilities": [
    {
      "name": "LIFE ENERGY BLAST",
      "keybind": "LMB",
      "type": null,
      "description": "Launch a fast moving thorn projectile to deal damage. This ability is not affected by damage falloff. Landing critical hits with this ability instantly generates one Life Orb.",
      "casting": "Single-cast projectile with delayed impact",
      "damage": "55 per round",
      "damage_falloff": null,
      "fire_rate_interval": "2.5/s",
      "ammo": 20,
      "critical_hit": true,
      "cooldown": null,
      "range": null,
      "projectile_speed": "150m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "HEALING FLOWER",
      "keybind": null,
      "type": null,
      "description": "Places a heal-over-time effect on her targeted ally, that lasts for 8 seconds. Upon casting, the target also gains an instant heal of 55 health. This ability consumes one Life Orb. Effects can be stacked, up to a maximum of 16 seconds.",
      "casting": "Targeted",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "3s per Life Orb",
      "range": null,
      "projectile_speed": null,
      "charges": 4,
      "duration": "8s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Provides two types of healing effects: One-time Healing and Healing Over Time"
    },
    {
      "name": "ALLIED INSPIRATION",
      "keybind": "E",
      "type": null,
      "description": "Consume Life Orbs to grant allies a Damage Boost. This ability consumes one Life Orb. Effects can be stacked, up to a maximum of 16 seconds.",
      "casting": "Targeted",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "3s per Life Orb",
      "range": null,
      "projectile_speed": null,
      "charges": 4,
      "duration": "8s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Life Orb charges & cooldowns shared between Allied Inspiration, Natural Anger, and Healing Flower"
    },
    {
      "name": "NATURAL ANGER",
      "keybind": "F",
      "type": null,
      "description": "Consume Life Orbs to grant herself a Damage Boost. This ability consumes one Life Orb.",
      "casting": "Instant Cast",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "3s per Life Orb",
      "range": null,
      "projectile_speed": null,
      "charges": 4,
      "duration": "8s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Life Orb charges & cooldowns shared between Allied Inspiration, Natural Anger, and Healing Flower"
    },
    {
      "name": "SPORE SLUMBER",
      "keybind": "SHIFT",
      "type": null,
      "description": "Throw a spore to Sedate the nearest enemy. Enemies hit by the ability will be stunned for 3.5 seconds, or until they take damage. Enemies will not wake up if they take damage for the first .5 seconds of the stun. This allows Mantis to shoot once immediately after using the ability without waking the opponent up. A Mantis illusion will manifest beside the sedated heroes. Allies can attack this illusion to awaken the affected hero.",
      "casting": "Single-cast projectile with delayed impact that also generates a spell field",
      "damage": 10,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": "3m spherical radius",
      "projectile_speed": null,
      "charges": null,
      "duration": "3.5s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Ability Health: 100.  A very versatile ability to help secure takedowns on key targets, or as a defensive measure against diving opponents. It is often useful to wait for your team and collectively damage the stunned opponent at the same time. This is a great way to secure a kill when they have more health than Mantis alone can deal with."
    },
    {
      "name": "NATURE'S FAVOR",
      "keybind": null,
      "type": "PASSIVE",
      "description": "Receive a Movement Boost when not injured and Healing Over Time when consuming Life Orbs.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "8s",
      "movement_boost": "1.5m/s",
      "energy_cost_details": null,
      "details": "Healing: 12.5/s. Trigger Condition: Out of combat for over 3s. Provides 40% increased movement speed whenever she's not damaged for 3 seconds. In addition, whenever Mantis consumes Life Orbs, she also gains a self-heal-over-time for 8 seconds."
    }
  ],
  "ultimate": {
    "name": "SOUL RESURGENCE",
    "keybind": "Q",
    "type": null,
    "description": "Release energy around her while moving, providing Healing Over Time and Movement Boosts for surrounding allies. Excess healing converts to Bonus Health. This ability lasts for 8 seconds and affects all allies within the radius around her, as well as Mantis herself. In addition, she also heals all allies in range of the ability for 200 health upon use. If her allies are at full health, 70% of the excess healing is converted into bonus health until the Ultimate is over. The over-healing can only give each player up to 100 extra health. Mantis also benefits from the speed boost, healing and over-health, making her much harder to take down. This is the second most powerful healing ability in the game (after Luna Snow's Fate of Both Worlds), being clutch in moments where the team is getting bombarded by enemy fire. It can change the course of the battle, being specially useful to contest objectives since her entire team will be hard to take down even with focused fire. Mantis can use Soul Resurgence if she reaches low health, or is taking a lot of damage, to ensure that she is able to stay in the fight.",
    "casting": "Persistent spell field that surrounds the caster",
    "damage": null,
    "range": "15m spherical radius",
    "effect": "Healing Over Time and Movement Boosts",
    "duration": "8s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": "3m/s",
    "bonus_health_details": "100 maximum health on overheal. 70% of excess healing converted to bonus health.",
    "energy_cost": 3700,
    "details": "Healing: 200 on cast - 150/s (Reduced to 105/s when overhealing)"
  },
  "passives": [],
  "teamups": [
    {
      "name": "Guardian Revival",
      "partner": [
        "Adam_Warlock",
        "Star-Lord"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": null,
      "cooldown": "120s",
      "range_target": null,
      "special_notes": "Ability: Nature's Soul",
      "details": "Key While Dead: Primary Fire; Secondary Fire to Cancel<br/>Maximum Free Flight Duration: 13s<br/>Special Mechanic: During this period, Mantis enters a free-flight state; if neither option is pressed, Mantis will respawn normally"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Mantis is an agile Strategist who relies on generating and expending Life Orbs for healing, damage boosts, and crowd control. Her <b>Life Energy Blast (LMB)</b> grants a Life Orb on critical hits. Her ultimate, <b>Soul Resurgence (Q)</b>, provides AoE burst and sustained healing, a movement speed boost, and converts excess healing to bonus health. <b>Spore Slumber (Shift)</b> puts an enemy to sleep. Consuming Life Orbs, she can use <b>Allied Inspiration (E)</b> for ally damage boost, <b>Natural Anger (F)</b> for self damage boost, or <b>Healing Flower (RMB)</b> for ally HoT.</p>\n<p>Position Mantis in the backline, using her <b>Nature's Favor (Passive)</b> speed boost (when uninjured) to maintain safe distances and land crits for Life Orbs. Balance healing with damage output, often prioritizing <b>Allied Inspiration</b> on Duelists. Use <b>Spore Slumber</b> to disrupt high-priority targets or protect allies. Use her ultimate aggressively for pushes or to counter enemy ultimates. Effectiveness heavily relies on landing crits. She functions best as an off-healer paired with a main healer. Effects of Healing Flower and Allied Inspiration can now stack (up to a max duration).</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Disable & Eliminate Combo:</u></b><br>Use <b>Spore Slumber (Shift)</b> to put a high-priority target to sleep → Immediately apply <b>Allied Inspiration (E)</b> to a teammate who can then focus fire on the sleeping enemy for a potential quick elimination.<br><br></li>\n  <li><b><u>Self-Empowered Offense:</u></b><br>Consume a Life Orb with <b>Natural Anger (F)</b> to boost your own damage output. Use this to help secure kills or apply significant pressure on vulnerable targets.<br><br></li>\n  <li><b><u>Ultimate Damage Boost Combo:</u></b><br>Apply <b>Allied Inspiration (E)</b> to a Duelist teammate right before they activate their ultimate ability. This significantly amplifies their damage potential during their ultimate.<br><br></li>\n  <li><b><u>Sustained Healing Support:</u></b><br>Use <b>Healing Flower (RMB)</b> on multiple allies who are taking damage, consuming Life Orbs to provide them with a consistent healing over time effect.<br><br></li>\n  <li><b><u>Ultimate Offensive/Defensive Use (Soul Resurgence - Q):</u></b><br>During a team push, activate your ultimate, then use <b>Natural Anger (F)</b> for self-damage, and spam <b>Allied Inspiration (E)</b> on key damage dealers while continuing to fire <b>Life Energy Blast (LMB)</b> for orb generation and damage/healing.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Teams with high-damage Duelists (amplifies their output with <b>Allied Inspiration</b>). Opponents vulnerable to hard CC (<b>Spore Slumber</b> can disable many Duelists/Strategists). Teams lacking strong burst healing (her sustained support and damage boosts can provide an edge). Enemy teams with key targets vulnerable to <b>Spore Slumber</b> (e.g., Vanguards, enemy healers).<br><br></li>\n  <li><b>Challenging Against:</b> Teams with strong AoE damage (can hit her in the backline). Heroes with extreme burst damage (may kill before healing reacts). Opponents skilled at denying crits (hinders Life Orb generation). Teams with multiple high-sustain healers. Heroes who can easily reveal her position or counter Spore Slumber (e.g., CC immunity). Her base health was reduced in S2, making her squishier.<br><br></li>\n  <li><b>Key Synergies:</b> Team-Up with <u>Adam Warlock</u> (<b>Nature's Soul</b>) grants both cocooned revival. Best paired with a dedicated main healer.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Significant Damage Potential (for a Strategist):</b> Especially with <b>Natural Anger (F)</b> boosting her own damage.</li>\n  <li><b>Powerful Ally Damage Boost:</b> <b>Allied Inspiration (E)</b> provides a substantial damage increase to a targeted ally.</li>\n  <li><b>Effective Hard Crowd Control:</b> <b>Spore Slumber (Shift)</b> can disable key enemy targets with a sleep effect.</li>\n  <li><b>Impactful Team Ultimate:</b> <b>Soul Resurgence (Q)</b> offers AoE healing, HoT, movement speed, and bonus health conversion.</li>\n  <li><b>Enhanced Mobility (Passive):</b> <b>Nature's Favor</b> grants a speed boost when uninjured.</li>\n  <li><b>Resource Generation via Crits:</b> Landing crits with <b>Life Energy Blast (LMB)</b> allows for frequent ability use.</li>\n  <li><b>Stacking Buffs/Heals (S2):</b> <b>Healing Flower</b> and <b>Allied Inspiration</b> effects can now stack up to a max duration.</li>\n  <li><b>Team-Up Survivability:</b> Synergy with <u>Adam Warlock</u> offers mutual revival potential.</li>\n</ul>",
    "weaknesses": [
      "Has very limited mobility tools, being frail if overwhelmed.",
      "Lacks burst healing outside of her Ultimate.",
      "Enemies can attack her illusion during Spore Slumber, which when destroyed breaks the stun.",
      "The illusion has low health.",
      "Nature's Soul has a very long cooldown of 120 seconds."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Psychic Sister",
        "description": "As Mantis, assist Psylocke in landing 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Victory in Bloom",
        "description": "As Mantis, assist allies in achieving a team wipe.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Life energy is a powerful weapon against evil.\"",
    "ingame_bio_text": "Mantis uses her impressive mental abilities and her penchant for plant control to anchor any team she fights alongside. Her powers tap into a limitless flow of life energy, gently nourishing everything she touches.",
    "ingame_story_intro": "Mantis always knows exactly how you're feeling, thanks to her strong empathic powers. Her alien ability to alter the emotions of others comes in handy on the battlefield, but Mantis only finds true happiness for herself when she is with her fellow Guardians of the Galaxy. After being captured by the Collector and put on display at his theme park, Mantis managed to escape with the help of her fellow captives, Sai and Jeff. Now, Mantis travels the spaceways in hopes of reuniting with her team, while welcoming other displaced souls into the Guardians' found family.",
    "hero_stories": [
      {
        "title": "Mantis' Fled",
        "content": "The Collector found her in his Museum and asked her where she had come from. Mantis did not know. One moment she had been with her fellow Guardians and the next... \"Fascinating,\" the Collector said. \"There is about to be a vacancy. I hope you last longer...\"",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Mantis was released as the 16th character to be introduced to Marvel Rivals as a Strategist hero.",
          "Added 3 new costumes: Knowhere Corp, Guardians of the Galaxy Vol. 3, and Galactic Wings.",
          "Added the Victory in Bloom achievement.",
          "Added to the Guardian Revival Team-Up Ability with Adam Warlock and Star-Lord."
        ]
      },
      {
        "date_version": "25/01/08",
        "changes": [
          "Fixed a visibility issue that could sometimes occur when Adam Warlock/Mantis/Star-Lord were in soul form within the mist on Wakanda maps where they couldn't see or be seen by others."
        ]
      },
      {
        "date_version": "25/01/10: Version 20250110 / Season 1: Eternal Night Falls Launch",
        "changes": [
          "Reduce Nature's Favor movement boost from 2.5m/s to 1.5m/s."
        ]
      },
      {
        "date_version": "25/01/17",
        "changes": [
          "Added 1 new costume: Jade Maiden."
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Reduce base health from 275 to 250.",
          "Effects of Healing Flower and Allied Inspiration can be stacked, up to a maximum of 16 seconds.",
          "Added 1 new costume: Flora Maiden (unlocked from the Cerebro Database season missions)"
        ]
      },
      {
        "date_version": "25/04/30: Version 20250430",
        "changes": [
          "Increase the hit damage of Life Energy Blast from 50 to 55."
        ]
      }
    ],
    "official_quote": "\"Evil is a rejection of life. Thus, I am a guardian against evil.\"",
    "official_description": "Mantis is a Strategist hero in Marvel Rivals, and is the 16th hero introduced to the game's roster. She has a team-up ability that works in conjunction with Adam Warlock and Star-Lord."
  },
  "background": {
    "real_name": "Mantis",
    "aliases": [
      "Celestial Madonna"
    ],
    "birthplace": "Pama Temple, Huế, Vietnam",
    "birthdate": null,
    "gender": "Female",
    "eye_color": "Black",
    "hair_color": "Black",
    "relatives": [],
    "affiliation": [
      "Guardians of the Galaxy"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Able to control Life Energy",
      "Emotion Manipulation",
      "Sleep Manipulation",
      "Empathic abilities",
      "Skilled Martial artist"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Mantis%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "53.10%",
    "wr_change": "+1.03%",
    "pick_rate": "11.69%",
    "pr_change": "-1.78%",
    "ban_rate": "0.06%",
    "matches": "174,045"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}