{
  "name": "Psylocke",
  "role": "Duelist",
  "stats": {
    "health": 250,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#3B82F6",
    "color_theme_secondary": "#7E22CE"
  },
  "abilities": [
    {
      "name": "PSIONIC CROSSBOW",
      "keybind": "LMB",
      "type": null,
      "description": "Unleash bolts with psionic crossbows to damage enemies and reduce the cooldowns of all her abilities.",
      "casting": "Double projectile hitscan with spread",
      "damage": "12 per bolt",
      "damage_falloff": "Falloff begins at 15m, decreasing to 60% at 30m",
      "fire_rate_interval": "0.2/s per cast, 0.6/s between casts",
      "ammo": 16,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Each successful hit decreases the cooldown of all her abilities by 0.25 seconds. CROSSHAIR SPREAD - 0.2m after 10m"
    },
    {
      "name": "WING SHURIKENS",
      "keybind": null,
      "type": null,
      "description": "Launch a volley of psionic shurikens that stick to enemies, dealing damage and granting herself Bonus Health. Press again to recall the shurikens.",
      "casting": "Projectile that fires in a straight trajectory.",
      "damage": "8 per Shuriken - 14 on recall",
      "damage_falloff": "Falloff begins at 15m, decreasing to 80% at 25m",
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": null,
      "projectile_speed": "120m/s",
      "charges": null,
      "duration": "3s before recall",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "If all five shurikens hit the same target, it deals massive damage. Successful hits grant Psylocke a small amount of bonus health per shuriken landed. SPREAD ANGLE - 0.86°. Shurikens travel towards crosshair when recalled before returning to Psylocke"
    },
    {
      "name": "PSI-BLADE DASH",
      "keybind": "SHIFT",
      "type": null,
      "description": "Dash forward and slice through enemies along the path with psionic blades.",
      "casting": null,
      "damage": 50,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s per charge",
      "range": null,
      "projectile_speed": null,
      "charges": 2,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "This ability has two charges. MAXIMUM DISTANCE - 12m. AVERAGE SPEED - 43m/s. Casting this ability will automatically recall Wing Shurikens. The Shurikens will first travel to Psylocke's starting position before returning to her."
    },
    {
      "name": "PSYCHIC STEALTH",
      "keybind": "E",
      "type": null,
      "description": "Enter stealth and gain a Movement Boost.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "3s",
      "movement_boost": "50%",
      "energy_cost_details": null,
      "details": "Psylocke is not immune to damage while in Psychic Stealth, and will briefly become visible if damaged while in stealth. When attacked while in stealth, Psylocke will remain in stealth but will briefly become visible for a short duration"
    }
  ],
  "ultimate": {
    "name": "DANCE OF THE BUTTERFLY",
    "keybind": "Q",
    "type": null,
    "description": "Slash nearby enemies with a psionic katana, dealing massive damage.",
    "casting": null,
    "damage": "150 per hit",
    "range": "10m spherical radius",
    "effect": "30% SLOW RATE",
    "duration": "4s",
    "health_upon_revival": null,
    "slow_rate": "30%",
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 2800,
    "details": {
      "new_barrier_check": "Now will check for barriers (including Magneto's Metal Bulwark, Hulk's Indestructible Guard, etc.)"
    }
  },
  "passives": [],
  "teamups": [
    {
      "name": "Mental Projection",
      "partner": [
        "Emma_Frost",
        "Magneto"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": null,
      "cooldown": "30s",
      "range_target": null,
      "special_notes": "Ability: Psychic Echoes",
      "details": "Invisibility Duration: 1s<br/>Duplicate Duration: Up to 5s<br/>Duplicate Damage Reduction: 70%<br/>Duplicate Max Damage Recieved: 150<br/>Special Effect: Upon activation, Psylocke and her Duplicate Illusion become invisible. The damage dealt by the projection is reduced, and it dissipates after taking a specific amount of damage; When the player uses an Ultimate ability, the Duplicate Illusion will auto-shoot the closest enemy target instead"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Psylocke is a highly mobile and elusive flank Duelist, specializing in delivering significant burst damage to key targets before swiftly repositioning or disappearing using <b>Psychic Stealth (E)</b>. Her gameplay emphasizes agility and stealth to infiltrate enemy backlines, primarily targeting vulnerable supports and low-health opponents. She utilizes high ground and off-angles for surprise attacks. Constant mid-range harassment with her <b>Psionic Crossbow (LMB)</b> applies pressure and reduces her ability cooldowns.</p>\n<p>Prioritize eliminating enemy healers. Look for opportunities to 'clean up' kills on damaged enemies. <b>Psi-Blade Dash (Shift - 2 charges)</b> allows rapid engagement and escape; always try to conserve one charge for disengaging. Unpredictable movement is key. Her ultimate, <b>Dance of the Butterfly (Q)</b>, unleashes rapid AoE slashes. Her <b>Wing Shurikens (RMB)</b> provide CC and self-healing (bonus health per hit).</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Stealth Assassination Combo:</u></b><br>Activate <b>Psychic Stealth (E)</b> to approach → Burst with <b>Psionic Crossbow (LMB)</b> and <b>Wing Shurikens (RMB)</b> → Finish/slice through with <b>Psi-Blade Dash (Shift)</b>.<br><br></li>\n  <li><b><u>Shuriken Recall Damage Combo:</u></b><br>Launch <b>Wing Shurikens (RMB)</b> → Immediately <b>Psi-Blade Dash (Shift)</b> through the enemy. The dash automatically recalls the shurikens, hitting the target again on their return path.<br><br></li>\n  <li><b><u>Ultimate Engage (Dance of the Butterfly - Q):</u></b><br>Use <b>Psychic Stealth (E)</b> or <b>Psi-Blade Dash (Shift)</b> to get into a favorable position near multiple enemies → Activate <b>Dance of the Butterfly (Q)</b> for massive AoE damage and slow.<br><br></li>\n  <li><b><u>Cooldown Reduction via Primary Fire:</u></b><br>Frequently use <b>Psionic Crossbow (LMB)</b> on targets. Each hit reduces the cooldown of all her other abilities by 0.25 seconds, enabling more frequent ability use.<br><br></li>\n  <li><b><u>Psi-Blade Dash (Shift) Management:</u></b><br>Use one charge to engage or reposition offensively, but always try to keep the second charge available for a quick escape or follow-up maneuver.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Healers (Strategists) due to her stealth, mobility, and burst. Isolated targets. Less mobile Duelists who struggle to track or escape her.<br><br></li>\n  <li><b>Challenging Against:</b> <u>Mantis</u> (Spore Slumber shuts her down). <u>Luna Snow</u> (freeze effects interrupt mobility). <u>Magik</u> (can match mobility and burst). Heroes with strong CC that negates her agility. Tightly grouped teams (harder to find isolated targets). <u>Namor</u> (Monstro Spawns hinder safe engagement).<br><br></li>\n  <li><b>Key Synergies:</b> Team-Up with <u>Emma Frost</u> (<b>Psychic Echoes</b>) creates illusory projections to confuse enemies. Her previous team-up with <u>Magik</u> was removed in S2.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Exceptional Burst Damage:</b> Can quickly eliminate vulnerable targets with combos.</li>\n  <li><b>Superior Mobility:</b> <b>Psi-Blade Dash (Shift - 2 charges)</b> allows rapid map traversal, engagement, and escape.</li>\n  <li><b>Infiltration & Escape (Psychic Stealth - E):</b> Grants invisibility and movement speed for approaches or disengages.</li>\n  <li><b>CC & Self-Heal (Wing Shurikens - RMB):</b> Shurikens stick to enemies for CC and grant bonus health per hit.</li>\n  <li><b>Ability Cooldown Reduction:</b> <b>Psionic Crossbow (LMB)</b> hits reduce all ability cooldowns.</li>\n  <li><b>Powerful AoE Ultimate:</b> <b>Dance of the Butterfly (Q)</b> deals massive damage and slows in a wide area.</li>\n  <li><b>Effective Flanker & Assassin:</b> Excels at bypassing frontlines to target vulnerable backliners.</li>\n  <li><b>Unpredictable Movement:</b> High mobility makes her a difficult target to track and hit.</li>\n</ul>",
    "weaknesses": [
      "Unlike other highly mobile heroes, Psylocke has no access to any form of double jump or wall running.",
      "Very vulnerable if both her Psi-Blade Dash and Psychic Stealth are on cooldown.",
      "Can struggle to deal damage against enemies in movement and from long distances, since her primary and secondary fire are multi-hit spread attacks.",
      "Psylocke is not immune to damage while in Psychic Stealth, and will briefly become visible if damaged while in stealth."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Jian and Katana",
        "description": "As Psylocke, partner with Iron Fist to land 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Way of the Butterfly",
        "description": "As Psylocke, contest the mission area for 60 seconds in a single match.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"My ōdachi's sharp. My mind is sharper.\"",
    "ingame_bio_text": "The psychic warrior known as Sai has the Mutant ability to conjure a variety of weapons with the power of her mind. Gracefully gliding across the battlefield, this trained ninja can shatter the enemy's defenses with a single thought.",
    "ingame_story_intro": "\"🦋She was ripped from her reality by the Timestream Entanglement. Now, the formidable feudal warrior Psylocke is ready to strike in Marvel Rivals! With her psionic energy, Sai manifests a wide array of weapons, from crossbows to shurikens, while skillfully hunting down her enemies. Only the butterfly's wingbeat can be heard when the last of her foes falls to her odachi.\"",
    "hero_stories": [
      {
        "title": "Acanti Tales",
        "content": "Then.\nSai stood at the edge of the ancient forest and watched it burn. She had not wanted to leave so much destruction in her wake, but the stoic warrior knew all too well that, when Demons rise, sometimes there is no other option but to reduce the world to ash.\n...\nNow.\n\"What's on your mind?\"\nMantis\nasked Sai.\n...\nBefore they could reach Wakandan space, however, Mantis intercepted a distress call from her fellow Guardians of the Galaxy — Star-Lord, Rocket, and Groot. Their ship had crashed on a alien world called Klyntar, home to a species almost as parasitic as the Brood. Mantis knew where she had to go next, and it wasn't Wakanda.\nSai and Jeff were prepared to join Mantis on the next leg of her journey when Sai suddenly heard a new cry echoing in her head. A powerful voice unlike any she had ever heard before. Strange... but so familiar... it uttered four simple words:\n\"To me, my X-Men.\"\nThough she did not know what the words meant, she knew that she would have no choice but to answer the call. As images of a living island on the other side of the universe filled her mind, Sai could feel in her soul that this mysterious place was home to others just like her... and it might finally be the key to getting her back home again.",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Psylocke was released as the 26th character to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 2 new costumes: Kirisaki Sakura and Vengeance.",
          "Added the Way of the Butterfly achievement.",
          "Added to the Dimensional Shortcut Team-Up Ability with Magik and Black Panther."
        ]
      },
      {
        "date_version": "25/01/10: Version 20250110 / Season 1: Eternal Night Falls Launch",
        "changes": [
          "Now Dance of the Butterfly will check for barriers (including Magneto's Metal Bulwark, Hulk's Indestructible Guard, etc.)."
        ]
      },
      {
        "date_version": "25/01/31",
        "changes": [
          "Added 1 new costume: Blood Kariudo."
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "Reduced the Rewind Time for Psionic Disc from 5s to 3s.",
          "Additionally, the conversion ratio of lost health to blue armor will be increased from 0.5 to 0.8."
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Added to the Mental Projection Team-Up Ability with Emma Frost and Magneto, but removed from the Dimensional Shortcut with Magik and Black Panther.",
          "Added 1 new costume: Retro X-Uniform."
        ]
      },
      {
        "date_version": "25/04/18",
        "changes": [
          "Added 1 new costume color for Vengeance: Purple Phantom."
        ]
      },
      {
        "date_version": "25/04/25: Version 20250425 / Giant-Size Brain Blast Event",
        "changes": [
          "Fixed a glitch where Psylocke's Wing Shurikens would sometimes lose damage after striking Loki's arm. Now, with the trickster god kept in check, her psionic shurikens strike with all the precision and brilliance of a ninja!"
        ]
      }
    ],
    "official_quote": "\"Enemies can become friends, but only if we show our foes respect.\"",
    "official_description": "Psylocke is a Duelist hero in Marvel Rivals, and is the 26th hero introduced to the game's roster. She has a team-up ability that works in conjunction with Emma Frost and Magneto."
  },
  "background": {
    "real_name": "Sai (サイ)",
    "aliases": [
      "Mutant Yokai Slayer"
    ],
    "birthplace": "Edo, Japan",
    "birthdate": "1839 (presumed)",
    "gender": "Female",
    "eye_color": "Blue",
    "hair_color": "Purple",
    "relatives": [
      "Logan"
    ],
    "affiliation": [
      "X-Men"
    ],
    "first_appearance_comic": "Demon Days: X-Men #1",
    "recommended_comics": [],
    "lore_powers_skills": [
      "Psionics",
      "Telepathy",
      "Telekinesis",
      "Telekinetic invisibility",
      "Psychic construct creation",
      "Expert martial artist"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Psylocke%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "48.84%",
    "wr_change": "-0.29%",
    "pick_rate": "12.37%",
    "pr_change": "-0.70%",
    "ban_rate": "1.09%",
    "matches": "184,313"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}