{
  "name": "Spider-Man",
  "role": "Duelist",
  "stats": {
    "health": 250,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#DC2626",
    "color_theme_secondary": "#F87171"
  },
  "abilities": [
    {
      "name": "SPIDER-POWER",
      "keybind": "LMB",
      "type": "Melee",
      "description": "Swing fists forward to strike, dealing extra damage to the enemy with a Spider-Tracer.",
      "casting": null,
      "damage": "The first two strikes deal 25 damage, while the third strike deals 40 damage (damage increases for one strike when hitting with Spider-Tracer)",
      "damage_falloff": null,
      "fire_rate_interval": "The first two strikes have an interval of 0.37s between them, while the third strike has a 0.82s interval from the second strike",
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "The first two strikes can hit up to 3m, while the third strike can hit up to 4m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "CYBER-WEB CLUSTER",
      "keybind": "RMB",
      "type": null,
      "description": "Shoot a Web-Cluster that deals damage and attaches a Spider-Tracer to the hit enemy.",
      "casting": "Projectile that fires in a straight trajectory",
      "damage": "30 (consuming Spider-Tracer with another ability deals a further 45)",
      "damage_falloff": "Falloff begins at 20m, decreasing to 50% at 40m",
      "fire_rate_interval": null,
      "ammo": 5,
      "critical_hit": false,
      "cooldown": null,
      "range": null,
      "projectile_speed": "120 m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "WEB-SWING",
      "keybind": "SHIFT",
      "type": "Dash",
      "description": "Shoot a strand of webbing to swing.",
      "casting": "Dash",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "6s per charge",
      "range": "30m",
      "projectile_speed": null,
      "charges": 3,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "If the Easy Swing setting is off, the player can perform a Web Zip with this ability by aiming at a surface below them."
    },
    {
      "name": "GET OVER HERE!",
      "keybind": "E",
      "type": null,
      "description": "Shoot webbing to reel in the hit enemy. If the enemy is tagged with a Spider-Tracer, Spider-Man will get pulled to them instead.",
      "casting": "Projectile that fires in a straight trajectory",
      "damage": "Pull: 25\nWeb Strike: 50",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": "Pull: 20m\nWeb Strike: 24m",
      "projectile_speed": "80 m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "If the target is marked by a Spider-Tracer, the player can perform a Web Strike that automatically locks onto the enemy."
    },
    {
      "name": "AMAZING COMBO",
      "keybind": "F",
      "type": "Melee",
      "description": "Launch an enemy upward, dealing extra damage to the enemy with a Spider-Tracer.",
      "casting": "Melee",
      "damage": "55 (damage increases for one strike when hitting with Spider-Tracer)",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "2s",
      "range": "4m spherical radius",
      "projectile_speed": null,
      "charges": 2,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "THWIP AND FLIP",
      "keybind": "SPACE",
      "type": null,
      "description": "Perform a double jump.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Can only be cast again after landing"
    },
    {
      "name": "WALL CRAWL",
      "keybind": "SPACE",
      "type": null,
      "description": "Press Space to wall crawl, and while crawling, left-click to sprint.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "SPIDER-SENSE",
      "keybind": null,
      "type": "Passive",
      "description": "Give a warning of enemies that have been around.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "8m spherical radius",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    }
  ],
  "ultimate": {
    "name": "SPECTACULAR SPIN",
    "keybind": "Q",
    "type": "Spherical Spell Field",
    "description": "Launch Web-Clusters all around to damage and Stun enemies.",
    "casting": "Spherical Spell Field",
    "damage": "12 per hit",
    "range": "8m spherical radius",
    "effect": "Striking an enemy applies a stacking -3% Slow effect for 1 second, and after reaching 20 hits, the enemy will be Stunned for 1.5s.",
    "duration": "2.4s",
    "health_upon_revival": "Bonus Health: 250",
    "slow_rate": "-3%",
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 2800,
    "details": null
  },
  "passives": [],
  "teamups": [
    {
      "name": "ESU Alumnus",
      "partner": [
        "Squirrel_Girl"
      ],
      "effect": null,
      "keybind": "Passive",
      "teamup_bonus": "10% Damage Boost",
      "duration": null,
      "cooldown": null,
      "range_target": null,
      "special_notes": "Role: Anchor | Ability: Extra Web-Fluid",
      "details": null
    },
    {
      "name": "Symbiote Bond",
      "partner": [
        "Peni_Parker",
        "Venom"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": "1.3s",
      "cooldown": "30s",
      "range_target": "5m spherical radius",
      "special_notes": "Ability: Suit Expulsion",
      "details": "Casting: Spell field that surrounds the caster<br/>Attack Interval: 1 hit per second; max 2 hits is possible<br/>Damage: 50 damage per strike<br/>Special Effect: Become invincible while the ability is active"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Spider-Man is an exceptionally mobile Duelist thriving on disrupting the enemy backline and securing swift eliminations, especially on healers. His gameplay revolves around <b>Web-Slinging (Shift - 3 charges)</b> for rapid traversal and engaging priority targets. His <b>Spider-Power (LMB)</b> melee combo deals bonus damage to enemies marked by a <b>Spider-Tracer</b> (applied by <b>Web-Cluster - RMB</b>, 5 charges). His ultimate, <b>Spectacular Spin (Q)</b>, unleashes AoE Web-Clusters, damaging and stunning (stacking slow) enemies.</p>\n<p>Employ aggressive flanking maneuvers, using <b>Web-Swing</b> to bypass frontlines and target vulnerable backliners. Utilize high ground and wall-running for unpredictable angles. <b>Get Over Here! (E)</b> pulls traced enemies or pulls Spider-Man to untraced targets. <b>Amazing Combo (F)</b> launches traced enemies for high damage. <b>Thwip And Flip (Space)</b> provides a double jump. Create chaos behind enemy lines, then quickly disengage to reset cooldowns. Master advanced movement like 'B-Hopping' for sustained high speed.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Standard Dive Combo:</u></b><br><b>Web-Swing (Shift)</b> to approach → <b>Web-Cluster (RMB)</b> to apply Spider-Tracer → <b>Get Over Here! (E)</b> to pull traced enemy → <b>Spider-Power (LMB)</b> melee attacks. Use <b>Spectacular Spin (Q)</b> for AoE stun/damage if needed.<br><br></li>\n  <li><b><u>Advanced Aerial Combo (vs. less mobile):</u></b><br>Uppercut (from LMB combo) → Animation cancel with <b>Web-Cluster (RMB)</b> → Overhead Slam (LMB combo) → Jump (Space) → Second Overhead Slam → Finish with <b>Web-Cluster (RMB)</b>.<br><br></li>\n  <li><b><u>'Fishing' Combo:</u></b><br><b>Get Over Here! (E)</b> to pull → Uppercut (LMB combo) → <b>Web-Cluster (RMB)</b> → Overhead Slam (LMB combo). Consider Swing Cancel after Get Over Here! for faster execution.<br><br></li>\n  <li><b><u>Venom Team-Up Finisher (Suit Expulsion - C):</u></b><br>Apply <b>Web-Cluster (RMB)</b> → <b>Get Over Here! (E)</b> to pull close → <b>Amazing Combo (F)</b> to launch → Activate <b>Suit Expulsion (C)</b> for invulnerable burst damage.<br><br></li>\n  <li><b><u>High-Mobility Engagement ('B-Hopping'):</u></b><br><b>Web-Swing (Shift)</b> → Before swing completes, normal web shot (LMB) to cancel swing animation → Immediately Jump (Space) to retain momentum. Repeat for sustained speed.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Strategists (healers) with limited mobility. Duelists with low mobility or predictable movement. Heroes channeling abilities/ultimates (<b>Get Over Here!</b> interrupts). Can contest airborne targets like <u>Iron Man</u>, <u>Storm</u>, <u>Star-Lord</u> with skilled play.<br><br></li>\n  <li><b>Challenging Against:</b> Accurate long-range hitscan heroes (e.g., <u>Hawkeye</u>, <u>The Punisher</u>) who can punish Web-Swings. Strong crowd control (stuns/roots). Opposing <u>Squirrel Girl</u> (her Web Bomb from your team-up can immobilize you). <u>Iron Fist</u> (parry, chase potential, strong close-range damage). A skilled <u>Venom</u> (can out-brawl in direct fights).<br><br></li>\n  <li><b>Key Synergies:</b> <b>Suit Expulsion</b> Team-Up with <u>Venom</u> for a potent, invulnerable burst. <b>Extra Web-Fluid</b> Team-Up with <u>Squirrel Girl</u> grants her a Web Bomb for AoE stun, indirectly supporting dives.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Exceptional Mobility:</b> <b>Web-Swing (Shift)</b>, double jump, and wall-running allow unmatched traversal and engagement angles.</li>\n  <li><b>High Burst Damage Potential:</b> Capitalizes on Spider-Tracer damage amplification for quick eliminations.</li>\n  <li><b>Effective Backline Assassin:</b> Excels at isolating and eliminating high-priority healers and supports.</li>\n  <li><b>Highly Disruptive:</b> Presence behind enemy lines forces opponents to react and divert resources.</li>\n  <li><b>Powerful Team-Up Options:</b> Synergies with <u>Venom</u> and <u>Squirrel Girl</u> enhance kill potential and utility.</li>\n  <li><b>Targeted Crowd Control:</b> <b>Get Over Here! (E)</b> pulls and interrupts; <b>Amazing Combo (F)</b> launches.</li>\n  <li><b>AoE Stun Ultimate:</b> <b>Spectacular Spin (Q)</b> damages and stuns grouped enemies.</li>\n  <li><b>High Skill Ceiling:</b> Advanced movement and combo mastery make him a formidable threat.</li>\n</ul>",
    "weaknesses": [
      "Despite being very mobile and hard to pin down, Spider-Man is very frail and needs proper skill to be played, since he has no defensive or self-sustain tools. Diving into the enemy backline recklessly can be fatal if his Strategists cannot reach him.",
      "His damage output is not very high unless he attaches a Web-Tracer to the target.",
      "The GET OVER HERE! ability can fail if the enemy goes into cover.",
      "Can be interrupted during Spectacular Spin."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Web, White, and Blue",
        "description": "As Spider-Man, partner with Captain America to land 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Spider-Sense Tingling!",
        "description": "As Spider-Man, detect a enemy with Spider-Sense and land a winning counterattack.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"I'm your friendly neighborhood Spider-Man. Only my neighborhood is now like multiple realities, cool right?\"",
    "ingame_bio_text": "Swinging around the arena on his signature weblines, your friendly neighborhood Spider-Man, AKA Peter Parker, catches his rivals by surprise with sneaky, sticky bursts of webbing and unexpected attacks from above. Look out… here comes the Spider-Man!",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Unfriendly Neighborhood",
        "content": "Every week or so, Peter Parker swung uptown from his usual haunts to the Manhattan side of the Queensboro Bridge, looking across toward home. And every week, there was still no way to get there. There were too many vampires patrolling the bridge, and other horrific monsters flying over it. Dracula had taken Manhattan all for himself, and he wasn't letting any of his human \"playthings\" escape.\n\nStill Peter came by to look, wishing he could talk to Aunt May, Every Wednesday. That's when he missed Aunt May the most, because ever since he'd moved out of her house, he'd always tried to get back to see her for lunch on Wednesdays.\n\nToday, he was staying a little farther away from the bridge, watching it from the Midtown Tunnel's ventilation tower, a mile downstream past the U.N. headquarters. It was a quiet place for contemplation, since the huge fans were no longer running. He had cased the area for vampires before letting himself have his weekly moment of regret and longing for a world before the Timestream Entanglement. Before the vampires had taken over New York. Before he had lost track of the days since he'd seen the sun.\n\nGazing at the bridge under the dead eye of the Blood Moon, Peter was lost in his head, thinking about two things at once:\n\nOne, he was frustrated about not being allowed to help out with the construction of the Timestream Reintegration Device that Reed Richards and Tony Stark had been working on. For some reason, they felt Peter would be more useful swinging through the streets and webbing up vampires as Spider-Man than contributing his own brand of scientific expertise to their little super-genius think tank.\n\nTwo, he was remembering when he had been here the week before, about the same time - although it was hard to know what time it was when the sun never came up and the moon always hung full over the river. He'd been wishing he could see Aunt May, just like tonight, when he noticed a twinkling in the air, just in front of him. It got a little brighter,  and a folded piece of paper appeared out of nowhere, pinched between two fingers. The hand disappeared and the pieced of paper drifted down to rest on Peter's right knee.\n\nHuh, he thought. That didn't happen ever day.\n\nHe unfolded the paper and read:\n\nPeter,\n\nThe Master Weaver told me to find you and tell that the Web of Life and Destiny needs you. I will reach out again when it is time for you to come here. That time will be soon.\n\nSpider-Zero\n\nSpider-Zero? Master Weaver? Peter had never of either, nor did he have any idea what the Web of Life and Destiny might be. But this was the day he would finally find out. As he silently gazed toward Queens, a portal popped open next to him. A young woman was on the other side.\n\n\"So... I'm guessing you're Spider-Zero, eh?\" Peter said. \"Do you happen to have an actual real-person name?\"\n\nShe ignored his question. \"We need you, Peter. The Web of Life and Destiny needs you.\"\n\n\"I don't-\" Peter paused for a moment before saying what he really meant.  \"I belong here.\"\n\n\"Spider-Man belongs everywhere,\" Spider-Zero responded, cryptically. \"Come with me and I'll show you.\"\n\nPeter didn't want to go through the portal. Something told him it would be hard to get back, for any number of possible reasons, and he couldn't take the chance. So instead, Spider-Zero showed him the Web of Life and Destiny through the rift. The night sky beyond it blazed with portals and stars. The city below it-so, so far below it- was a dark splendor of neon-lit towers and shadow, extending to the horizon in every direction.\n\n\"See, Peter? This is your destiny.\" Spider-Zero said. \"Our destiny. If the Web fails, all Spider-People will disappear. Including you. And not too long after that, reality comes a part. The Web is what holds it all together.\"\n\nHis gut told him to leap into action and save the universe, but in his heart, Peter knew that he had to say no. At least for now, His city needed him more.\n\n\"If things get worse, you know where to find me,\" he said. \"I'll try to come and help, but New York is my home. I belong here.\"\n\nSpider-Zero didn't press him further, but she did say she would be coming back. Peter didn't argue.\n\nAs the portal faded away, Peter started thinking that the Web might be like the model of the universe Tony Stark had talked about, with dimensions wrapped up in tight strings that vibrated through space-time and intersected, well, like a web. Peter knew a little about string theory, but the way Tony talked about space-time when he and Reed were working out the math for the TRD? That was just a bit beyond Peter's reach. He could see what it was the same way he could see what Arthur Douglas was doing on the saxophone. Actually doing it himself was a whole other level. Peter was a bit crestfallen at having to admit this to himself, but hey, at least he still streets to patrol and citizens to save from vampires and other creatures of the night.\n\nCould be worse.\n\n“There you are!” a more familiar voice called out, snapping Peter back into reality. He glanced up to see Johnny Storm - the Human Torch -rapidly approaching, fully flame-on.\n\n”No more sitting here and moping about how much you miss Aunt May’s wheatcakes, Petey,” Johnny said. “We’ve got work to do!”\n\n”Didn’t we just defeat a Deviant Mutate together, like, an hour ago?” Peter asked. The two heroes had long been best friends and had enjoyed countless team-ups over the years, but the frequency of their joint missions together had increased exponentially since the city had fallen under the curse never-ending night.\n\n“That’s already old news,” Johnny laughed. “I’ve incinerated at least a dozen more vamps since then all on my lonesome. But Reed just sent me some juicy new intel that’s gonna blow your mind!”\n\n”Please don’t let it be a vampire Galactus…” Peter muttered nervously under his breath.\n\n”Way better,” Johnny said with a confident smile. “Blade finally showed up!”\n\n”Blade?!” Peter said with genuine surprise. The vampire hunter had been mysteriously missing-in-action ever since Dracula’s hordes first descended upon the island of Manhattan. Peter breathed a sigh of relief, knowing that Blade’s expertise in battling vampires could really help the heroes turn the tied back in their favor. It was almost too good to be true!\n\n“Squirrel Girl’s crew claims to have seen him in Central Park twenty minutes ago,” Johnny continued, beginning to fly toward the center of the city. “We have to find him… before you-know-who does!”\n\nPeter immediately leapt from his perch, spinning a strand of webbing and swinging after the Human Torch. Johnny was moving fast, but Peter could easily follow the trail of flame that his friend left in the air behind him.\n\nAs the duo descended to the southeast corner of Central Park, they couldn’t believe their eyes. There he was: a half-man, half-vampire warrior clad in all black, grinning as he furiously swung his swords at a group of oncoming vampires. His sharp fangs glinted in the light of the Blood Moon. There was no doubt about it. This was Blade, the legendary Daywalker. And, suddenly, both Peter and Johnny felt a lot more hope.\n\n”You just gonna stand there starin’, boys?” Blade asked, not even looking from his foes. “Or are you gonna help me take down these damn fangers?”\n\n”Oh, yeah! Sorry!” Peter said, leaping into action, rapidly shooting a barrage of webs at the feet of the vampire horde. “I just don’t think either of us expected to see you here.”\n\n“You and me both,” Blade mused. “Been on a secret recon mission tryin’ to figure out how the hell Dracula made New York his new turf.”\n\n”Any luck?” Johnny asked.\n\n”Found a few leads,” Blade said, his tone instantly becoming much more serious, “But they all sounded a bit hard to believe.”\n\n”Says the guy currently in a sword fight with vampires,” Spidey jested. Blade didn’t even crack a smile. But, to be fair, he didn’t have much reason to.\n\nAs much as Blade hated vampires, vampires has always hated Blade right back. Not only because he was constantly hunting them down and ending their immortality early, but also because they were extremely jealous of him. Blade had something that no other vampire had - the ability to survive in the sunlight. Peter worried that fact alone would make his friend Dracula’s Most Wanted.\n\nSee, even though the city was shrouded  in darkness for the moment, Dracula had to know that his little ploy wouldn’t last forever. If he could use this opportunity to find a more permanent solution to his brood’s limitations, however - a solution that was likely to be found in Blade’s hybrid blood - then he wouldn’t need to rely on a Empire of Eternal Night anymore. No matter the time of day, vampire would rule the city… and, eventually, the world…\n\nAs Peter pondered the chilling possibilities, he continued to web shut fang-filled mouths as swiftly as he could. Meanwhile, Johnny and Blade were busy using more lethal methods to eliminate their undead attackers. Johnny unleashed powerful bursts of superheated plasma to incinerate the vampire soldiers, while Blade effortlessly sliced his foes into bits with his swords. Peter tried not to throw up in his mask, both from the sight and the smell. Soon, the chaos subsided and the three heroes were the only men left standing.\n\n”Was that it?” Peter asked, well aware of the mistake he had just made the second words left his lips. His spider-sense immediately let him know that even greater danger lurked nearby. Classic Parker luck.\n\n”Calm before the storm,” Blade said knowingly.\n\n”Indeed”, a sinister voice responded as Dracula himself stepped out of the shadows, his blood red cape gently swaying in the breeze.\n\n”Dracula?” Johnny exclaimed, almost excited. The lord of the vampires had rarely left his castle since this nightmare began. “Big mistake showing your pastry face in public, pal!”\n\nThe Human Torch released an enormous burst of flames in Dracula’s direction, but the vampire king dodged out of the way uncanny speed. Peter unloaded burst after burst of webbing toward Dracula as well, but fared no better when it came to hitting his target. Their foe was far too fast.\n\n“Takes a vamp to beat a vamp,” Blade said, raising both of his swords as he pushed between his new allies and lunged at Dracula.\n\"You speak true,\" Dracula responded as he unsheathed his two ornate swords and met Blade in combat. \"And since you are only half a vampire, it is clear who shall claim victory.\"\n\nSparks flew as metal clashed. For every thrust of Blade's weapons, Dracula had a perfect counterattack that left the vampire hunter growling with frustration. Despite Blade's undeniable combat skill, Spidey could see that the Daywalker was out-matched. The hunter was about to become the prey if Peter didn't do something fast.\n\n\"Get ready to light it up, Johnny,\" Peter said. His fantastic friend nodded, knowing what to do next.\n\nAs Peter launched another bombardment of web blasts from his wristbands, Johnny produced a wall of flame directly in their path. As the dense balls of webbing passed through the flames, they instantly ignited. The burning projectiles impacted Dracula, setting his cape ablaze and distracting him for a mere moment - a moment Blade eagerly took advantage of.\n\n\"Nice steel you've got there, Vlad,\" Blade said, kicking the legendary Sword of Dracula from his foe's hand. \"Think I'll add 'em to my collection.\" Blade quickly wrenched the smaller yet equally legendary blade from this undead king's claws.\n\n\"And I shall add your hand tom mine!\" Dracula snarled back. Even though he had been disarmed, Dracula still managed to dodge Blade's frenzy of attacks.\n\nWhile the two vampires  clashed, Peter released a heavy spray of webbing at Dracula's feet, stopping him in his tracks for a moment. But just as Spidey swung in to deliver a swift kick to Dracula's pointy teeth, the vampiric villain turned himself into a black mist, freeing himself from the webs and sending Spidey soaring straight through him.\n\n\"Hey, Blade,\" Johnny yelled, \"let's show this jerk how we like our stakes!\"\n\nBlade grabbed a pair of sharp wooden spikes from his bandolier and hurled them through the air, straight at Dracula's heart. Johnny lit up the sharp stakes with two quick bursts of flame as they hurled toward their deadly destination.\n\n\"Well, done,\" Dracula said as he used his lightning - fast reflexes to bat the burning stakes out of the sky split seconds before they could pierce his undead flesh. \"But I prefer my meat bloody.\"\n\nDracula suddenly turned his attention back to Peter, leaping through the air and clutching the hero by the throat.\n\n\"And you will make the perfect appetizer,\" Dracula growled, lifting Peter into the air with one hand. Peter squirmed to break free from the vampire's grip, but to no avail. Peter could feel Dracula's fingers tightening around his larynx. For once, the Amazing Spider-Man was truly speechless. His vision began to cloud with darkness as he gasped for air. Dracula leaned in, his fangs ready to sink into the sinew of Peter's neck.\n\n\"You don't want him,\" Blade said, slicing Dracula from behind with his sword. Dracula loosened his hold and Peter slumped to the ground, gasping. \"It's me you're after.\"\n\nEverything that happened after that was a blur. Peter tried to get to back on his feet and back in the game, but he quickly realized that he never stood a chance against Dracula, even with Blade and the Human Torch on his side.\n\nThe lord of the vampires attacked Peter's friends ferociously, turning himself a giant dragon-like bat and using a flap of his massive wings to extinguish the Human Torch's flames, knocking Johnny unconscious in the process.\n\nAll Peter could do was watch helplessly as Dracula's monstrous form swooped down and grabbed Blade in his claws, lifting the vampire hunter into the air. Despite his efforts, Blade couldn't manage to break free from Dracula's grip. The hideous creature passed in front of the Blood Moon as he dragged his prey back to his castle... and the unspeakable horrors that waited within.\n\nAs everything faded to black, Peter Parker wondered if maybe he should have gone through that portal after all...",
        "status": null
      },
      {
        "title": "Liberation of New York",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      },
      {
        "title": "Spiders are not Insects",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Spider-Man was released as the 4th character to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 4 new costumes: Chasm, Scarlet Spider, Bag-Man Beyond, and Spider-Man: No Way Home.",
          "Added the Spider-Sense Tingling! achievement.",
          "Added to the Symbiote Bond Team-Up Ability with Peni Parker and Venom and the ESU Alumnus Team-Up Ability with Squirrel Girl."
        ]
      },
      {
        "date_version": "24/12/10: Version 20241210",
        "changes": [
          "After equipping the PlayStation bundle's Scarlet Spider costume, restarting the game could cause the costume not display as correctly equipped. This issue has been resolved."
        ]
      },
      {
        "date_version": "25/01/08:",
        "changes": [
          "Resolved occassional synchronization issues for Venom and Spider-Man after swinging and wall-crawling.",
          "Resolved an issue where, while airborne, if Spider-Man used Amazing Combo to interrupt the wind-up of a normal attack, the attack would incorrectly continue and still inflict damage."
        ]
      },
      {
        "date_version": "25/01/30:",
        "changes": [
          "Added 1 new costume: Marvel's Spider-Man 2."
        ]
      },
      {
        "date_version": "25/02/20:",
        "changes": [
          "Fixed an issue where Spider-Man sometimes couldn't use abilities while falling from the top of a wall. The web-slinger can now strike without a hitch--no more sticky situations!"
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "Reduce Web-Cluster energize time from 3s to 2.5s.",
          "Reduce Spider-Man's Suit Expulsion duration from 4s to 1s. Replace the 50% damage reduction effect with a new invincibility effect during the duration."
        ]
      },
      {
        "date_version": "25/03/21:",
        "changes": [
          "Added 1 new costume: Spider-Punk 2099."
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Added 1 new costume: Spider-Oni."
        ]
      },
      {
        "date_version": "25/04/30: Version 20250430",
        "changes": [
          "Decrease the damage range of Amazing Combo from a 5m radius to a 4m radius."
        ]
      }
    ],
    "official_quote": "\"Anybody has a chance to be a hero. I believe that.\"",
    "official_description": "Spider-Man is a Duelist hero in Marvel Rivals, and is the 4th hero introduced to the game's roster. He has team-up abilities that work in conjunction with Squirrel Girl, Peni Parker, and Venom."
  },
  "background": {
    "real_name": "Peter Benjamin Parker",
    "aliases": [
      "The Amazing Spider-Man",
      "Spidey",
      "Web-Head",
      "Wall Crawler"
    ],
    "birthplace": "Queens, New York",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Hazel",
    "hair_color": "Brown",
    "relatives": [
      "Ben Parker (uncle; deceased)",
      "May Parker (aunt)"
    ],
    "affiliation": [
      "Web-Warriors",
      "The Daily Bugle"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Superhuman strength, senses, reflexes, and agility",
      "Preternatural precognitive \"Spider-Sense\"",
      "Skilled hand-to-hand combatant",
      "Web shooters",
      "Wallcrawling"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Spider-Man%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "47.64%",
    "wr_change": "-1.08%",
    "pick_rate": "16.10%",
    "pr_change": "+0.03%",
    "ban_rate": "26.32%",
    "matches": "239,855"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}