{
  "name": "Squirrel Girl",
  "role": "Duelist",
  "stats": {
    "health": 275,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#84CC16",
    "color_theme_secondary": "#F97316"
  },
  "abilities": [
    {
      "name": "BURST ACORN",
      "keybind": "LMB",
      "type": null,
      "description": "Shoot bouncing Burst Acorns",
      "casting": "Arced projectile that generates a spell field upon impact",
      "damage": 110,
      "damage_falloff": "70% falloff at 3m",
      "fire_rate_interval": "1.49 acorns per second",
      "ammo": 10,
      "critical_hit": false,
      "cooldown": null,
      "range": null,
      "projectile_speed": "80 m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "TAIL BOUNCE",
      "keybind": "SHIFT",
      "type": null,
      "description": "Rocket upwards with a bounce of her tail",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "9m",
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "MAMMAL BOND",
      "keybind": "E",
      "type": null,
      "description": "Reload Burst Acorns and can use an ability without cooldown once in a short duration",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "12s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "5s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "SQUIRREL BLOCKADE",
      "keybind": null,
      "type": null,
      "description": "Launch an acorn to unleash Squirrel Guards, Imprisoning the first hit enemy",
      "casting": "Charged projectile with an arced trajectory",
      "damage": 35,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": null,
      "projectile_speed": "20 - 60 m/s (Maximum speed is achieved after 0.7s of charging)",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "IMPRISON DURATION - 1.33s"
    }
  ],
  "ultimate": {
    "name": "UNBEATABLE SQUIRREL TSUNAMI",
    "keybind": "Q",
    "type": null,
    "description": "Summon a horde of squirrels to charge forward, dealing damage while bouncing against structures",
    "casting": null,
    "damage": 150,
    "range": "Length: 3m, Width: 5m, Height: 1.75m",
    "effect": "The squirrels will rush towards the nearest enemy after bouncing instead of bouncing randomly.",
    "duration": "10s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": "9 m/s",
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 2800,
    "details": {
      "SQUIRREL_HORDE_HEALTH": 300
    }
  },
  "passives": [],
  "teamups": [
    {
      "name": "ESU Alumnus",
      "partner": [
        "Spider-Man"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": null,
      "cooldown": "20s",
      "range_target": null,
      "special_notes": "Ability: Webbed Acorn",
      "details": "Casting: Arced projectile that generates a spell field upon impact<br/>Cast Time: 1.1s<br/>Projectile Speed: 50 m/s<br/>Spell Field Range: 4m spherical radius<br/>Spell Field Damage: 80<br/>Imprison Duration: 1s"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Squirrel Girl is a deceptive Duelist excelling at ranged poke, area denial, and disrupting formations with bouncing <b>Burst Acorns (LMB)</b> and CC. Her acorns explode on first bounce for splash damage. <b>Squirrel Blockade (RMB)</b> launches a large acorn that imprisons the first enemy hit (can be charged for speed/range). <b>Tail Bounce (Shift)</b> provides a vertical boost for high ground or escape. <b>Mammal Bond (E)</b> instantly reloads Burst Acorns and allows one ability use without cooldown for powerful combos (e.g., double stun).</p>\n<p>Position in the backline or mid-range, using high ground and corners to maximize acorn bounces and cover. Guard supports from divers and lob acorns into chokes. Her ultimate, <b>Unbeatable Squirrel Tsunami (Q)</b>, summons squirrels that charge, damage, and bounce, now prioritizing the nearest enemy after bouncing (S2). Her mobility with Tail Bounce allows quick repositioning. Master acorn arc and bounces for consistent impact.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Basic Harassment:</u></b><br>Continuously fire <b>Burst Acorns (LMB)</b>, utilizing bounces to hit targets behind cover or in unexpected spots for consistent poke.<br><br></li>\n  <li><b><u>Imprison & Eliminate:</u></b><br>Land a <b>Squirrel Blockade (RMB)</b> to root a target → Quickly follow with 2-3 direct hits from <b>Burst Acorn (LMB)</b> to eliminate squishier enemies.<br><br></li>\n  <li><b><u>Extended Crowd Control (Mammal Bond Combo):</u></b><br><b>Squirrel Blockade (RMB)</b> to root → Activate <b>Mammal Bond (E)</b> → Fire one <b>Burst Acorn (LMB)</b> (optional for damage) → Use <b>Squirrel Blockade (RMB)</b> again (no cooldown due to Mammal Bond) to re-root the target.<br><br></li>\n  <li><b><u>Close-Range Defense/Offense:</u></b><br>If dived, use <b>Tail Bounce (Shift)</b> to gain height. While airborne, fire <b>Burst Acorns (LMB)</b> downwards. Alternatively, near a wall, shoot acorns at the wall to bounce onto an enemy at your feet.<br><br></li>\n  <li><b><u>Ultimate Area Denial (Unbeatable Squirrel Tsunami - Q):</u></b><br>Near a wall or in a confined space, activate <b>Unbeatable Squirrel Tsunami (Q)</b>, aiming for bounces to maximize hits. Follow with <b>Burst Acorns (LMB)</b> as enemies try to escape.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Strategists in the backline (harass with acorns, interrupt with Blockade). Tanks without strong shields/mobility (can root them). Effective at destroying deployables (e.g., <u>Groot's</u> walls, <u>Namor's</u> turrets). Characters with predictable movement.<br><br></li>\n  <li><b>Challenging Against:</b> Highly mobile dive characters (e.g., <u>Spider-Man</u>, <u>Black Panther</u>, <u>Iron Fist</u>) as Squirrel Blockade is hard to land. Tanks with strong shields (e.g., <u>Magneto</u>, <u>Emma Frost</u>) that negate acorn damage. Long-range, accurate hitscan (e.g., <u>Hawkeye</u>, <u>Black Widow</u>). <u>Ultron</u> (aerial superiority, hard to hit with acorns).<br><br></li>\n  <li><b>Key Synergies:</b> Team-Up with <u>Spider-Man</u> (<b>Webbed Acorn - C</b>) grants her an AoE stun web bomb, excellent for controlling agile enemies or setting up team plays.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Excellent Area Denial & Poke:</b> Bouncing <b>Burst Acorns (LMB)</b> hit enemies in unexpected locations and behind cover.</li>\n  <li><b>Strong Single-Target CC:</b> <b>Squirrel Blockade (RMB)</b> effectively roots priority targets and interrupts abilities.</li>\n  <li><b>Good Vertical Mobility:</b> <b>Tail Bounce (Shift)</b> enables access to high ground and escapes.</li>\n  <li><b>Versatile Combo Potential (Mammal Bond - E):</b> Allows quick reloads and powerful double ability uses (e.g., double stun).</li>\n  <li><b>Effective Anti-Deployable:</b> Can quickly destroy enemy deployables like walls and turrets.</li>\n  <li><b>Devastating Ultimate in Enclosed Spaces:</b> <b>Unbeatable Squirrel Tsunami (Q)</b>, especially with S2 targeting buff.</li>\n  <li><b>Unique Projectile Trajectory:</b> Bouncing acorns can bypass traditional cover.</li>\n  <li><b>Strong Team-Up Stun:</b> Synergy with <u>Spider-Man</u> provides a valuable AoE web bomb.</li>\n</ul>",
    "weaknesses": [
      "Has no defensive or self-sustain tools.",
      "Vulnerable to dives and when Tail Bounce is on cooldown.",
      "Burst Acorn has the lowest damage distance falloff in the game, meaning her damage output vastly decreases the farther she is from her opponents.",
      "It also cannot deal critical damage.",
      "Targets rooted by Squirrel Blockade and Webbed Acorn can still attack and use non-mobility abilities.",
      "Unbeatable Squirrel Tsunami can be easily avoided, as it only hits ground targets; enemies flying or on high ground won't be affected by it.",
      "In addition, the squirrels have a healthbar and can be taken down."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Stark Fan Club Founder",
        "description": "As Squirrel Girl, partner with Iron Man to land 1 KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "\"Ahh, those tiny claws!\"",
        "description": "As Squirrel Girl, land 3 KOs with a single use of Unbeatable Squirrel Tsunami.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Eat nuts, and kick butts.\"",
    "ingame_bio_text": "Possessing only the powers of a common squirrel, somehow Doreen Green manages to defeat seemingly invincible enemies in the most unexpected ways. Any foe who counts her out is bound to fall at the hands of the Unbeatable Squirrel Girl!",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Bushwhack!",
        "content": "\"Well, that should take care of them!\" the Unbeatable Squirrel Girl said as she stood over a group of freshly-defeated attackers. \"Another horde of vampires down for the count. Good work, everybody!\"As Squirrel Girl praised her army of rodent companions for their efforts, the tiny creatures began to chitter with delight. They would do anything for their human friend, Doreen Green — even risk their lives against the seemingly endless throng of nocturnal nightmares that had emerged after an ancient curse trapped New York City in a state of perpetual night.\n\"You've definitely earned a trip to Mr. Hickory's fresh roasted nut cart on the corner of 55th and — \"\nBefore Squirrel Girl could finish that thought, her BFFF — Best Furry Friend Forever — Tippy-Toe scurried past her fellow squirrels and climbed right onto Doreen's shoulder. As Tippy began to chirp into Squirrel Girls' ear, Doreen's ever-present smile dropped a bit.\n\"Wait... that can't be right...\" Squirrel Girl said. \"A giant squirrel... fell out of the sky...? Here in Central Park...? Are you sure, Tippy?\"",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06:Season 0: Dooms' RiseLaunch",
        "changes": [
          "Squirrel Girl was released as the 29th character to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 2 new costumes: Arctic Lemmus and Urban Hunter.",
          "Added the \"Ahh, those tiny claws!\" achievement.",
          "Added to the ESU Alumnus Team-Up Ability with Spider-Man."
        ]
      },
      {
        "date_version": "24/12/19:Version 20241219/Winter CelebrationEvent",
        "changes": [
          "Enemies defeated by Unbeatable Squirrel Tsunami that get KO’d two seconds after being released now count towards the achievement!"
        ]
      },
      {
        "date_version": "25/01/03:",
        "changes": [
          "Added 1 new costume: Cheerful Dragoness."
        ]
      },
      {
        "date_version": "25/01/08:",
        "changes": [
          "Rectified instances where Squirrel Girl's ultimate ability could get stuck on specific terrain."
        ]
      },
      {
        "date_version": "25/01/10:Version 20250110/Season 1: Eternal Night FallsLaunch",
        "changes": [
          "Addition of a new effect to the Unbeatable Squirrel Tsunami: the squirrels will rush towards the nearest enemy after bouncing instead of bouncing randomly.",
          "Reduce the squirrel tsunami health from 600 to 300."
        ]
      },
      {
        "date_version": "25/02/20:",
        "changes": [
          "Resolved a sound issue where Squirrel Girl's hit sound effect was occasionally too sharp. Her acorns now land with a perfect pop!"
        ]
      },
      {
        "date_version": "25/04/11:Version 20250411/Season 2: Hellfire GalaLaunch",
        "changes": [
          "Added 1 new costume: Nut Rocker."
        ]
      },
      {
        "date_version": "25/04/25:Version 20250425/Giant-Size Brain BlastEvent",
        "changes": [
          "Corrected an issued with Squirrel Girl's default emote where facial expressions where missing when used in a match. Now, when she unleashes her quirky charisma, every nutty moment is captured with the full force of her animated personality!"
        ]
      },
      {
        "date_version": "25/05/09:",
        "changes": [
          "Added 1 new costume: Sunshine Squirrel."
        ]
      }
    ],
    "official_quote": null,
    "official_description": "Squirrel Girl is a Duelist hero in Marvel Rivals, and is the 29th hero introduced to the game's roster. She has team-up abilities that work in conjunction with Spider-Man."
  },
  "background": {
    "real_name": "Doreen Allene Green",
    "aliases": [
      "The Unbeatable Squirrel Girl"
    ],
    "birthplace": "Los Angeles, California",
    "birthdate": null,
    "gender": "Female",
    "eye_color": "Green",
    "hair_color": "Ginger",
    "relatives": [
      "Tippy-Toe (pet)"
    ],
    "affiliation": [
      "Squirrel Avengers Initiative"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Superhuman strength, speed, reflexes, and agility",
      "Ability to communicate with squirrels",
      "Scuirokinesis",
      "Prehensile tail",
      "Night vision"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Squirrel+Girl%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "C",
    "win_rate": "45.35%",
    "wr_change": "-1.24%",
    "pick_rate": "10.47%",
    "pr_change": "-2.67%",
    "ban_rate": "0.53%",
    "matches": "155,899"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}