{
  "name": "Star-Lord",
  "role": "Duelist",
  "stats": {
    "health": "250",
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#3B82F6",
    "color_theme_secondary": "#93C5FD"
  },
  "abilities": [
    {
      "name": "ELEMENT GUNS",
      "keybind": "LMB",
      "type": null,
      "description": "Shoot enemies with dual Element Guns. Rapid-fire shots with spread.",
      "casting": null,
      "damage": "6.5 damage per round",
      "damage_falloff": "Falloff begins at 10m, decreasing to 60% at 25m",
      "fire_rate_interval": "40 rounds per second",
      "ammo": 40,
      "critical_hit": true,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "After 2 consecutive shots, the spread increases to 0.15m; after 5 consecutive shots, the spread expands to 0.24m"
    },
    {
      "name": "ROCKET PROPULSION",
      "keybind": "SHIFT",
      "type": "Movement",
      "description": "Consume energy to gain a Movement Boost and soar forward.",
      "casting": "Movement",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": "100%",
      "energy_cost_details": "300/s",
      "details": {
        "max_energy": "1800"
      }
    },
    {
      "name": "BLASTER BARRAGE",
      "keybind": "E",
      "type": "Spherical Spell Field",
      "description": "Fire a frenzy of shots, causing damage to enemies within range.",
      "casting": "Spherical Spell Field",
      "damage": "75 damage per hit",
      "damage_falloff": "starting at 4 meters and maxing out at 80% reduction at 8 meters",
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": "8m spherical radius",
      "projectile_speed": null,
      "charges": null,
      "duration": "3s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Can be interrupted.  Can be used even if your Element Guns are out of ammo; will not replenish ammo.  You can still use your Rocket Propulsion or Stellar Shift, or even cancel it early by pressing the ability key again."
    },
    {
      "name": "STELLAR SHIFT",
      "keybind": null,
      "type": "Movement",
      "description": "Dodge in the direction of movement and swiftly reload.",
      "casting": "Movement",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "5s per charge",
      "range": null,
      "projectile_speed": null,
      "charges": 2,
      "duration": "0.37",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {}
    }
  ],
  "ultimate": {
    "name": "GALACTIC LEGEND",
    "keybind": "Q",
    "type": "Rapid-fire projectile",
    "description": "Engage in free-flight and lock onto enemies in sight.",
    "casting": "Rapid-fire projectile",
    "damage": "6.5 per round",
    "range": "30 meters",
    "effect": "auto-lock on enemies within sight, 20% increased movement speed, 70% faster reload speed",
    "duration": "8s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": "20%",
    "bonus_health_details": null,
    "energy_cost": 3100,
    "details": {}
  },
  "passives": [
    {
      "name": "LEADER’S SOUL",
      "details": {}
    }
  ],
  "teamups": [
    {
      "name": "Guardian Revival",
      "details": {}
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Star-Lord is a highly mobile, versatile Duelist known for consistent damage output and a powerful elimination ultimate. He utilizes flight (<b>Rocket Propulsion - Shift</b>, increased max energy in S2) and evasive maneuvers (<b>Stellar Shift - RMB</b>, 2 charges, reloads guns) to outmaneuver opponents. His <b>Element Guns (LMB)</b> fire rapidly, with every third shot being a double shot. <b>Blaster Barrage (E)</b> is a close-range burst (damage reduced, falloff added in S2).</p>\n<p>Utilize aerial mobility for aggressive off-angles and flanks, primarily targeting backline healers and vulnerable targets. Maintain mid-range engagements, using cover and constant repositioning. Due to low health, stay near health packs/supports. Manage Rocket Propulsion energy. His ultimate, <b>Galactic Legend (Q)</b>, grants free-flight and auto-locks enemies within 30m for 8s with significantly increased reload speed, ideal for securing kills on high-priority targets.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Sustained Fire & Reload Cycle:</u></b><br>Fire <b>Element Guns (LMB)</b> until near empty → Use <b>Stellar Shift (RMB)</b> to dodge and instantly reload. Repeat for high uptime.<br><br></li>\n  <li><b><u>Close-Range Burst:</u></b><br>Engage at close range → Empty <b>Element Guns (LMB)</b> magazine → Immediately follow with <b>Blaster Barrage (E)</b> → Use <b>Stellar Shift (RMB)</b> to reload/create distance.<br><br></li>\n  <li><b><u>Ultimate Initiation & Execution (Galactic Legend - Q):</u></b><br>Use <b>Rocket Propulsion (Shift)</b> to flank or gain high ground → Activate <b>Galactic Legend (Q)</b> to lock onto priority targets (healers first) → Use <b>Stellar Shift (RMB)</b> during ultimate to reload and reposition, maintaining pressure.<br><br></li>\n  <li><b><u>Mobile Harassment:</u></b><br>Use <b>Rocket Propulsion (Shift)</b> for rapid map traversal → Engage with short bursts of <b>Element Guns (LMB)</b> → Use <b>Stellar Shift (RMB)</b> to dodge and reload. Constantly reposition.<br><br></li>\n  <li><b><u>Advanced Evasion & Attack:</u></b><br>Fire <b>Element Guns (LMB)</b> → Use <b>Stellar Shift (RMB)</b> to dodge & reload → Use second <b>Stellar Shift (RMB)</b> to close distance or further evade → <b>Rocket Propulsion (Shift)</b> for more mobility → <b>Blaster Barrage (E)</b> if in close range.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Strategists in the backline (mobility allows quick access and elimination). Duelists and Tanks with limited mobility (can outmaneuver and maintain optimal range). Characters lacking strong vertical mobility (can exploit high ground).<br><br></li>\n  <li><b>Challenging Against:</b> Long-range, accurate hitscan heroes (e.g., <u>Hela</u> - a noted hard counter, <u>Black Widow</u>, <u>Winter Soldier</u>) who can punish flight. Heroes with strong CC (stuns/roots) that interrupt flight. Agile Duelists with good tracking (e.g., <u>Spider-Man</u>, <u>Iron Fist</u>) who can match mobility and engage closely.<br><br></li>\n  <li><b>Key Synergies:</b> Team-Up with <u>Adam Warlock</u> (<b>Leader's Soul</b>) grants Star-Lord a cocooned revival, increasing survivability and allowing riskier plays.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>High Sustained Damage:</b> <b>Element Guns (LMB)</b> provide consistent high damage, especially with crits and the double-shot mechanic.</li>\n  <li><b>Excellent Mobility:</b> <b>Rocket Propulsion (Shift)</b> and <b>Stellar Shift (RMB)</b> enable rapid repositioning, flanks, and escapes.</li>\n  <li><b>Potent Elimination Ultimate:</b> <b>Galactic Legend (Q)</b> auto-locks and allows rapid fire for securing kills on key targets.</li>\n  <li><b>Versatile Engagement:</b> Excels in mid-range poke and aggressive flanking plays.</li>\n  <li><b>Evasive Reload:</b> <b>Stellar Shift (RMB)</b> combines dodge with instant weapon reload.</li>\n  <li><b>Effective Flanker:</b> Mobility allows him to attack from unexpected angles.</li>\n  <li><b>Strong Team-Up Survivability:</b> Synergy with <u>Adam Warlock</u> provides a second chance.</li>\n  <li><b>Increased Flight Energy (S2):</b> More freedom in utilizing Rocket Propulsion.</li>\n</ul>",
    "weaknesses": [
      "Element Guns have some of the lowest damage distance falloffs in the game.",
      "The invulnerability from Stellar Shift is less than a second, meaning players need to time it properly to avoid powerful attacks.",
      "Can be interrupted during Blaster Barrage and Galactic Legend.",
      "During Galactic Legend Star-Lord is unable to critically hit, even if the player aims directly at the target's head.",
      "Leader's Soul has a very long cooldown of 120 seconds."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "A Better Plan",
        "description": "As Starlord, issue the \"Fall back!\" ping 3 times.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Vengeance For The Milano!",
        "description": "As Star-Lord, land 10 KOs with assists from the Guardians of the Galaxy.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Someone's gotta guard the galaxy. Might as well be me.\"",
    "ingame_bio_text": "Peter Quill lives to dazzle his foes on the battlefield with his signature swagger. As his element guns paint arcs of devastation, his acrobatic moves sail through the sky with unrivaled style. With performances this spectacular, it's no wonder that Star-Lord is so legendary!",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Quantum Slingshot",
        "content": "If you had to crash, thought Peter Quill, might as well do it in the middle of maybe a thousand other spaceships. Makes it easier to find parts, at least. That's what Rocket was supposed to be doing, and maybe Groot too, but Quill wasn't too sure about Groot. He had kind of wandered off in the direction of the jungle that bordered the ship graveyard. For all Quill knew, he was communing with the local daisies and dahlias. Quill hoped Groot wasn't anywhere close to the fire spreading through the ship graveyard. The flames weren't coming close to the Milano thankfully, which had churned up a good furrow of earth and scrap metal during its highly controlled and perfectly executed emergency landing. So, since he had pulled off a perfectly landing after Rocket had screwed something up, Quill thought he should probably congratulate himself for making sure the Milano wasn't going to be burned by creating an excellent firebreak behind it. Not that Rocket would ever give him credit, nor would Groot ever notice. \"Man,\" Quill said. \"It's not easy being a leader.\" He said this while sighting down the barrel of one Element Gun at an approaching symbiote. This was the downside of crashing in a spaceship graveyard on the planet Klyntar. Lots of symbiotes who showed up to the new crash site with an appetite. He was picking them off as fast as he could, but even Star-Lord could only take them down so fast, and more and more of them showed up with each passing second. Quill was starting to resent Rocket for crashing the ship in the first place. On the other hand, what good did that do? Now Rocket was looking for parts, which was the right thing to do if he wanted to make up to for his mistake. Accountability, Quill believed, was a big part of successful teamwork. He picked off a trio of symbiotes crawling over the top of a huge amalgam of Skrull ship parts just to the north of the Milano. He had seen some of these critters on Earth and elsewhere in the galaxy, but not like these. Apparently if they bonded to humans, they become sort of human? But these, hoo boy, they were bonded to all kinds of aliens that even Peter Quill, who had been to more planets than he'd had hot meals, could recognize. And none of them seemed to like humans very much, to judge from how they kept trying to claw or chomp or shred him. An alert went off inside the Milano around him. Quill dropped into the ship just in time to catch a symbiote coming up through the hatch. He popped it with both Element Guns, but not before it had gotten all thew ay in and wrapped a barbed tentacle around his leg. Swearing in a every language he knew, he blew the tentacle apart and limped over to slam the hatch shut. His leg hurt like a flerkin's kiss on the way back up to the top of the Milano's hull, but pain had to wait. Quill was going to protect his ship to the end. A big explosion lit up the far end of the ship graveyard, over by a cluster of ancient buildings that rose up from the edge of the jungle. Looks like the fire's reached a ship with something combustible on board, Quill thought. Bits of flaming wreckage rained down around the buildings and nearer to the edge of the jungle. Most of the symbiotes abandoned their siege of the Milano and took off toward the fire, which suited Quill just fine. It was a whole lot easier to fix a spaceship when you didn't have a horde of monsters trying to eat you, or whatever they were trying to do. He shot at them a little more while they were running off, then tried to get a hold of Rocket on the comm. Interference responded, which could have been background radiation, or some weird emission from the massive Celestial corpse floating around in near-Klyntar orbit, or anything else, really. Rocket was incommuniado, and Groot, well. Quill never knew how to get in touch with Groot. Guess I'll keep working until they come back, he thought as he watched the fire for a minute to see whether it was coming his way. When it wasn't, he went below to see what he could do about getting this bucket of bolts back into orbit. A couple of hours later, he was putting the finishing touches on his work when he heard noises from a nearby wreck. He scrambled up ot the top of the Milano's hull and pointed Element Guns in that general direction — but instead of more symbiotes, he saw Rocket scrambling over the wrecked ships, with Groot right behind him. \"Quill!\" Rocket shouted. \"Give us a hand!?\" Groot was carrying a huge armload of scrap tech just behind the raccoon. \"What, you took some time to go scavenging?\" Quill asked. \"What is all this garbage?\" \"It's not garbage, you flarkin' dolt,\" Rocket said. \"We fought like a hundred million of those monsters to get it, and now this scut is gonna get us out of here.\" \"Oh, I got that figured out already,\" Quill said. \"Everything's all tuned up in the engines, except for —\" Rocket was already looking. \"Except you don't have any shielding over the plasma exchangers.\" Quill pointed out at the wrecks. \"Plenty of shielding out there, genius.\" \"And how were you going to get enough thrust to get us off-planet if you diverted all the power to the hyperspace drive?\" Rocket put one hand over his eyes, dropping some of his various bits he collected. Quill was used to Rocket thinking he was dumb. It was part of their relationship now. But this time, he had an answer. He pointed up. \"What?\" Rocket demanded. Quill stabbed a finger toward the sky. Rocket looked. \"See that?\" Quill prompted him. \"The dead Celestial, orbiting up there?\" \"Yeah, I see it,\" Rocket said. \"So what?\" \"I am Groot,\" Groot said. \"That's right,\" Quill said. \"A way out. Well, sort of. More like a... coordinate switcheroo. See, the reason I routed all the power to the hyperspace drive is that we can pair the Milano with the Celestial's remains into the quantum whatever. The body will get trapped down here, the Milano goes up, then we hyperjump the flark out of here, and we never have to come back to this hellhole ever again!\" \"I am Groot?\" \"Meh, we can repair the regular thrusters whenever we get around to it.\" \"You're kidding,\" Rocket said. \"Quantum swap with the corpse of a Celestial? That won't work, you know how many conditions need to be —.\" \"Not since we got that Nega-Eenrgy Replicator from that doozy of a deal on Hala. 'Member how Mar-Vell and Rick Jones did it with the Nega-Bands? Take a look around!\" Quill spread his arms. \"Rocket, old pal, tell me what else we need that we can't find here.\" Rocket was looking at Quill's work again, this time with a more appraising eye. \"Uh huh,\" he said. \"So you're saying... you're gonna build a temporary pocket of Negative Zone as a... terminal to stabilize the quantum displacement? Quill, you've had a lot of scuzzy ideas in our time, but this one's actually...What was it that you Earth folks said— even a broken clock is correct once a day?\" \"Twice.\" \"Then it ain't HALF bad.\" \"As compliments go, that's pretty weak, but coming from you, I'll take it. Plus, it has the added benefit of smashing the Celestial's corpse down on these symbiotes, who I have to say are not so good with hospitality.\" \"I am Groot.\" His massive companion dropped the junk in his arms and put a kind hand on his shoulder. Quill nodded at Groot, then shot Rocket a look. \"Now that was a real compliment.\" \"Only problem is,\" Rocket said, \"if you don't have some kind of force dampening matrix powered up when we swap, we'll all get to orbit torn into pieces. But that's totally cool, because I just so happen to have — by which I mean Groot just so happened to have dropped —a piece of equipment that will do the job.\" \"What?\" Incredulous, Quill looked from Rocket to Groot and back. \"How did you —?\" How did I know? I didn't.\" Rocket guffawed. \"I totally got it for another reason, but it will work here.\" \"I am Groot,\" Groot said. \"You had help from a friendly vine?\" Quill echoed. \"Sorry, Groot, but that's the most far-fetched thing I've heard since we got here. Nothing about this planet is friendly.\" \"I am Groot.\" Quill turned to Rocket. \"Seriously?\" \"I saw it,\" Rocket said. \"The native flora helped him. Groot's a diplomat, if you didn't know.\" Quill chose not to process that idea at this moment, when a horde of symbiotes might show up again at any moment while they were trying to use the orbiting remains of a Celestial as a quantum anchor to swap themselves into orbit.\" \"I...okay,\" he said. \"Groot's a diplomat and you just happened to pick up the one piece of equipment I didn't think of that's going to save all our lives while I was busy holding off a hundred thousand million symbiotes to get our ship ready for its possibly final voyage.\" Quill waited, hoping he sounded appropriately frustrated. But either Rocket had missed the sarcasm, or just didn't care, because all he said was, \"Lucky, right? Here, let's get it hooked up.\" Quill sighed. For the second time that day, he was thinking about how hard it was to be a leader. With an aligned goal, the remaining hard work went rather smoothly. Quill rushed back into the Milano as Rocket gave the new system a final check. \"Time usually flies faster in the Negative Zone, but switching with our dance partner may take what feels like a while.\" \"Oh yeah, totally. And that second big button is here because...\" Quill's voice trailed of as his train of thought slowed. \"To exit the Negative Zone from the other end, genius. One to get in, one to get out. Like those Nega-Bands. Unless you wanna stay there and watch the timestream collapse from that cosmic backwater.\" Rocket rolled his eyes, then slapped on the first button. THOOM! Almost instantaneously, the Milano disappeared from the dark planet, leaving only a perfect shape of her landing pads and side=wings on the gooey surface. And just as fast as she disappeared, there she was, against the endless, pitch black of the Negative Zone... and the enormou body of the deceased ancient Celestial. Even with all they had seen across the galaxy, the crew felt they shouldn't be looking upon the vibrant corpse, awestruck by the lifeless form of a god in front of their insignificant speck of a spaceship. \"I am Groot...\" \"Say, this headless hunk and the big dome of Knowhere, ain't they perfect for each other!\" Rocket decided to light up the cockpit. \"Uhh... do we know if decapitation kills these things? Cuz the Milano says it's ALIVE!\" A string of flashing readings on the interface lighted Quill like a ham in the microwave. And as if in response to him, the corpse made a single twitch. \"I am Groot?!!!\" Groot was unsettled. \"No it didn't! You're seeing things. Besides, I'm sure it's just the quantum swap having some residual effects, probably because it's so big... yea...\" Rocket's feigned confidence waned. \"And I don't want to stick around long enough to find out.\" Peter pressed. \"Hit that second button, Rocket!\" \"Not yet. Havta recharge the engine!\" \"Just hit it! Something is happening over there!\" Quill tried and failed to ignite the regular thruster out of desperation. \"Quit it, Quill, or we'll be stuck in the Negative Zone! There's worse things here than whatever your imagination is thinking you saw!\" And right on cue, the giant body started to shake violently, a wriggling mass forming within the husk of the Celestial.. \"I am Groot!\" Groot pointed at corpse, panic in his three words. \"Yes I believe you now! Yeah, yeah, something's definitely moving on its chest. Those must be what the scanner picked up!\" On the giant's decayed chest plates, Groot and Rocket spotted a person-shaped symbiote, as well as a glowing cocoon of some sort. But it didn't stop Milano's every single alarm from screaming. \"That does it!\" Quill leaned over and smashed on the first button. \"No, Quill, you—\" THOOOM! The ship was already back where they started before Rocket could finish, fitting squarely into the impression they left on the ground. \"Aggh! You got any more bright ideas to waste our time?\" Rocket seemed down. \"I am Groot...\" \"All right, all right! As the captain, you have to make unpopular decisions sometimes. And we're all still alive, so you're very welcome!\" Quill stood up, looked around the cockpit. \"Whoever that symbiote was, they're not the same as the natives. And that golden egg thingy! If that's who I think it is, they shouldn't be there... but I think we've got some other friends around!\" \"Who cares?! C'mon, Groot. Let's go find some more friendly vines. Maybe THEY can be a better captain of the ship.\" Rocket headed to the hatch door. \"You think so?! Then go ahead. When we're back on Knowhere, I'm telling everyone that I saved our lives! Including those two up there!\" Quill yelled to the back of his crewmates, but they didn't stop. \"Whatever!\" Quill slapped the arm of his chair. Dude, being the leader is so hard, he thought. But when he looked up to the sky, the Legendary Star-Lord smiled. The giant corpse of the Celestial remained in the sky, with golden light shining from its chest. Like a tight house in a raging black sea.",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06: Season 0: Dooms' Rise Launch",
        "changes": [
          "Star-Lord was released as the 15th character to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 2 new costumes: Jovial Star and Guardians of the Galaxy Vol. 3.",
          "Added the Vengeance For The Milano! achievement.",
          "Added to the Guardian Revival Team-Up Ability with Adam Warlock and Mantis."
        ]
      },
      {
        "date_version": "24/12/10: Version 20241210",
        "changes": [
          "After Star-Lord's Guardians of the Galaxy Vol. 3's MVP animation played, sound effects would not be played in the results screen. This issue has been resolved."
        ]
      },
      {
        "date_version": "24/12/13:",
        "changes": [
          "Added 1 new costume: Master of the Sun."
        ]
      },
      {
        "date_version": "24/12/19: Version 20241219 / Winter Celebration",
        "changes": [
          "Star-Lord's unexpected shaking when using Shift while holding Space in low gravity zones has been fixed. Now he'll rise with style!"
        ]
      },
      {
        "date_version": "25/01/08:",
        "changes": [
          "Fixed a visibility issue that could sometimes occur when Adam Warlock/Mantis/Star-Lord were in soul form within the mist on Wakanda maps where they couldn't see or be seen by others."
        ]
      },
      {
        "date_version": "25/01/22: Version 20250122 / Fortune & Colors Event",
        "changes": [
          "Added 1 new costume: Lion's Mane (unlocked from Fortune & Colors event)"
        ]
      },
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "Increase Rocket Propulsion's maximum energy from 1200 to 1800."
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Reduce Blaster Barrage damage from 80 per second to 75.",
          "Introduce a new damage falloff mechanic, starting at 4 meters and maxing out at 80% reduction at 8 meters.",
          "Added 1 new costume: King of Spartax."
        ]
      },
      {
        "date_version": "25/04/25: Version 20250425 / Giant-Size Brain Blast Launch",
        "changes": [
          "Resolved an issue where Star-Lord's Spartax Slumber emote was missing his signature facial animations when used during a match. Now, when he starts to nod off his playful attitude will shine through, proving that even in chaos, he's the coolest guy in the galaxy!"
        ]
      },
      {
        "date_version": "25/04/30: Version 20250430",
        "changes": [
          "Eliminated an occasional speed decay glitch in his Rocket Propulsion ability, impacting his smooth movement. Now, every blast-off is as snappy and daring as a mixtape drop from the Milano!"
        ]
      }
    ],
    "official_quote": "\"Got something that needs to be blasted? You called the right guy.\"",
    "official_description": "Star-Lord is a Duelist hero in Marvel Rivals, and is the 15th hero introduced to the game's roster. He has team-up abilities that work in conjunction with Mantis and Adam Warlock."
  },
  "background": {
    "real_name": "Peter Jason Quill",
    "aliases": [
      "Lord of Stars",
      "Master of the Sun"
    ],
    "birthplace": "Colorado, United States",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Hazel",
    "hair_color": "Blonde",
    "relatives": [
      "J’son (father)",
      "Meredith Quill (mother; deceased)",
      "Victoria (paternal younger half-sister)"
    ],
    "affiliation": [
      "Guardians of the Galaxy"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Compensates with a pair of blasters and jet boots",
      "Superhuman Speed",
      "Expert Combatant, Pilot and Marksman",
      "Hybrid Physiology"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Star-Lord%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "C",
    "win_rate": "47.64%",
    "wr_change": "-0.79%",
    "pick_rate": "9.20%",
    "pr_change": "-2.08%",
    "ban_rate": "0.31%",
    "matches": "137,054"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}