{
  "name": "Storm",
  "role": "Duelist",
  "stats": {
    "health": 250,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#F59E0B",
    "color_theme_secondary": "#C084FC"
  },
  "abilities": [
    {
      "name": "WIND BLADE",
      "keybind": null,
      "type": null,
      "description": "Launch forward-piercing Wind Blades",
      "casting": "Projectile that fires in a straight trajectory",
      "damage": "55 damage per round",
      "damage_falloff": "Falloff begins at 20m, decreasing to 60% at 30m",
      "fire_rate_interval": "2 rounds per second",
      "ammo": 12,
      "critical_hit": false,
      "cooldown": null,
      "range": null,
      "projectile_speed": "150m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Wind Blade pierces through enemies"
    },
    {
      "name": "WEATHER CONTROL",
      "keybind": "SHIFT",
      "type": null,
      "description": "Switch the weather to empower allies: Tornado grants a Movement Boost; Thunder grants a Damage Boost",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "15m spherical radius",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Tornado: MOVEMENT BOOST (SELF) - 16%, MOVEMENT BOOST (ALLY) - 10%. Thunder: DAMAGE BOOST (SELF) - 12%, DAMAGEBOOST (ALLY) - 10%"
    },
    {
      "name": "GODDESS BOOST",
      "keybind": "E",
      "type": null,
      "description": "Channel the power of the weather to empower Storm: Tornado grants a Movement Boost and inflicts Slow on enemies; Thunder grants a Damage Boost and summons lightning to inflict damage",
      "casting": "Spherical Spell Field",
      "damage": 35,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "15s",
      "range": "15m spherical radius",
      "projectile_speed": null,
      "charges": null,
      "duration": "8s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "Enhanced Tornado: MOVEMENT BOOST (SELF) - 40%, MOVEMENT BOOST (ALLY) - 20%, ENEMY SLOW RATE - -15%. Enhanced Thunder: DAMAGE BOOST (SELF) - 25%, DAMAGEBOOST (ALLY) - 12%, STRIKE FREQUENCY - 2s per strike"
    },
    {
      "name": "BOLT RUSH",
      "keybind": null,
      "type": null,
      "description": "Unleash a lightning bolt forward",
      "casting": "Straight Spell Field",
      "damage": 80,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "8s",
      "range": "A cylindrical spell field with a radius of 1m and a height of 40m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    }
  ],
  "ultimate": {
    "name": "OMEGA HURRICANE",
    "keybind": "Q/MS3",
    "type": null,
    "description": "Transform into a hurricane to draw in nearby enemies and deal damage",
    "casting": "Spherical Spell Field",
    "damage": 75,
    "range": "8m spherical radius",
    "effect": null,
    "duration": "5s",
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 3100,
    "details": "Weather effects will be disabled during the Ultimate"
  },
  "passives": [],
  "teamups": [
    {
      "name": "Storming Ignition",
      "partner": [
        "Human_Torch"
      ],
      "effect": null,
      "keybind": "X",
      "teamup_bonus": null,
      "duration": null,
      "cooldown": null,
      "range_target": "Up to 40m",
      "special_notes": "Role: Anchor | Ability: Burning Hurricane",
      "details": "Damage Range: 10m spherical radius<br/>Attack Interval: 2 hits per second<br/>Damage: 80<br/>Duration Increase: 2s per Flame Tornado<br/>Max Duration: 11s<br/>Special Effect: Duration increases with each Flame Tornado contact; Storm can either press X to start the Team-Up immediately wherever the Flame Tornado is located, or Q to start it at the player's leisure"
    }
  ],
  "gameplay": {
    "strategy_overview": "To be added",
    "weaknesses": [
      "Low damage output in general, with both her Wind Blade and Bolt Rush having small hitboxes that require pinpoint accuracy to land.",
      "Despite being in constant free-flight, Storm has no access to quick mobility tools like Iron Man or Star-Lord, having to rely on the smaller speed boost from the Tornado Weather Control, even when enhanced.",
      "Has no defensive or self-sustain tools outside of her Ultimate.",
      "Can still be targeted and taken down during Omega Hurricane.",
      "During Omega Hurricane her Weather Control is temporarily disabled.",
      "Charged Gale only hit each enemy once per cast, meaning it only gains value when used on a cluttered group."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "No Love Lost",
        "description": "As Storm, partner with Black Panther to land one KO.",
        "points": 5
      },
      {
        "icon": null,
        "name": "To Me, My X-Men!",
        "description": "As Storm, assist X-Men members 10 times.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"I am a mutant, and I'm proud to be one.\"",
    "ingame_bio_text": "Born a Mutant and worshipped as a Goddess due to her ability to manipulate the weather, Ororo Munroe became the X-Man known as Storm. As the regent of Sol and the protector of Arakko, she now serves as a protector for Mutants on Earth and beyond.",
    "ingame_story_intro": "The chronal energy generated by the Timestream Entanglement has resulted in violent temporal tempests on the sentient island Krakoa, the nation that the X-Men call home. Although her powers are capable of stabilizing the island's climate, Storm seeks a more permanent solution alongside her fellow heroes.",
    "hero_stories": [
      {
        "title": "Dreamy Dew",
        "content": "Very few Mutants had the honor of serving on both the Quiet Council of Krakoa and the Great Ring of Arakko simultaneously. Ororo Munroe was one, and she had long looked forward to the day when the two sentient islands might be reunited. She had not, however, counted on it happening quite like this., It had begun without her even knowing, while she was walking along the coral shoals that, together with a great oceanic lagoon, separated Arakko from the great red desert of Mars. The tiny whirls and eddies in time grew almost instantly into a great wave of disruption. Ordinarily, Storm was hypersensitive to tiny changes in the atmosphere around her, due to the nature of her Mutant powers, but she had been preoccupied with the next challenge to her seat on the Great Ring, and let that preoccupation distract her from her immediate sensory environment.\nNow aware that something was happening before she understood what, her pulse quickened, then slowed again to a thud. Raindrops slowed, hung still in the air, then hurtled again toward the ground, each one at a different speed. Clouds tore across the sky, cleared, then rebuilt themselves into great black walls, all in seconds — behind them the sky inverting its normal uniform brilliant blue. Streaks of indigo and black split from horizon to horizon, revealing stars that were not the stars Storm knew.\nShe raised a hand and saw raindrops falling on her skin — and others passing straight through her hand as if they weren't there. All around her plants grew, bloomed, and died, all in an instant. Trees split the skies, growing two hundred feet high and toppling, becoming soil again before their falling trunks even hit the ground. The air was thick with flowers, and insects moving through a million generations before her eyes as she drew a single breath.\nArakko and Krakoa both appeared before her, partly as if they were superimposed on each other. Then Ororo realized she was seeing it wrong; the two islands were colliding, molding into one another as the overlapping timelines tore away all boundaries of sense. The Red Keep and the Tower of Broken Will overlapped, merged, hybridized, and became something new that Storm couldn't quite focus on before it was all swept away in the next spasm of the time disruption. Krakoa's bays and Arakko's coral swirled into new configurations. Krakoa's quarry and the Circle Perilous of Arakko blended into each other before finally breaking free, but now the quarry contained Arakkan combatants and the Circle Perilous bewildered mutants of Krakoa. The forests of both islands overgrew each other and separated again, each featuring new species and unknown hybrids. The harder the wind blew, the faster the transformations, and now Storm saw tiny slivers of some new material appearing in the tempest, sleeting down to the island's surface and shores. The particles stung when they hit her skin — a pain that wasn't entirely physical. It was as if they were injuring her ability to locate herself in space and time. She reeled momentarily, then got her bearings again.\nThe particles rained down over the islands, driving both into a frenzy. Arakko and Krakoa briefly fought each other, bitter as only siblings can be. Storm, standing on their soil with one foot in each world, knew she would be subsumed and destroyed if she did not do something. And as deformed time tore through her being again, rippling her mind the way wind would ripple her hair, she realized what she could do. This was a storm across all of time. And if it was a storm, she could control it. Storm's power over weather was instinctive and had been since she was a girl. This was new and would not be guided by instinct but by her conscious mind — which was under constant distraction by the onslaught of particles. They ruined her concentration, and kept her from grounding herself in the here and now, which was necessary if she was to bring her powers to bear on this tumult.\nAnd she was not the only one suffering from the particles. The islands, brutally crushed into each other's reality, wailed in pain and fear, both a sound like a hurricane wind and a psychic scream that rang in Storm's mind. This spurred her into action. She may have been the Regent of Arakko, but she still had responsibilities to Krakoa as well.\nThe time-storm was forcing them together, and also twisting a new reality into being around them. Storm felt those currents of power, realized they moved in a system, and for a moment understood that system. Her Mutant powers responded. The way electrical charges crackled about her body when she controlled lightning, now space-time itself rippled around her body, creating glimpses of a million different Ororo Munroes from a million different realities, but none of them could disturb or displace her. She found herself in control, and she began to quiet the storm. Its boundaries, she knew, extended far beyond her ability to control it, but she had influence over this one small part, and that she intended to use. Krakoa and Arakko were at stake, and with them, the lives of thousands of mutants who would otherwise be adrift on the timestream. She could not let the time-storm merge the two islands together. The islands both feared for their survival, and they began to tear at one another psychically, with greater intensity as their fear created a feedback loop.\nOnly Storm could stop this madness. She began to guide the currents of the storm, shunting away the most damaging gusts and finding smoother paths for both Krakoa and Arakko to move through...time? Was she guiding them through time, the way a skilled ship's captain brought a vessel through a storm to safer harbors? If so, where would they arrive?\nGradually, slowly, she channeled the powers of the time-storm around the two living islands, letting them re-divide into their own entities, drifting further and further apart. Heavier fronts of the stinging particles blew through, and now they were larger, merging into crystals. They precipitated from the storm the way rain precipitated from clouds too heavy with moisture. Who had caused this time-storm? How were different realities becoming entangled and overlaid on each other?\nThese were questions for another time. Now she had to make sure the storm was passing, and not just gathering itself for another onslaught. She felt its energy dwindle, even as the crystals fell in greater numbers all around her, all across the islands' surface—and as she had that thought, she looked around and realized that the chronal outburst had subsided.\nKrakoa and Arakko had nearly become one, in a collapse that could have destroyed them both, and doubtless would have annihilated many of the lives on each. The aftershocks and echoes of their psychic battle still churned in the air around her, but like the time-storm, that battle was almost over. Storm stood on the coastline of Krakoa gazing out at the ocean, and...\nWait. When the time-storm had begun, Storm had been on Mars. On Arakko. Now, as reality settled back into place, she saw that she was on Krakoa, at the edge of Hellfire Bay, where the White Palace and Blackstone stared each other down from opposing promontories. The air smelled new, sharp with life and the scent of a just-passed storm — but it was definitely Earth air. Ororo looked around her, over beautiful living Krakoa, and despite her jarring dislocation, she felt an almost maternal pride at the way she had brought it through the crisis.\nBut how had it happened? And now that it was over, how had Storm been transported millions of miles without ever passing through a Krakoan gateway? Had Arakko been safely returned to its home on Mars? Was this even the same timeline that the living islands had occupied before the time-storm? It had been more powerful than anything she had ever felt, maybe even more powerful than her brief contact with the Phoenix Force. Who had caused it, and how? More importantly, why? What damage had been done to the mutants living on both islands? How could she ensure this did not happen again? These were a leader's questions. More personally, Storm was anxious to know that her friends and loved ones were all right. She would have to seek them out, both on Krakoa and Arakko, to make sure they had weathered the time-storm. And what of the broader world? What was the situation in New York, or Wakanda? Would she even find the same New York, or the same Wakanda, that she had once known?\nAll around her, the crystals precipitated from the storm lay thick on the ground. Storm bent and gathered several of them in her hand. Like a mineral made of time, she thought.\nXavier needed to hear about this immediately.\nMagneto as well, although Storm decided on the spot that Xavier should know first. Both old adversaries believed themselves to have Mutants' best interests in mind, but Storm's vision aligned much more closely with Xavier's.\nWhere was he? Here on Krakoa, or elsewhere in this world? Was it a new world, a new time, or had she misunderstood the nature of the storm?\nStorm saw people emerging from the forests of Krakoa. Some of them she recognized, some were new to her. They saw her, high on the ridge overlooking the ocean, and they looked to her for guidance. No matter where they hailed from Krakoa or Arakko, Earth or Mars, the past, present, or future — she knew one thing: She would not let them down.",
        "status": null
      },
      {
        "title": "Sound of the Solar System",
        "content": "(Coming soon. Stay Tuned!)",
        "status": null
      },
      {
        "title": "Roaming with Acanti",
        "content": "(Coming soon. Stay Tuned!)",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06",
        "changes": [
          "Storm was released as the 13th character to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 2 new costumes: Ivory Breeze and Mohawk Rock.",
          "Added the To Me, My X-Men! achievement.",
          "Added to the Voltaic Union Team-Up Ability with Thor and Captain America."
        ]
      },
      {
        "date_version": "24/12/10",
        "changes": [
          "In the foggy areas of Intergalactic Empire of Wakanda: Hall of Djalia and Intergalactic Empire of Wakanda: Birnin T'Challa: Fog would disappear from Hela and Storm's perspectives when they activated their Ultimates. This issue has been resolved."
        ]
      },
      {
        "date_version": "25/01/10",
        "changes": [
          "Increase Wind Blade projectile speed from 100m/s to 150m/s and left-click damage from 50 to 55.",
          "Increase Bolt Rush damage from 70 to 80.",
          "After releasing Omega Hurricane, the bonus health provided for herself will be increased from 350 to 450. Moreover, following its conclusion, the extra health will no longer vanish instantly but will instead diminish at a rate of 100 per second.",
          "Reduce the cooldown of Charged Gale from 20s to 15s.",
          "Increase the damage of Charged Gale from 50 to 55."
        ]
      },
      {
        "date_version": "25/02/07",
        "changes": [
          "Fixed an issue where Storm's Ultimate Ability could lead to unintended positions if she unleashes it just as she passes through Doctor Strange's portal. She'll now control the storm without getting lost!",
          "Resolved a bug where Storm's Ultimate Ability could end abnormally if trapped by recovering destructible structures. She's ready to unleash her powers--no more interruptions in the eye of the storm!"
        ]
      },
      {
        "date_version": "25/02/21",
        "changes": [
          "The damage falloff of Wind Blade at 30 meters will be changed from 70% to 60%.",
          "Reduce Storm's damage increase from Thunder during Weather Control from 16% to 12%. However, the damage increase for allies within range has been increased from 8% to 10%.",
          "Reduce Storm's damage increase from Enhanced Thunder during Weather Control from 30% to 25.",
          "Added to the Storming Ignition Team-Up Ability with Human Torch."
        ]
      },
      {
        "date_version": "25/03/14",
        "changes": [
          "Added 1 new costume: Goddess of Thunder."
        ]
      },
      {
        "date_version": "25/04/11",
        "changes": [
          "Removed from the Voltaic Union Team-Up Ability with Thor and Captain America."
        ]
      }
    ],
    "official_quote": null,
    "official_description": "An Omega-level Mutant ability to manipulate weather patterns makes Ororo Munroe a force to be reckoned with. Rain or shine, thunder or lightning, nature itself bends to the command of the Goddess of the Storm!"
  },
  "background": {
    "real_name": "Ororo Munroe",
    "aliases": [
      "Goddess",
      "Regent of Sol",
      "Mutant Goddess of Krakoa",
      "Windrider"
    ],
    "birthplace": "Harlem, New York",
    "birthdate": null,
    "gender": "Female",
    "eye_color": "Blue",
    "hair_color": "White",
    "relatives": [
      "David Munroe (father; deceased)",
      "Princess N'Daré (mother; deceased)"
    ],
    "affiliation": [
      "X-Men"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Mastery in weather manipulation",
      "Flight",
      "Control of elements",
      "Energy manipulation"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Storm%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "54.65%",
    "wr_change": "-1.29%",
    "pick_rate": "4.70%",
    "pr_change": "-6.22%",
    "ban_rate": "0.33%",
    "matches": "70,061"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}