{
  "name": "The Thing",
  "role": "Vanguard",
  "stats": {
    "health": 700,
    "speed": "6 m/s",
    "difficulty": null,
    "color_theme": "#FB923C",
    "color_theme_secondary": "#FBBF2C"
  },
  "abilities": [
    {
      "name": "ROCKY JAB",
      "keybind": "LMB",
      "type": "Melee",
      "description": "Rapidly punch forward.",
      "casting": "Single-cast Spell Field",
      "damage": "40 per hit",
      "damage_falloff": null,
      "fire_rate_interval": "Double strike 0.33s between attacks, 1s between sets.",
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "4m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "STONE HAYMAKER",
      "keybind": "RMB",
      "type": "Melee",
      "description": "Deliver a devastating Heavy Blow. Move forward 3 meters while punching, gaining 50 Bonus Health during skill activation",
      "casting": "Single-cast Spell Field",
      "damage": 90,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "8m",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "This attack applies to all enemies within range directly in front of him, piercing through enemies. The Thing gains 50 bonus health whenever using the attack, whether he hits an enemy or not. This bonus health quickly decay afterwards."
    },
    {
      "name": "YANCY STREET CHARGE",
      "keybind": "SHIFT",
      "type": null,
      "description": "Continuously charge forward, launching up enemies and leaving behind a zone at the final position that prevents the use of mobility abilities. He can stop this charge at any point before it runs out to create the seismic zone earlier.",
      "casting": null,
      "damage": "Charge: 30; ground slam: 20; immobilization zone: 15 per/s",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "10s",
      "range": "Ground slam: 8m radius, 2.5m high cylindrical spell field. Immobilization zone: 8m radius, 4m high cylindrical spell field",
      "projectile_speed": null,
      "charges": null,
      "duration": "5s",
      "movement_boost": "100%",
      "energy_cost_details": null,
      "details": "The Thing gains 200 bonus health whenever using the attack, whether he hits an enemy or not. This bonus health quickly decay afterwards. Leave behind a zone at final position that prevents the use of mobility spells"
    },
    {
      "name": "EMBATTLED LEAP",
      "keybind": "E",
      "type": null,
      "description": "Jump towards your ally and apply damage reduction to both of you. He can do this twice with a cooldown of 3 seconds inbetween. Each leap has a cooldown of 13 seconds.",
      "casting": "Targeted",
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "Basic Cooldown 3s, with a charge of 10s per use",
      "range": "20m",
      "projectile_speed": null,
      "charges": 2,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "damage_reduction": "25%"
      }
    },
    {
      "name": "UNYIELDING WILL",
      "keybind": null,
      "type": "Passive",
      "description": "Immune to launch up, knockback, and other displacement effects.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    }
  ],
  "ultimate": {
    "name": "CLOBBERIN' TIME",
    "keybind": "Q",
    "type": null,
    "description": "Uses immense power to launch all enemies in front of you into the air.",
    "casting": "Step spell field",
    "damage": 100,
    "range": "Step spell field: 3m high, 10m wide, advancing 2m every 0.1 seconds, up to a maximum of 18m",
    "effect": "Stun duration 2.5s",
    "duration": null,
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": 2800,
    "details": null
  },
  "passives": [],
  "teamups": [
    {
      "name": "Fantastic Four",
      "partner": [
        "Human_Torch",
        "Invisible_Woman",
        "Mister_Fantastic"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": "5s",
      "cooldown": "20s",
      "range_target": null,
      "special_notes": "Ability: Cooperative Comrades",
      "details": "Bonus Health Growth: Generate 5 Bonus Health per 0.1s<br/>Bonus Health Max: 100<br/>Bonus Health Decay: Lose 5 Bonus Health per 0.1s after ability is over<br/>Special Effect: Base Health is also increased by a maximum of 100. If full HP, Base Health is not increased. If missing 1-99 HP, it will only increase Base Health by the missing amount. Bonus Health will not exceed max Base Health throughout the ability duration"
    },
    {
      "name": "Fastball Special",
      "partner": [
        "Hulk",
        "Wolverine"
      ],
      "effect": null,
      "keybind": null,
      "teamup_bonus": null,
      "duration": null,
      "cooldown": "3s when not thrown, 15s when thrown",
      "range_target": "Up to 20m",
      "special_notes": "Ability: Cosmic Fastball",
      "details": "Casting: Targeted<br/>Casting Throw: Charged release<br/>Casting Duration Throw: Up to 6s<br/>Special Effect: All abilities will cancel the Team-Up"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>The Thing is a resilient and disruptive Vanguard, excelling at initiating fights and absorbing significant amounts of damage. A defining characteristic is his immunity to movement-based crowd control effects (knockbacks, launch-ups), making him a steadfast frontline presence. While lacking traditional deployable shields, The Thing compensates with a substantial health pool and abilities focused on aggressive disruption and ally support.</p>\n<p>Position aggressively using <b>Yancy Street Charge (Shift)</b> to dive into the enemy team, disrupt their backline, and scatter their formation. This can also be used to push enemy tanks or healers out of position. His <b>Embattled Leap (E)</b> provides valuable utility, allowing him to quickly jump to an allied hero, granting both himself and the ally a damage reduction buff, effectively turning a 1v1 into a 2v1. Remaining close to his team is generally recommended for survivability. He is not ideally suited as a solo tank and performs better when paired with another Vanguard to create a more resilient frontline. His primary role is to disrupt the enemy backline and create space.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Basic Damage Combo:</u></b><br>A simple but effective sequence: <b>Rocky Jab (LMB)</b> → Follow with a powerful <b>Stone Haymaker (RMB)</b> for burst damage.<br><br></li>\n  <li><b><u>Charge to Haymaker:</u></b><br>Initiate with <b>Yancy Street Charge (Shift)</b> to lift enemies into the air or disrupt them → Immediately follow up with a <b>Stone Haymaker (RMB)</b> for significant burst damage on affected targets.<br><br></li>\n  <li><b><u>Embattled Leap Engage/Support:</u></b><br>Use <b>Embattled Leap (E)</b> to jump to a teammate on the frontline → Immediately activate your ultimate, <b>Clobberin' Time (Q)</b>, to further disrupt enemies → Follow up with <b>Stone Haymakers (RMB)</b> on the disoriented foes. This leap can also be used defensively to save a vulnerable ally.<br><br></li>\n  <li><b><u>Yancy Street Charge (Shift) Disruption:</u></b><br>Use this not just for damage, but to peel for allies by pushing enemies away, or to displace key enemy targets (like a healer or a channeling ultimate) out of an advantageous position.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Teams that heavily rely on movement-based crowd control abilities (knockbacks, pulls), as his passive immunity renders these ineffective against him. His disruptive capabilities can be strong against dive-heavy compositions if he can intercept and counter-initiate.<br><br></li>\n  <li><b>Challenging Against:</b> Flying enemies (e.g., <u>Storm</u>, <u>Iron Man</u> while airborne), as he lacks direct means of engaging airborne targets. Heroes who can effectively utilize high-ground positions can also present difficulties. Without traditional shielding, he can be vulnerable to sustained ranged damage if he overextends without adequate team support or <b>Embattled Leap</b> available.<br><br></li>\n  <li><b>Key Synergies:</b> Benefits from Team-Up synergies with <u>Invisible Woman</u> (<b>Cooperative Comrades</b> - damage resistance and health regen) and with <u>Wolverine</u>/<u>Hulk</u> (<b>Cosmic Fastball</b> - aggressive launch of Wolverine).</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Movement CC Immunity:</b> Completely immune to movement-based crowd control (knockbacks, launch-ups), making him incredibly difficult to displace.</li>\n  <li><b>Excellent Disruption:</b> <b>Yancy Street Charge (Shift)</b> and <b>Clobberin' Time (Q)</b> excel at scattering enemy formations and knocking them airborne.</li>\n  <li><b>Ally Support/Save Potential:</b> <b>Embattled Leap (E)</b> provides damage reduction to himself and a targeted ally, useful for engages or saving teammates.</li>\n  <li><b>Significant Health Pool:</b> Can withstand substantial amounts of damage.</li>\n  <li><b>Strong Initiation:</b> Abilities are well-suited for initiating team fights and diving the enemy backline.</li>\n  <li><b>Peeling Capability:</b> Can use his charge and knock-ups to protect vulnerable teammates.</li>\n  <li><b>Good Burst Damage:</b> <b>Stone Haymaker (RMB)</b>, especially after a setup, deals considerable damage.</li>\n  <li><b>Powerful Team-Ups:</b> Synergies with <u>Invisible Woman</u> and <u>Wolverine</u>/<u>Hulk</u> offer strong tactical advantages.</li>\n</ul>",
    "weaknesses": [
      "Even though he's immune to knockbacks and other displacements, he is capable of being stunned from Mantis's Spore Slumber and Doctor Strange's Ultimate Eye of Agamotto.",
      "Because he is melee focused, he works best when up close to enemies.",
      "His Embattled Leap ability can only be activated on allies, so if he is isolated and his Yancy Street Charge is on cooldown, he has no means to escape until it returns should he be surrounded or in line of enemy fire."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Who's the Strongest Now?",
        "description": "As the Thing, take down an enemy Hulk.",
        "points": 5
      },
      {
        "icon": null,
        "name": "What Time Is It?",
        "description": "As The Thing, launch up 4 enemies with a single use of Clobberin' Time.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Who needs four, when you got one like me.\"",
    "ingame_bio_text": "Benjamin J. Grimm is unquestionably the rock star of any team he's on. Always at the forefront of the fight, the Thing shields his allies with his unbreakable form, selflessly fending off any harm that comes their way.",
    "ingame_story_intro": "When Ben Grimm signed up to pilot an experimental spacecraft for his pal Reed Richards, he never imagined he'd return from the flight transformed into a monster. Even though cosmic rays turned him into the Thing, Ben still has a heart of gold beneath his rocky exterior.\nSince New York City plunged into eternal night, Ben has devoted himself to protecting his home from the monsters plaguing it.",
    "hero_stories": [
      {
        "title": "Gangs of Yancy Street",
        "content": "Ever since New York City became locked in a state of eternal night, the members of the Fantastic Four had been working tirelessly to protect the innocent civilians of Manhattan from the vampires who had overtaken the island. Of course not every civilian was so innocent... and not all of them wanted to be protected...",
        "status": null
      },
      {
        "title": "Shattered Hammer",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      },
      {
        "title": "Four Minute Wedding",
        "content": "Coming soon. Stay Tuned!",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "25/02/21: Version 20250221 / Season 1.5 Launch",
        "changes": [
          "The Thing was released as the 37th character to be introduced to Marvel Rivals as a Vanguard hero.",
          "Added 2 new costumes: First Family and Trench Coat.",
          "Added to the Fantastic Four Team-Up Ability with Invisible Woman, Mister Fantastic, and Human Torch and the Fastball Special Team-Up Ability with Wolverine and Hulk."
        ]
      },
      {
        "date_version": "25/03/14: Version 20250314",
        "changes": [
          "Fixed a discrepancy in the speed of the Embattled Leap across different player views under poor network conditions. No more inconsistencies--Ben Grimm is back to leaping at normal speed!"
        ]
      },
      {
        "date_version": "25/04/11: Version 20250411 / Season 2: Hellfire Gala Launch",
        "changes": [
          "Decrease Embattled Leap's damage reduction effect for himself and teammates from 30% to 25%."
        ]
      },
      {
        "date_version": "25/04/15: Version 20250415",
        "changes": [
          "Corrected the ability icon error in the KO Prompt when The Thing's Ultimate Ability causes terrain kills. Now, when he brings the pain, the prompt will accurately reflect the mayhem."
        ]
      },
      {
        "date_version": "25/04/18",
        "changes": [
          "Added 1 new costume: The Unlimited."
        ]
      },
      {
        "date_version": "25/04/30: Version 20250430",
        "changes": [
          "We've rocked out a fix for an issue that allowed The Thing's Embattled Leap to target teammates within an enemy Invisible Woman's ultimate. Now, he'll be as clueless as he should be."
        ]
      }
    ],
    "official_quote": "\"I promised ya, somewhere under all this rock is a heart of gold.\"",
    "official_description": "The Thing is a Vanguard hero in Marvel Rivals, and is the 37th hero introduced to the game's roster during Season 1: Eternal Night Falls. He has team-up abilities that work in conjunction with Invisible Woman, Mister Fantastic, Human Torch, Wolverine and Hulk."
  },
  "background": {
    "real_name": "Benjamin Jacob \"Ben\" Grimm",
    "aliases": [
      "Benjy",
      "The Ever-Lovin' Blue-Eyed Thing"
    ],
    "birthplace": "Manhattan, New York",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Blue",
    "hair_color": "Bald",
    "relatives": [
      "Alicia Masters (wife)",
      "Franklin Richards (godson)"
    ],
    "affiliation": [
      "Fantastic Four"
    ],
    "first_appearance_comic": "Fantastic Four (1961) #3",
    "recommended_comics": [],
    "lore_powers_skills": [
      "Sturdy rock-like skin",
      "Superhuman strength, durability and stamina",
      "Immortality",
      "Skilled hand-to-hand combatant"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22The+Thing%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "B",
    "win_rate": "47.75%",
    "wr_change": "N/A",
    "pick_rate": "15.31%",
    "pr_change": "N/A",
    "ban_rate": "1.23%",
    "matches": "228,063"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}