{
  "name": "Wolverine",
  "role": "Duelist",
  "stats": {
    "health": 350,
    "speed": "7 m/s",
    "difficulty": null,
    "color_theme": "#EF4444",
    "color_theme_secondary": "#1D4ED8"
  },
  "abilities": [
    {
      "name": "SAVAGE CLAW",
      "keybind": "LMB",
      "type": "Melee",
      "description": "Slash with Adamantium claws for a Claw Strike. Unleashing Feral Leap will enhance it to Berserk Claw Strike for a brief period.",
      "casting": null,
      "damage": "15\nDeal damage equal to 1.5% of the target's Max Health, with an extra 0.045% damage for each point of Rage",
      "damage_falloff": null,
      "fire_rate_interval": "The first three strikes have an interval of 0.27s between them, while the fourth strike has a 0.84s interval from the third strike",
      "ammo": null,
      "critical_hit": null,
      "cooldown": null,
      "range": "3.5",
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": null
    },
    {
      "name": "VICIOUS RAMPAGE",
      "keybind": "RMB",
      "type": "Movement-based damage ability",
      "description": "Dash forward and unleash a Claw Strike.",
      "casting": null,
      "damage": "15",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "3s",
      "range": "3m",
      "projectile_speed": "44m/s",
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "MAXIMUM DISTANCE - 7.5m"
    },
    {
      "name": "FERAL LEAP",
      "keybind": "SHIFT",
      "type": "Jump Melee",
      "description": "Leap like an animal to snatch the first enemy upon impact and Smash them to the ground. Unleashing this ability will enhance his normal attack to Berserk Claw Strike for a brief period.",
      "casting": null,
      "damage": "SNATCH DAMAGE- 35\nSMASH DAMAGE- 35",
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "12s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": null,
      "movement_boost": null,
      "energy_cost_details": null,
      "details": {
        "LEAP DISTANCE": "20m"
      }
    },
    {
      "name": "UNDYING ANIMAL",
      "keybind": "E",
      "type": "Self",
      "description": "Unleash a fierce howl to briefly reduce incoming damage.",
      "casting": null,
      "damage": null,
      "damage_falloff": null,
      "fire_rate_interval": null,
      "ammo": null,
      "critical_hit": null,
      "cooldown": "16s",
      "range": null,
      "projectile_speed": null,
      "charges": null,
      "duration": "5s",
      "movement_boost": null,
      "energy_cost_details": null,
      "details": "DAMAGE BOOST - 40%"
    }
  ],
  "ultimate": {
    "name": "LAST STAND",
    "keybind": "Q",
    "type": "Area",
    "description": "Knock enemies ahead airborne and spiral through the air, sweeping up enemies along the path and delivering a devastating impact at the landing point.",
    "casting": null,
    "damage": "KNOCKBACK DAMAGE - 50\nIMPACT BASE DAMAGE - 50\nDeal damage equal to 10% of the target's Max Health, with an extra 0.3% damage for each point of Rage",
    "range": "8m spherical radius",
    "effect": null,
    "duration": null,
    "health_upon_revival": null,
    "slow_rate": null,
    "projectile_speed": null,
    "movement_boost": null,
    "bonus_health_details": null,
    "energy_cost": null,
    "details": {
      "KNOCKDOWN TIME": "0.75s"
    }
  },
  "passives": [
    {
      "name": "BERSERKER RAGE",
      "details": {
        "RAGE PER SAVAGE CLAW HIT": 10,
        "RAGE PER BERSERK CLAW STRIKE HIT": 5,
        "RAGE PER FERAL LEAP SNATCH": 10,
        "RAGE PER VICIOUS RAMPAGE HIT": 15,
        "RAGE PER HIT TAKEN": 5
      }
    }
  ],
  "teamups": [
    {
      "name": "Fastball Special",
      "partner": [
        "Hulk",
        "The_Thing"
      ],
      "effect": null,
      "keybind": "C",
      "teamup_bonus": null,
      "duration": null,
      "cooldown": "3s when not thrown, 15s when thrown",
      "range_target": "Up to 20m",
      "special_notes": "Role: Anchor | Ability: Metal Cannonball",
      "details": "Casting: Targeted<br/>Special Effect: Undying Animal is the only ability that can be used while being held by Hulk or The Thing"
    }
  ],
  "gameplay": {
    "strategy_overview": "<b><u>Overall Playstyle:</u></b><br>\n<p>Wolverine is a melee-focused Duelist excelling at disrupting the enemy frontline and eliminating high-health targets, especially Tanks. His gameplay revolves around aggressive close-quarters combat, using <b>Savage Claw (LMB - 4-hit combo)</b> which scales damage with enemy max HP and his Rage level. <b>Vicious Rampage (RMB - short dash/strike)</b> builds Rage and can cancel Savage Claw's fourth hit delay. <b>Feral Leap (Shift)</b> grabs an enemy, smashes them down, enhances his next primary to <b>Berserk Claw Strike</b>, and builds Rage. His ultimate, <b>Last Stand (Q)</b>, is an AoE leap/slam, with damage scaling significantly with Rage (knockdown time slightly reduced S2).</p>\n<p>Position close to your team, focusing on engaging the enemy frontline. Use <b>Feral Leap</b> primarily to grab and pull enemy Tanks towards your team. His passive, <b>Regenerative Healing Factor</b> (activates out of combat, heals, grants bonus HP based on Rage, removes debuffs, resets Rage, 90s CD reduced by assists), and <b>Undying Animal (E - 50% damage reduction)</b> aid survivability. His second passive, <b>Berserker Rage</b>, builds by attacking/taking damage, increasing claw damage and Healing Factor bonus HP. S2 changed Rage gain: increased from Savage Claw hits, decreased from Berserk Claw/Feral Leap/Vicious Rampage.</p><br><br>\n\n<b><u>Key Combos & Ability Usage:</u></b><br>\n<ul>\n  <li><b><u>Basic Tank Buster Combo:</u></b><br>Activate <b>Undying Animal (E)</b> → Dash in with <b>Vicious Rampage (RMB)</b> → Land four <b>Savage Claw (LMB)</b> strikes to build Rage → Use <b>Feral Leap (Shift)</b> to grab the Tank and pull them → Unleash <b>Berserk Claw Strikes (LMB)</b>.<br><br></li>\n  <li><b><u>Mobility & Sustained Damage Combo:</u></b><br><b>Vicious Rampage (RMB)</b> for movement/Rage → <b>Savage Claw (LMB)</b> strikes → Immediately <b>Vicious Rampage (RMB)</b> again to cancel 4th claw strike delay and continue assault.<br><br></li>\n  <li><b><u>Ultimate Rage Combo (Last Stand - Q):</u></b><br>Build Rage to near maximum → Use <b>Feral Leap (Shift)</b> to grab an enemy (if possible, for positioning) → Activate <b>Last Stand (Q)</b> for significant AoE damage amplified by Rage.<br><br></li>\n  <li><b><u>Berserk Assault Combo:</u></b><br>Use <b>Feral Leap (Shift)</b> to grab an enemy (enhances next primary) → Immediately unleash rapid <b>Berserk Claw Strikes (LMB)</b> on the grabbed target.<br><br></li>\n  <li><b><u>Tank Displacement Combo:</u></b><br><b>Vicious Rampage (RMB)</b> to dash past the enemy Tank → Quickly turn → Use <b>Feral Leap (Shift)</b> to grab them, pulling them backward towards your team.<br><br></li>\n</ul>\n\n<b><u>Matchup Considerations:</u></b><br>\n<ul>\n  <li><b>Favorable Against:</b> Tanks without strong shields/high mobility (e.g., <u>Groot</u>, <u>Venom</u>). Strategists with poor escape options (can reach and eliminate them in close combat).<br><br></li>\n  <li><b>Challenging Against:</b> Highly mobile Duelists (e.g., <u>Spider-Man</u>, <u>Iron Fist</u>) who are hard to stick to. Characters with strong shields/invulnerability (e.g., <u>Magneto</u>, <u>Emma Frost</u>) that negate his damage. Long-range, high-damage hitscan (e.g., <u>Hawkeye</u>, <u>Hela</u>) who can kill him before he closes distance. Strong crowd control that interrupts his engagements.<br><br></li>\n  <li><b>Key Synergies:</b> Team-Up with <u>Hulk</u>/<u>The Thing</u> (<b>Metal Cannonball</b>) launches him into enemies, activating Berserker Claw Strike on landing.</li>\n</ul><br>\n\n<b><u>Core Strengths:</u></b><br>\n<ul>\n  <li><b>Exceptional Tank Busting:</b> Primary attack (<b>Savage Claw</b>) scales damage with enemy max HP and Rage.</li>\n  <li><b>Good Mobility for Engagement:</b> <b>Vicious Rampage (RMB)</b> and <b>Feral Leap (Shift)</b> allow quick gap closing.</li>\n  <li><b>High Survivability:</b> <b>Regenerative Healing Factor (Passive)</b> and <b>Undying Animal (E - 50% DR)</b> allow him to withstand significant damage.</li>\n  <li><b>Powerful AoE Ultimate:</b> <b>Last Stand (Q)</b> disrupts formations and deals high damage, especially with high Rage.</li>\n  <li><b>Effective Displacement:</b> <b>Feral Leap (Shift)</b> can pull key targets out of position.</li>\n  <li><b>Rage Mechanic Amplification:</b> Berserker Rage increases damage and healing, rewarding aggression.</li>\n  <li><b>Sustained Melee Pressure:</b> Can stick to targets and apply continuous damage.</li>\n  <li><b>Impactful Team-Up:</b> <b>Metal Cannonball</b> provides an alternative engagement method.</li>\n</ul>",
    "weaknesses": [
      "Relies heavily on dealing constant, uninterrupted damage in order to keep his Berserker Rage at high stacks to maximize his damage-per-second.",
      "Is less effective against team compositions with fewer Vanguards. On his own, Wolverine is not an effective backline diver due to his reliance on percentage-based damage.",
      "Limited mobility compared to other melee-oriented heroes (no double jumps or wall interactions).",
      "Savage Claw has a very low melee range, requiring Wolverine to be very close to his targets.",
      "Feral Leap can sometimes miss targets if they are extremely close to Wolverine when he jumps. This can be somewhat alleviated by aiming downwards while casting Feral Leap.",
      "The follow-up slam strike of Last Stand may feel counter-intuitive; the player needs to aim directly down and activate the slam manually.",
      "His team-up with the Hulk relies on Hulk to initiate the throw, meaning that Wolverine has no autonomy over where he is thrown."
    ],
    "achievements": [
      {
        "icon": null,
        "name": "Learn THIS, bub!",
        "description": "As Wolverine, take down an enemy Magneto.",
        "points": 5
      },
      {
        "icon": null,
        "name": "Rage Uncaged",
        "description": "As Wolverine, land 3 KOs with a single use of Last Stand.",
        "points": 10
      }
    ]
  },
  "lore_details": {
    "ingame_bio_quote": "\"Anyone stands in my way, they won't be standing much longer.\"",
    "ingame_bio_text": "Thanks to his regenerative healing factor and berserker rage, the centuries-old Logan can fight through the worst pain to go claw-to-claw with any foe. The Wolverine stands ready to shred through all obstacles in his way with his Adamantium claws.",
    "ingame_story_intro": null,
    "hero_stories": [
      {
        "title": "Accompanied Envoy",
        "content": "\"Another one, Freddie. Heavy on the orchid nectar.\"\n\"You got it, Logan,\" said Fred Dukes, the bartender of the Green Lagoon - a secluded watering hole nestled into the heart of Krakoa, the living island that served as a safe haven for Mutants from across time and space.\nThe massive man plucked a beautiful tropical flower from a tiny garden behind the bar. He squeezed it in his oversized hand, causing the strange pink liquid contained within its delicate blossom to trickle into a tall glass. Mixing in a few other natural ingredients, he covered the glass and gave it a quick shake before sliding it across the bar to his most loyal customer.\n\"Not used to you ordering off the organic menu,\" Fred said with a smile, noting that Logan's tastes usually tended to be a bit more traditional.\n\"Yeah, well, I didn't come here to forget anythin' tonight, bub,\" Logan said, gazing at the nectar swirling in his glass. \"For once, I wanna remember every detail.\"\n\"And I would like to hear them as well,\" a voice said as another man approached the bar. \"If you are willing to share, my friend...\"",
        "status": null
      },
      {
        "title": "Rising Pulse",
        "content": "\"RRRRRAAAARGGGHHH!\"",
        "status": null
      },
      {
        "title": "Madripoor Memories",
        "content": "(Coming soon. Stay Tuned!)",
        "status": null
      }
    ],
    "balance_changes": [
      {
        "date_version": "24/12/06:Season 0: Dooms' RiseLaunch",
        "changes": [
          "Wolverine was added as the 33rd character to be introduced to Marvel Rivals as a Duelist hero.",
          "Added 2 new costumes: Lone Wolf and Deadpool & Wolverine.",
          "Added the Rage Uncaged achievement.",
          "Added to the Fastball Special Team-Up Ability with Hulk"
        ]
      },
      {
        "date_version": "24/12/10:Version 20241210",
        "changes": [
          "When Wolverine had his Deadpool & Wolverine costume equipped, no ability voice lines other than the Undying Animal ability's line would play. This issue has been resolved."
        ]
      },
      {
        "date_version": "25/01/08:",
        "changes": [
          "Addressed occasional malfunctions with, or inability to use Wolverine's team-up ability.",
          "Addressed irregularities and occasional failure to end Wolverine's Feral Leap, along with occasional abnormal behavior."
        ]
      },
      {
        "date_version": "25/01/10:Version 20250110/Season 1: Eternal Night FallsLaunch",
        "changes": [
          "Increase base health from 300 to 350.",
          "Reduce the damage reduction ratio provided by Undying Animal from 50% to 40%.",
          "Added 1 new costume: Blood Berserker."
        ]
      },
      {
        "date_version": "25/01/22:Version 20250122/Fortune & ColorsEvent",
        "changes": [
          "Frame rate no longer affects the number of attacks in the enhanced Savage Claw after using Feral Leap.",
          "Fixed an issue where Wolverine's ultimate ability occasionally wouldn't end properly after landing after being pulled back."
        ]
      },
      {
        "date_version": "25/02/07:Version 20250207",
        "changes": [
          "Fixed occasional synchronization issues in the Fastball Special Team-Up Ability where on Wolverine's side, he would appear as being held by the Hulk, but others would see Wolverine still in his original place. Now, everyone's in sync to play ball."
        ]
      },
      {
        "date_version": "25/02/14:Version 20250214",
        "changes": [
          "Fixed a little mischief where because of their Team-Up Ability, Wolverine's Berserk Claw Strike could, under certain situations, be activated during Feral Leap. Now, there will be no more mix-ups!"
        ]
      },
      {
        "date_version": "25/03/07:Version 20250307/Galacta's Cosmic AdventureEvent",
        "changes": [
          "Fixed a quirk where characters launched up by Wolverine's Ultimate Ability would sometimes exhibit exaggerated jumping abilities. The mutant's effect is now properly contained!",
          "Resolved a rare issue on PlayStation where Wolverine's Rage Uncaged trophy sometimes wouldn't unlock."
        ]
      },
      {
        "date_version": "25/03/14:Version 20250314",
        "changes": [
          "Resolved a rare discrepancy between his animation and effects when Wolverine executed the dive of his Ultimate Ability from the highest point. Now, when Logan strikes, it's as precise and impactful as his adamantium claws!"
        ]
      },
      {
        "date_version": "25/03/27:Version 20250327",
        "changes": [
          "Fixed a snag in Wolverine's Ultimate Ability where, under high network latency, foes sent flying and slammed into the ground could sometimes end up in the wrong location. Now, every Last Stand lands exactly where it should."
        ]
      },
      {
        "date_version": "25/04/08:",
        "changes": [
          "Fixed a rarely occurring issue where Wolverine's Feral Leap could leave him stuck in an abnormal state, unable to finish the move. Now, Logan can unleash his claws with confidence, ensuring his foes don't get a second to breathe!",
          "Resolved a rare occurrence where being hit by Wolverine's Feral Leap could render all abilities unusable. No more claw-induced chaos--heroes can now fight on without fear of losing their abilities mid-battle!"
        ]
      },
      {
        "date_version": "25/04/11:Version 20250411/Season 2: Hellfire GalaLaunch",
        "changes": [
          "Increase Rage gained from Savage Claw hits from 7 to 10, while Rage gained from Berserk Claw Strike has been decreased from 7 to 5.",
          "Reduce Rage gained from Feral Leap from 20 to 10, and from Vicious Rampage from 20 to 15.",
          "However, Rage gained from taking damage has been increased from 3 to 5.",
          "Reduce the time an enemy is knocked down after impact from Last Stand from 1 second to 0.75 seconds."
        ]
      },
      {
        "date_version": "25/04/15:Version 20250415",
        "changes": [
          "Fixed an issue where Wolverine's Ultimate Ability landing sometimes wouldn't finish properly in poor network conditions. Now, the best there is at what he does can unleash his fury without any hiccups!",
          "Resolved an issue where Wolverine could sometimes be unable to control his direction during the Fastball Special after using it multiple times. Now, every throw will be a claw-some hit!"
        ]
      },
      {
        "date_version": "25/04/30:Version 20250430",
        "changes": [
          "We've sliced through a glitch where if Wolverine responds to a Fastball Special request while within Invisible Woman's ultimate, it would sometimes result in abnormal invisibility effects.",
          "Fixed a flaw in the second stage of his ultimate where midair knockbacks lost their bite and dealt no damage. Now, when Wolverine soars into the fray, every strike is felt with the raw power of a true berserker!"
        ]
      },
      {
        "date_version": "25/05/02:",
        "changes": [
          "Added 1 new costume: Patch (unlocked from the Hellfire Gala Moments season missions)"
        ]
      }
    ],
    "official_quote": "\"You pick the wrong day to drag me into this mess, bub.\"",
    "official_description": "Wolverine is a Duelist hero in Marvel Rivals, and is the 33rd hero introduced to the game's roster. He has a team-up ability that works in conjunction with Hulk and The Thing."
  },
  "background": {
    "real_name": "James Howlett",
    "aliases": [
      "Logan",
      "Weapon X"
    ],
    "birthplace": "Cold Lake, Alberta",
    "birthdate": null,
    "gender": "Male",
    "eye_color": "Brown",
    "hair_color": "Black",
    "relatives": [
      "Elizabeth Howlett (mother; deceased)",
      "John Howlett (legal father; deceased)",
      "Thomas Logan (father; deceased)"
    ],
    "affiliation": [
      "X-Men"
    ],
    "first_appearance_comic": null,
    "recommended_comics": [],
    "lore_powers_skills": [
      "Superhuman speed, strength, agility, reflexes, and durability",
      "Retractable adamantium claws",
      "Regenerative healing factor",
      "Indestructible adamantium skeleton",
      "Enhanced senses"
    ]
  },
  "misc": {
    "voice_actor": null,
    "quotes_link": null,
    "community_buzz": "https://www.reddit.com/r/marvelrivals/search/?q=%22Wolverine%22&type=posts&t=month",
    "helpful_links": []
  },
  "meta_stats": {
    "tier": "C",
    "win_rate": "47.92%",
    "wr_change": "-1.70%",
    "pick_rate": "8.99%",
    "pr_change": "+0.36%",
    "ban_rate": "4.15%",
    "matches": "133,916"
  },
  "data_sources": {
    "wiki": [],
    "tracker": [],
    "comic_wiki": []
  }
}